{
  "fetched_papers": [
    {
      "title": "The p53-mdm-2 autoregulatory feedback loop.",
      "abstract": "The p53 protein can bind to a set of specific DNA sequences, and this may activate the transcription of genes adjacent to these DNA elements. The mdm-2 gene is shown here to contain a p53 DNA-binding site and a genetically responsive element such that expression of the mdm-2 gene can be regulated by the level of wild-type p53 protein. The mdm-2 protein, in turn, can complex with p53 and decrease its ability to act as a positive transcription factor at the mdm-2 gene-responsive element. In this way, the mdm-2 gene is autoregulated. The p53 protein regulates the mdm-2 gene at the level of transcription, and the mdm-2 protein regulates the p53 protein at the level of its activity. This creates a feedback loop that regulates both the activity of the p53 protein and the expression of the mdm-2 gene.",
      "openalex_id": "https://openalex.org/W2170494099",
      "domain": "Cancer-related Molecular Pathways",
      "subdomain": "",
      "published_date": "1993-07-01",
      "citations": 1789,
      "mechanism_score": null
    },
    {
      "title": "Inhibition of mTORC1 leads to MAPK pathway activation through a PI3K-dependent feedback loop in human cancer",
      "abstract": "Numerous studies have established a causal link between aberrant mammalian target of rapamycin (mTOR) activation and tumorigenesis, indicating that mTOR inhibition may have therapeutic potential. In this study, we show that rapamycin and its analogs activate the MAPK pathway in human cancer, in what represents a novel mTORC1-MAPK feedback loop. We found that tumor samples from patients with biopsy-accessible solid tumors of advanced disease treated with RAD001, a rapamycin derivative, showed an administration schedule-dependent increase in activation of the MAPK pathway. RAD001 treatment also led to MAPK activation in a mouse model of prostate cancer. We further show that rapamycin-induced MAPK activation occurs in both normal cells and cancer cells lines and that this feedback loop depends on an S6K-PI3K-Ras pathway. Significantly, pharmacological inhibition of the MAPK pathway enhanced the antitumoral effect of mTORC1 inhibition by rapamycin in cancer cells in vitro and in a xenograft mouse model. Taken together, our findings identify MAPK activation as a consequence of mTORC1 inhibition and underscore the potential of a combined therapeutic approach with mTORC1 and MAPK inhibitors, currently employed as single agents in the clinic, for the treatment of human cancers.",
      "openalex_id": "https://openalex.org/W2157983986",
      "domain": "PI3K/AKT/mTOR signaling in cancer",
      "subdomain": "",
      "published_date": "2008-08-01",
      "citations": 1356,
      "mechanism_score": null
    },
    {
      "title": "Desert dust suppressing precipitation: A possible desertification feedback loop",
      "abstract": "The effect of desert dust on cloud properties and precipitation has so far been studied solely by using theoretical models, which predict that rainfall would be enhanced. Here we present observations showing the contrary; the effect of dust on cloud properties is to inhibit precipitation. Using satellite and aircraft observations we show that clouds forming within desert dust contain small droplets and produce little precipitation by drop coalescence. Measurement of the size distribution and the chemical analysis of individual Saharan dust particles collected in such a dust storm suggest a possible mechanism for the diminished rainfall. The detrimental impact of dust on rainfall is smaller than that caused by smoke from biomass burning or anthropogenic air pollution, but the large abundance of desert dust in the atmosphere renders it important. The reduction of precipitation from clouds affected by desert dust can cause drier soil, which in turn raises more dust, thus providing a possible feedback loop to further decrease precipitation. Furthermore, anthropogenic changes of land use exposing the topsoil can initiate such a desertification feedback process.",
      "openalex_id": "https://openalex.org/W2124867185",
      "domain": "Aeolian processes and effects",
      "subdomain": "",
      "published_date": "2001-05-15",
      "citations": 849,
      "mechanism_score": null
    },
    {
      "title": "Negative Feedback Loop of Wnt Signaling through Upregulation of Conductin/Axin2 in Colorectal and Liver Tumors",
      "abstract": "Activation of Wnt signaling through Î²-catenin/TCF complexes is a key event in the development of various tumors, in particular colorectal and liver tumors. Wnt signaling is controlled by the negative regulator conductin/axin2/axil, which induces degradation of Î²-catenin by functional interaction with the tumor suppressor APC and the serine/threonine kinase GSK3Î². Here we show that conductin is upregulated in human tumors that are induced by Î²-catenin/Wnt signaling, i.e., high levels of conductin protein and mRNA were found in colorectal and liver tumors but not in the corresponding normal tissues. In various other tumor types, conductin levels did not differ between tumor and normal tissue. Upregulation of conductin was also observed in the APC-deficient intestinal tumors of Min mice. Inhibition of Wnt signaling by a dominant-negative mutant of TCF downregulated conductin but not the related protein, axin, in DLD1 colorectal tumor cells. Conversely, activation of Wnt signaling by Wnt-1 or dishevelled increased conductin levels in MDA MB 231 and Neuro2A cells, respectively. In time course experiments, stabilization of Î²-catenin preceded the upregulation of conductin by Wnt-1. These results demonstrate that conductin is a target of the Wnt signaling pathway. Upregulation of conductin may constitute a negative feedback loop that controls Wnt signaling activity.",
      "openalex_id": "https://openalex.org/W2112763851",
      "domain": "Wnt/β-catenin signaling in development and cancer",
      "subdomain": "",
      "published_date": "2002-02-01",
      "citations": 1027,
      "mechanism_score": null
    },
    {
      "title": "Analysis of a sleep-dependent neuronal feedback loop: the slow-wave microcontinuity of the EEG",
      "abstract": "Increasing depth of sleep corresponds to an increasing gain in the neuronal feedback loops that generate the low-frequency (slow-wave) electroencephalogram (EEG). We derived the maximum-likelihood estimator of the feedback gain and applied it to quantify sleep depth. The estimator computes the fraction (0%-100%) of the current slow wave which continues in the near-future (0.02 s later) EEG. Therefore, this percentage was dubbed slow-wave microcontinuity (SW%). It is not affected by anatomical parameters such as skull thickness, which can considerably bias the commonly used slow-wave power (SWP). In our study, both of the estimators SW% and SWP were monitored throughout two nights in 22 subjects. Each subject took temazepam (a benzodiazepine) on one of the two nights. Both estimators detected the effects of age, temazepam, and time of night on sleep. Females were found to have twice the SWP of males, but no gender effect on SW% was found. This confirms earlier reports that gender affects SWP but not sleep depth. Subjectively assessed differences in sleep quality between the nights were correlated to differences in SW%, not in SWP. These results demonstrate that slow-wave microcontinuity, being based on a physiological model of sleep, reflects sleep depth more closely than SWP does.",
      "openalex_id": "https://openalex.org/W2144691514",
      "domain": "EEG and Brain-Computer Interfaces",
      "subdomain": "",
      "published_date": "2000-01-01",
      "citations": 861,
      "mechanism_score": null
    },
    {
      "title": "An E2F/miR-20a Autoregulatory Feedback Loop",
      "abstract": "The E2F family of transcription factors is essential in the regulation of the cell cycle and apoptosis. While the activity of E2F1-3 is tightly controlled by the retinoblastoma family of proteins, the expression of these factors is also regulated at the level of transcription, post-translational modifications and protein stability. Recently, a new level of regulation of E2Fs has been identified, where micro-RNAs (miRNAs) from the mir-17-92 cluster influence the translation of the E2F1 mRNA. We now report that miR-20a, a member of the mir-17-92 cluster, modulates the translation of the E2F2 and E2F3 mRNAs via binding sites in their 3'-untranslated region. We also found that the endogenous E2F1, E2F2, and E2F3 directly bind the promoter of the mir-17-92 cluster activating its transcription, suggesting an autoregulatory feedback loop between E2F factors and miRNAs from the mir-17-92 cluster. Our data also point toward an anti-apoptotic role for miR-20a, since overexpression of this miRNA decreased apoptosis in a prostate cancer cell line, while inhibition of miR-20a by an antisense oligonucleotide resulted in increased cell death after doxorubicin treatment. This anti-apoptotic role of miR-20a may explain some of the oncogenic capacities of the mir-17-92 cluster. Altogether, these results suggest that the autoregulation between E2F1-3 and miR-20a is important for preventing an abnormal accumulation of E2F1-3 and may play a role in the regulation of cellular proliferation and apoptosis.",
      "openalex_id": "https://openalex.org/W2042027879",
      "domain": "MicroRNA in disease regulation",
      "subdomain": "",
      "published_date": "2006-11-29",
      "citations": 614,
      "mechanism_score": null
    },
    {
      "title": "Networks, Dynamics, and the Small‐World Phenomenon",
      "abstract": "The small‐world phenomenon formalized in this article as the coincidence of high local clustering and short global separation, is shown to be a general feature of sparse, decentralized networks that are neither completely ordered nor completely random. Networks of this kind have received little attention, yet they appear to be widespread in the social and natural sciences, as is indicated here by three distinct examples. Furthermore, small admixtures of randomness to an otherwise ordered network can have a dramatic impact on its dynamical, as well as structural, properties‐a feature illustrated by a simple model of disease transmission.",
      "openalex_id": "https://openalex.org/W2002470750",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "1999-09-01",
      "citations": 1530,
      "mechanism_score": null
    },
    {
      "title": "Network Dynamics and Field Evolution: The Growth of Interorganizational Collaboration in the Life Sciences",
      "abstract": "A recursive analysis of network and institutional evolution is offered to account for the decentralized structure of the commercial field of the life sciences. Four alternative logics of attachment—accumulative advantage, homophily, follow‐the‐trend, and multiconnectivity—are tested to explain the structure and dynamics of interorganizational collaboration in biotechnology. Using multiple novel methods, the authors demonstrate how different rules for affiliation shape network evolution. Commercialization strategies pursued by early corporate entrants are supplanted by universities, research institutes, venture capital, and small firms. As organizations increase their collaborative activities and diversify their ties to others, cohesive subnetworks form, characterized by multiple, independent pathways. These structural components, in turn, condition the choices and opportunities available to members of a field, thereby reinforcing an attachment logic based on differential connections to diverse partners.",
      "openalex_id": "https://openalex.org/W1645343793",
      "domain": "Business Strategy and Innovation",
      "subdomain": "",
      "published_date": "2005-01-01",
      "citations": 1988,
      "mechanism_score": null
    },
    {
      "title": "The Statistical Evaluation of Social Network Dynamics",
      "abstract": "A class of statistical models is proposed for longitudinal network data. The dependent variable is the changing (or evolving) relation network, represented by two or more observations of a directed graph with a fixed set of actors. The network evolution is modeled as the consequence of the actors making new choices, or withdrawing existing choices, on the basis of functions, with fixed and random components, that the actors try to maximize. Individual and dyadic exogenous variables can be used as covariates. The change in the network is modeled as the stochastic result of network effects (reciprocity, transitivity, etc.) and these covariates. The existing network structure is a dynamic constraint for the evolution of the structure itself. The models are continuous-time Markov chain models that can be implemented as simulation models. The model parameters are estimated from observed data. For estimating and testing these models, statistical procedures are proposed that are based on the method of moments. The statistical procedures are implemented using a stochastic approximation algorithm based on computer simulations of the network evolution process.",
      "openalex_id": "https://openalex.org/W2104725117",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "2001-01-01",
      "citations": 1202,
      "mechanism_score": null
    },
    {
      "title": "NEURAL NETWORK DYNAMICS",
      "abstract": "Neural network modeling is often concerned with stimulus-driven responses, but most of the activity in the brain is internally generated. Here, we review network models of internally generated activity, focusing on three types of network dynamics: (a) sustained responses to transient stimuli, which provide a model of working memory; (b) oscillatory network activity; and (c) chaotic activity, which models complex patterns of background spiking in cortical and other circuits. We also review propagation of stimulus-driven activity through spontaneously active networks. Exploring these aspects of neural network dynamics is critical for understanding how neural circuits produce cognitive function.",
      "openalex_id": "https://openalex.org/W2123745704",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2005-03-22",
      "citations": 503,
      "mechanism_score": null
    },
    {
      "title": "Brain network dynamics are hierarchically organized in time",
      "abstract": "Significance We address the important question of the temporal organization of large-scale brain networks, finding that the spontaneous transitions between networks of interacting brain areas are predictable. More specifically, the network activity is highly organized into a hierarchy of two distinct metastates, such that transitions are more probable within, than between, metastates. One of these metastates represents higher order cognition, and the other represents the sensorimotor systems. Furthermore, the time spent in each metastate is subject-specific, is heritable, and relates to behavior. Although evidence of non–random-state transitions has been found at the microscale, this finding at the whole-brain level, together with its relation to behavior, has wide implications regarding the cognitive role of large-scale resting-state networks.",
      "openalex_id": "https://openalex.org/W2765216222",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2017-10-30",
      "citations": 922,
      "mechanism_score": null
    },
    {
      "title": "Synaptic Mechanisms and Network Dynamics Underlying Spatial Working Memory in a Cortical Network Model",
      "abstract": "Single-neuron recordings from behaving primates have established a link between working memory processes and information-specific neuronal persistent activity in the prefrontal cortex. Using a network model endowed with a columnar architecture and based on the physiological properties of cortical neurons and synapses, we have examined the synaptic mechanisms of selective persistent activity underlying spatial working memory in the prefrontal cortex. Our model reproduces the phenomenology of the oculomotor delayed-response experiment of Funahashi et al. (S. Funahashi, C.J. Bruce and P.S. Goldman-Rakic, Mnemonic coding of visual space in the monkey's dorsolateral prefrontal cortex. J Neurophysiol 61:331-349, 1989). To observe stable spontaneous and persistent activity, we find that recurrent synaptic excitation should be primarily mediated by NMDA receptors, and that overall recurrent synaptic interactions should be dominated by inhibition. Isodirectional tuning of adjacent pyramidal cells and interneurons can be accounted for by a structured pyramid-to-interneuron connectivity. Robust memory storage against random drift of the tuned persistent activity and against distractors (intervening stimuli during the delay period) may be enhanced by neuromodulation of recurrent synapses. Experimentally testable predictions concerning the neural basis of working memory are discussed.",
      "openalex_id": "https://openalex.org/W1989512479",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2000-09-01",
      "citations": 1203,
      "mechanism_score": null
    },
    {
      "title": "Emergent Behavior in Flocks",
      "abstract": "We provide a model (for both continuous and discrete time) describing the evolution of a flock. Our model is parameterized by a constant beta capturing the rate of decay-which in our model is polynomial-of the influence between birds in the flock as they separate in space. Our main result shows that when beta<1/2 convergence of the flock to a common velocity is guaranteed, while for betages1/2 convergence is guaranteed under some condition on the initial positions and velocities of the birds only",
      "openalex_id": "https://openalex.org/W2103714988",
      "domain": "Distributed Control Multi-Agent Systems",
      "subdomain": "",
      "published_date": "2007-05-01",
      "citations": 1744,
      "mechanism_score": null
    },
    {
      "title": "Emergent behavior in active colloids",
      "abstract": "Active colloids are microscopic particles, which self-propel through viscous\\nfluids by converting energy extracted from their environment into directed\\nmotion. We first explain how articial microswimmers move forward by generating\\nnear-surface flow fields via self-phoresis or the self-induced Marangoni\\neffect. We then discuss generic features of the dynamics of single active\\ncolloids in bulk and in confinement, as well as in the presence of gravity,\\nfield gradients, and fluid flow. In the third part, we review the emergent\\ncollective behavior of active colloidal suspensions focussing on their\\nstructural and dynamic properties. After summarizing experimental observations,\\nwe give an overview on the progress in modeling collectively moving active\\ncolloids. While active Brownian particles are heavily used to study collective\\ndynamics on large scales, more advanced methods are necessary to explore the\\nimportance of hydrodynamic and phoretic particle interactions. Finally, the\\nrelevant physical approaches to quantify the emergent collective behavior are\\npresented.\\n",
      "openalex_id": "https://openalex.org/W2254944678",
      "domain": "Micro and Nano Robotics",
      "subdomain": "",
      "published_date": "2016-05-11",
      "citations": 396,
      "mechanism_score": null
    },
    {
      "title": "A Robot that Walks; Emergent Behaviors from a Carefully Evolved Network",
      "abstract": "Most animals have significant behavioral expertise built in without having to explicitly learn it all from scratch. This expertise is a product of evolution of the organism; it can be viewed as a very long-term form of learning which provides a structured system within which individuals might learn more specialized skills or abilities. This paper suggests one possible mechanism for analagous robot evolution by describing a carefully designed series of networks, each one being a strict augmentation of the previous one, which control a six-legged walking machine capable of walking over rough terrain and following a person passively sensed in the infrared spectrum. As the completely decentralized networks are augmented, the robot's performance and behavior repertoire demonstrably improve. The rationale for such demonstrations is that they may provide a hint as to the requirements for automatically building massive networks to carry out complex sensory-motor tasks. The experiments with an actual robot ensure that an essence of reality is maintained and that no critical disabling problems have been ignored.",
      "openalex_id": "https://openalex.org/W2624516165",
      "domain": "Modular Robots and Swarm Intelligence",
      "subdomain": "",
      "published_date": "1989-06-01",
      "citations": 546,
      "mechanism_score": null
    },
    {
      "title": "A one‐parameter Budyko model for water balance captures emergent behavior in darwinian hydrologic models",
      "abstract": "Abstract Hydrologic models can be categorized as being either Newtonian or Darwinian in nature. The Newtonian approach requires a thorough understanding of the individual physical processes acting in a watershed in order to build a detailed hydrologic model based on the conservation equations. The Darwinian approach seeks to explain the behavior of a hydrologic system as a whole by identifying simple and robust temporal or spatial patterns that capture the relevant processes. Darwinian‐based hydrologic models include the Soil Conservation Service (SCS) curve number model, the “abcd” model, and the Budyko‐type models. However, these models were developed based on widely differing principles and assumptions and applied to distinct time scales. Here, we derive a one‐parameter Budyko‐type model for mean annual water balance which is based on a generalization of the proportionality hypothesis of the SCS model and therefore is independent of temporal scale. Furthermore, we show that the new model is equivalent to the key equation of the “abcd” model. Theoretical lower and upper bounds of the new model are identified and validated based on previous observations. Thus, we illustrate a temporal pattern of water balance amongst Darwinian hydrologic models, which allows for synthesis with the Newtonian approach and offers opportunities for progress in hydrologic modeling.",
      "openalex_id": "https://openalex.org/W1587146230",
      "domain": "Hydrology and Watershed Management Studies",
      "subdomain": "",
      "published_date": "2014-06-17",
      "citations": 317,
      "mechanism_score": null
    },
    {
      "title": "A robot that walks; emergent behaviors from a carefully evolved network",
      "abstract": "The author describes a carefully designed series of networks, each one being a strict augmentation of the previous one, which control a six-legged walking machine capable of walking over rough terrain and following a person passively sensed in the infrared spectrum. As the completely decentralized networks are augmented, the robot's performance and behavior repertoire demonstrably improve. The rationale for such demonstrations is that they can help identify requirements for automatically building massive networks to carry out complex sensory-motor tasks. The experiments with an actual robot ensure that an essence reality is maintained and that no critical disabling problems have been ignored. The present work is based on the drawing of analogies between evolution in the animal world and robotic evaluation.< <ETX xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">&gt;</ETX>",
      "openalex_id": "https://openalex.org/W1640247718",
      "domain": "Robotic Locomotion and Control",
      "subdomain": "",
      "published_date": "2003-01-07",
      "citations": 213,
      "mechanism_score": null
    },
    {
      "title": "Cognitive radio: brain-empowered wireless communications",
      "abstract": "Cognitive radio is viewed as a novel approach for improving the utilization of a precious natural resource: the radio electromagnetic spectrum. The cognitive radio, built on a software-defined radio, is defined as an intelligent wireless communication system that is aware of its environment and uses the methodology of understanding-by-building to learn from the environment and adapt to statistical variations in the input stimuli, with two primary objectives in mind: /spl middot/ highly reliable communication whenever and wherever needed; /spl middot/ efficient utilization of the radio spectrum. Following the discussion of interference temperature as a new metric for the quantification and management of interference, the paper addresses three fundamental cognitive tasks. 1) Radio-scene analysis. 2) Channel-state estimation and predictive modeling. 3) Transmit-power control and dynamic spectrum management. This work also discusses the emergent behavior of cognitive radio.",
      "openalex_id": "https://openalex.org/W2071707134",
      "domain": "Cognitive Radio Networks and Spectrum Sensing",
      "subdomain": "",
      "published_date": "2005-02-01",
      "citations": 11904,
      "mechanism_score": null
    },
    {
      "title": "Self-Organization in Biological Systems",
      "abstract": "The synchronized flashing of fireflies at night. The spiraling patterns of an aggregating slime mold. The anastomosing network of army-ant trails. The coordinated movements of a school of fish. Researchers are finding in such patterns--phenomena that have fascinated naturalists for centuries--a fertile new approach to understanding biological systems: the study of self-organization. This book, a primer on self-organization in biological systems for students and other enthusiasts, introduces readers to the basic concepts and tools for studying self-organization and then examines numerous examples of self-organization in the natural world. Self-organization refers to diverse pattern formation processes in the physical and biological world, from sand grains assembling into rippled dunes to cells combining to create highly structured tissues to individual insects working to create sophisticated societies. What these diverse systems hold in common is the proximate means by which they acquire order and structure. In self-organizing systems, pattern at the global level emerges solely from interactions among lower-level components. Remarkably, even very complex structures result from the iteration of surprisingly simple behaviors performed by individuals relying on only local information. This striking conclusion suggests important lines of inquiry: To what degree is environmental rather than individual complexity responsible for group complexity? To what extent have widely differing organisms adopted similar, convergent strategies of pattern formation? How, specifically, has natural selection determined the rules governing interactions within biological systems? Broad in scope, thorough yet accessible, this book is a self-contained introduction to self-organization and complexity in biology--a field of study at the forefront of life sciences research",
      "openalex_id": "https://openalex.org/W1629051378",
      "domain": "Genetics, Bioinformatics, and Biomedical Research",
      "subdomain": "",
      "published_date": "2001-12-31",
      "citations": 2912,
      "mechanism_score": null
    },
    {
      "title": "Protocols for self-organization of a wireless sensor network",
      "abstract": "We present a suite of algorithms for self-organization of wireless sensor networks in which there is a scalably large number of mainly static nodes with highly constrained energy resources. The protocols further support slow mobility by a subset of the nodes, energy-efficient routing, and formation of ad hoc subnetworks for carrying out cooperative signal processing functions among a set of the nodes.",
      "openalex_id": "https://openalex.org/W2162650992",
      "domain": "Energy Efficient Wireless Sensor Networks",
      "subdomain": "",
      "published_date": "2000-01-01",
      "citations": 2063,
      "mechanism_score": null
    },
    {
      "title": "At home in the universe: the search for laws of self-organization and complexity",
      "abstract": "Complexity theory is one of the most controversial areas of current scientific research. Developing out of chaos theory, complexity suggests that there are hidden tendencies in nature to select ordered states, even when statistically they are vastly outnumbered by chaotic possibilities: that there is a deep natural impulse towards order, counteracting the degenerative tendencies of the Second Law of Thermodynamics. Like chaos, complexity is a multidisciplinary area of research and those involved include physicists, economists and biologists. This is a study of complexity.",
      "openalex_id": "https://openalex.org/W2100317815",
      "domain": "Chaos, Complexity, and Education",
      "subdomain": "",
      "published_date": "1996-02-01",
      "citations": 2902,
      "mechanism_score": null
    },
    {
      "title": "Self-Reports in Organizational Research: Problems and Prospects",
      "abstract": "Self-reports figure prominently in organizational and management research, but there are several problems associated with their use. This article identifies six categories of self-reports and discusses such problems as common method variance, the consistency motif, and social desirability. Statistical and post hoc remedies and some procedural methods for dealing with artifactual bias are presented and evaluated. Recommendations for future research are also offered.",
      "openalex_id": "https://openalex.org/W2150238850",
      "domain": "Job Satisfaction and Organizational Behavior",
      "subdomain": "",
      "published_date": "1986-12-01",
      "citations": 16605,
      "mechanism_score": null
    },
    {
      "title": "Attachment and reflective function: Their role in self-organization",
      "abstract": "The paper traces the relationship between attachment processes and the development of the capacity to envision mental states in self and others. We suggest that the ability to mentalize, to represent behavior in terms of mental states, or to have “a theory of mind” is a key determinant of self-organization which is acquired in the context of the child's early social relationships. Evidence for an association between the quality of attachment relationship and reflective function in the parent and the child is reviewed and interpreted in the context of current models of theory of mind development. A model of the development of self-organization is proposed which has at its core the caregiver's ability to communicate understanding of the child's intentional stance. The implications of the model for pathological self-development are explored, with specific reference to the consequences of maltreatment.",
      "openalex_id": "https://openalex.org/W2121454967",
      "domain": "Child and Animal Learning Development",
      "subdomain": "",
      "published_date": "1997-12-01",
      "citations": 1628,
      "mechanism_score": null
    },
    {
      "title": "Self-Organization of CdSe Nanocrystallites into Three-Dimensional Quantum Dot Superlattices",
      "abstract": "The self-organization of CdSe nanocrystallites into three-dimensional semiconductor quantum dot superlattices (colloidal crystals) is demonstrated. The size and spacing of the dots within the superlattice are controlled with near atomic precision. This control is a result of synthetic advances that provide CdSe nanocrystallites that are monodisperse within the limit of atomic roughness. The methodology is not limited to semiconductor quantum dots but provides general procedures for the preparation and characterization of ordered structures of nanocrystallites from a variety of materials.",
      "openalex_id": "https://openalex.org/W2038237598",
      "domain": "Quantum Dots Synthesis And Properties",
      "subdomain": "",
      "published_date": "1995-11-24",
      "citations": 2198,
      "mechanism_score": null
    },
    {
      "title": "Phase Transitions and Critical Phenomena",
      "abstract": "The field of phase transitions and critical phenomena continues to be active in research, producing a steady stream of interesting and fruitful results. It has moved into a central place in condensed matter studies. Statistical physics, and more specifically, the theory of transitions between states of matter, more or less defines what we know about 'everyday' matter and its transformations. The major aim of this serial is to provide review articles that can serve as standard references for research workers in the field, and for graduate students and others wishing to obtain reliable information on important recent developments.",
      "openalex_id": "https://openalex.org/W1540380506",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "2016-04-19",
      "citations": 11076,
      "mechanism_score": null
    },
    {
      "title": "Ordering, metastability and phase transitions in two-dimensional systems",
      "abstract": "A new definition of order called topological order is proposed for two-dimensional systems in which no long-range order of the conventional type exists. The possibility of a phase transition characterized by a change in the response of the system to an external perturbation is discussed in the context of a mean field type of approximation. The critical behaviour found in this model displays very weak singularities. The application of these ideas to the xy model of magnetism, the solid-liquid transition, and the neutral superfluid are discussed. This type of phase transition cannot occur in a superconductor nor in a Heisenberg ferromagnet.",
      "openalex_id": "https://openalex.org/W2086860422",
      "domain": "Physics of Superconductivity and Magnetism",
      "subdomain": "",
      "published_date": "1973-04-12",
      "citations": 9267,
      "mechanism_score": null
    },
    {
      "title": "Novel Type of Phase Transition in a System of Self-Driven Particles",
      "abstract": "A simple model with a novel type of dynamics is introduced in order to investigate the emergence of self-ordered motion in systems of particles with biologically motivated interaction. In our model particles are driven with a constant absolute velocity and at each time step assume the average direction of motion of the particles in their neighborhood with some random perturbation ($\\eta$) added. We present numerical evidence that this model results in a kinetic phase transition from no transport (zero average velocity, $| {\\bf v}_a | =0$) to finite net transport through spontaneous symmetry breaking of the rotational symmetry. The transition is continuous since $| {\\bf v}_a |$ is found to scale as $(\\eta_c-\\eta)^\\beta$ with $\\beta\\simeq 0.45$.",
      "openalex_id": "https://openalex.org/W2015410655",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "1995-08-07",
      "citations": 7212,
      "mechanism_score": null
    },
    {
      "title": "Quantum Spin Hall Effect and Topological Phase Transition in HgTe Quantum Wells",
      "abstract": "We show that the quantum spin Hall (QSH) effect, a state of matter with topological properties distinct from those of conventional insulators, can be realized in mercury telluride–cadmium telluride semiconductor quantum wells. When the thickness of the quantum well is varied, the electronic state changes from a normal to an “inverted” type at a critical thickness d c . We show that this transition is a topological quantum phase transition between a conventional insulating phase and a phase exhibiting the QSH effect with a single pair of helical edge states. We also discuss methods for experimental detection of the QSH effect.",
      "openalex_id": "https://openalex.org/W2117734893",
      "domain": "Topological Materials and Phenomena",
      "subdomain": "",
      "published_date": "2006-12-14",
      "citations": 6888,
      "mechanism_score": null
    },
    {
      "title": "Quantum Phase Transitions",
      "abstract": "Quantum Phase Transitions is the first book to describe in detail the fundamental changes that can occur in the macroscopic nature of matter at zero temperature due to small variations in a given external parameter. The subject plays a central role in the study of the electrical and magnetic properties of numerous important solid state materials. The author begins by developing the theory of quantum phase transitions in the simplest possible class of non-disordered, interacting systems - the quantum Ising and rotor models. Particular attention is paid to their non-zero temperature dynamic and transport properties in the vicinity of the quantum critical point. Several other quantum phase transitions of increasing complexity are then discussed and clarified. Throughout, the author interweaves experimental results with presentation of theoretical models, and well over 500 references are included. The book will be of great interest to graduate students and researchers in condensed matter physics.",
      "openalex_id": "https://openalex.org/W4308326495",
      "domain": "Advanced Physical and Chemical Molecular Interactions",
      "subdomain": "",
      "published_date": "2000-01-13",
      "citations": 3388,
      "mechanism_score": null
    },
    {
      "title": "Quantum phase transition from a superfluid to a Mott insulator in a gas of ultracold atoms",
      "abstract": "For a system at a temperature of absolute zero, all thermal fluctuations are frozen out, while quantum fluctuations prevail. These microscopic quantum fluctuations can induce a macroscopic phase transition in the ground state of a many-body system when the relative strength of two competing energy terms is varied across a critical value. Here we observe such a quantum phase transition in a Bose-Einstein condensate with repulsive interactions, held in a three-dimensional optical lattice potential. As the potential depth of the lattice is increased, a transition is observed from a superfluid to a Mott insulator phase. In the superfluid phase, each atom is spread out over the entire lattice, with long-range phase coherence. But in the insulating phase, exact numbers of atoms are localized at individual lattice sites, with no phase coherence across the lattice; this phase is characterized by a gap in the excitation spectrum. We can induce reversible changes between the two ground states of the system.",
      "openalex_id": "https://openalex.org/W2007391198",
      "domain": "Cold Atom Physics and Bose-Einstein Condensates",
      "subdomain": "",
      "published_date": "2002-01-01",
      "citations": 5734,
      "mechanism_score": null
    },
    {
      "title": "Threshold Models of Collective Behavior",
      "abstract": "National audience",
      "openalex_id": "https://openalex.org/W2041157860",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1978-05-01",
      "citations": 5895,
      "mechanism_score": null
    },
    {
      "title": "Physics of microswimmers—single particle motion and collective behavior: a review",
      "abstract": "Locomotion and transport of microorganisms in fluids is an essential aspect of life. Search for food, orientation toward light, spreading of off-spring, and the formation of colonies are only possible due to locomotion. Swimming at the microscale occurs at low Reynolds numbers, where fluid friction and viscosity dominates over inertia. Here, evolution achieved propulsion mechanisms, which overcome and even exploit drag. Prominent propulsion mechanisms are rotating helical flagella, exploited by many bacteria, and snake-like or whip-like motion of eukaryotic flagella, utilized by sperm and algae. For artificial microswimmers, alternative concepts to convert chemical energy or heat into directed motion can be employed, which are potentially more efficient. The dynamics of microswimmers comprises many facets, which are all required to achieve locomotion. In this article, we review the physics of locomotion of biological and synthetic microswimmers, and the collective behavior of their assemblies. Starting from individual microswimmers, we describe the various propulsion mechanism of biological and synthetic systems and address the hydrodynamic aspects of swimming. This comprises synchronization and the concerted beating of flagella and cilia. In addition, the swimming behavior next to surfaces is examined. Finally, collective and cooperate phenomena of various types of isotropic and anisotropic swimmers with and without hydrodynamic interactions are discussed.",
      "openalex_id": "https://openalex.org/W1904457290",
      "domain": "Micro and Nano Robotics",
      "subdomain": "",
      "published_date": "2015-04-28",
      "citations": 1326,
      "mechanism_score": null
    },
    {
      "title": "Social Problems as Collective Behavior",
      "abstract": "Sociologists have erred in locating social problems in objective conditions. Instead, social problems have their being in a process of collective definition. This process determines whether social problems will arise, whether they become legitimated, how they are shaped in discussion, how they come to be addressed in official policy, and how they, are reconstituted in putting planned action into effect. Sociological theory and study must respect this process.",
      "openalex_id": "https://openalex.org/W2129695636",
      "domain": "Contemporary Sociological Theory and Practice",
      "subdomain": "",
      "published_date": "1971-01-01",
      "citations": 1057,
      "mechanism_score": null
    },
    {
      "title": "Interaction ruling animal collective behavior depends on topological rather than metric distance: Evidence from a field study",
      "abstract": "Numerical models indicate that collective animal behavior may emerge from simple local rules of interaction among the individuals. However, very little is known about the nature of such interaction, so that models and theories mostly rely on aprioristic assumptions. By reconstructing the three-dimensional positions of individual birds in airborne flocks of a few thousand members, we show that the interaction does not depend on the metric distance, as most current models and theories assume, but rather on the topological distance. In fact, we discovered that each bird interacts on average with a fixed number of neighbors (six to seven), rather than with all neighbors within a fixed metric distance. We argue that a topological interaction is indispensable to maintain a flock's cohesion against the large density changes caused by external perturbations, typically predation. We support this hypothesis by numerical simulations, showing that a topological interaction grants significantly higher cohesion of the aggregation compared with a standard metric one.",
      "openalex_id": "https://openalex.org/W2112164016",
      "domain": "Animal Behavior and Reproduction",
      "subdomain": "",
      "published_date": "2008-01-28",
      "citations": 1981,
      "mechanism_score": null
    },
    {
      "title": "Patterns and collective behavior in granular media: Theoretical concepts",
      "abstract": "Granular materials are ubiquitous in our daily lives. While they have been a\\nsubject of intensive engineering research for centuries, in the last decade\\ngranular matter attracted significant attention of physicists. Yet despite a\\nmajor efforts by many groups, the theoretical description of granular systems\\nremains largely a plethora of different, often contradicting concepts and\\napproaches. Authors give an overview of various theoretical models emerged in\\nthe physics of granular matter, with the focus on the onset of collective\\nbehavior and pattern formation. Their aim is two-fold: to identify general\\nprinciples common for granular systems and other complex non-equilibrium\\nsystems, and to elucidate important distinctions between collective behavior in\\ngranular and continuum pattern-forming systems.\\n",
      "openalex_id": "https://openalex.org/W2069457875",
      "domain": "Granular flow and fluidized beds",
      "subdomain": "",
      "published_date": "2006-06-01",
      "citations": 824,
      "mechanism_score": null
    },
    {
      "title": "Threshold models of diffusion and collective behavior",
      "abstract": "(1983). Threshold models of diffusion and collective behavior. The Journal of Mathematical Sociology: Vol. 9, No. 3, pp. 165-179.",
      "openalex_id": "https://openalex.org/W2032319881",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1983-11-01",
      "citations": 480,
      "mechanism_score": null
    },
    {
      "title": "Biochemical Adaptation: Mechanism and Process in Physiological Evolution",
      "abstract": "1. The Goals and Scope of This Volume 2. Cellular Metabolism, Regulation, and Homeostasis 3. Influence of Oxygen Availability 4. The Diving Response and Its Evolution 5. Human Hypoxia Tolerance 6. Water-Solute Adaptations: The Evolution and Regulation of the Internal Milieu 7. Temperature",
      "openalex_id": "https://openalex.org/W1604984248",
      "domain": "High Altitude and Hypoxia",
      "subdomain": "",
      "published_date": "1984-06-21",
      "citations": 1502,
      "mechanism_score": null
    },
    {
      "title": "Biochemical adaptation: Mechanism and process in physiological evolution",
      "abstract": "Biochemical Adaptation: Mechanism and Process in Physiological Evolution Hochachka, P. W., Somero, G. N.; Oxford University Press, 2002, 480 pp., ISBN 0-195-11702-6 (hardback), $80, ISBN 0-195-11703-4 (paperback), $40. This is an interesting book. Its aim is to provide an integrative review of knowledge in biochemistry from the viewpoint of the biologist interested in the synthetic analysis of the many data that have been found in biochemistry, particularly in the last two decades. The authors aim to integrate a wide range of information from fields such as metabolic regulation, genomics, or evolution. The major aim of the book is to find physiological implications from a wide set of data spread in the literature. The authors choose cellular metabolism, the influence of oxygen availability, the diving response, the tolerance to hypoxia, the evolution of the internal milieu, and the regulation of body temperature as the main parameters to study the integrative vision of biochemistry that is provided in this book. The main problem with this book, and with others of its kind, is that the reader needs to know the basic facts of biochemistry before attempting to study this volume. Indeed one has to know in some depth the basic facts of biochemistry and molecular biology, from metabolism to the regulation of gene expression, before studying the integrative approach offered by this book. Of course, it is impossible to offer both approaches in the same volume, i.e. the description of the main facts that constitute the large body of biochemistry and molecular biology today and also to offer the integrative vision that is offered in this book. Also, one might argue that some critically important physiological facts such as aging are not approached in this book. On the other hand, this volume offers a very unusual and very ingenious approach to the study of biochemistry. It will be useful for university students interested in biochemistry from many different approaches. Once the student has got a good hold on the basic facts of biochemistry from the analytical viewpoint, i.e. studying a classical biochemistry text book, then great pleasure can be derived from studying this book, which offers a radically new approach to biochemistry from the viewpoint of the adaptation of changes in conditions that spur the physiological evolution. Thus, I thoroughly recommend reading this book for those students of biochemistry interested not only in the usual analytical approach to problems but also in the more integrative physiological approach to the study of biochemistry.",
      "openalex_id": "https://openalex.org/W1994362240",
      "domain": "Genetics and Physical Performance",
      "subdomain": "",
      "published_date": "2002-05-01",
      "citations": 751,
      "mechanism_score": null
    },
    {
      "title": "Top management team turnover as an adaptation mechanism: The role of the environment",
      "abstract": "Abstract Based on an organizational adaptation framework, this study examines the influence of three environmental dimensions–munificence, stability, and complexity–on top management team turnover. In addition to investigating the direct influence of these environmental dimensions, indirect effects through firm performance and strategic change are also examined; the indirect effect of environmental complexity through demographic heterogeneity is also studied. Path analysis indicates that the direct effects of the three environmental dimensions predominate. Indirect effects were nonsignificant except for the effect of instability and munificence through strategic change. By expanding the team turnover context to include environmental and strategic dimensions, in addition to previously examined performance and heterogeneity factors, this study enhances our understanding of managerial turnover as a form of organizational adaptation.",
      "openalex_id": "https://openalex.org/W2023579566",
      "domain": "Innovation and Knowledge Management",
      "subdomain": "",
      "published_date": "1993-10-01",
      "citations": 429,
      "mechanism_score": null
    },
    {
      "title": "Salinity Stress Responses and Adaptation Mechanisms in Eukaryotic Green Microalgae",
      "abstract": "High salinity is a challenging environmental stress for organisms to overcome. Unicellular photosynthetic microalgae are especially vulnerable as they have to grapple not only with ionic imbalance and osmotic stress but also with the generated reactive oxygen species (ROS) interfering with photosynthesis. This review attempts to compare and contrast mechanisms that algae, particularly the eukaryotic Chlamydomonas microalgae, exhibit in order to immediately respond to harsh conditions caused by high salinity. The review also collates adaptation mechanisms of freshwater algae strains under persistent high salt conditions. Understanding both short-term and long-term algal responses to high salinity is integral to further fundamental research in algal biology and biotechnology.",
      "openalex_id": "https://openalex.org/W2994857466",
      "domain": "Algal biology and biofuel production",
      "subdomain": "",
      "published_date": "2019-12-17",
      "citations": 309,
      "mechanism_score": null
    },
    {
      "title": "Management of soil phosphorus and plant adaptation mechanisms to phosphorus stress for sustainable crop production: a review",
      "abstract": "Phosphorus is one of the seventeen essential nutrients required for plant growth.Despite its importance, it is limiting crop yield on more than 40% of the world's arable land.Moreover, global P reserves are being depleted at a higher rate and according to some estimates there will be no soil P reserve by the year 2050.This is a potential threat to sustainable crop production.Most of the P applied in the form of fertilizers may be adsorbed by the soil, and is not available for plants lacking specific adaptations.Available soil P and hence crop yield can, however, be increased through applying P containing fertilizers to feed the ever increasing world population.The P contained in crop residues if left in the field can be recycled by incorporating the residues into the soil whereas part of P in crop residues fed to livestock can be returned back to the soil in the form of manure and as bone meal.Additionally, plants have evolved a diverse array of strategies to obtain adequate P for their growth under P limiting conditions (a term called as P-efficiency mechanisms).Plant P-efficiency mechanisms include both improved uptake efficiency (the ability of a plant to take up more P under P limiting condition) and improved utilization efficiency (the ability of a plant to produce higher dry matter yield per unit P taken up).Uptake efficiency mechanisms include modification of root architecture, development of large root system, longer root hairs and thinner roots, exudation of low molecular weight organic acids, protons and enzymes such as phosphatases and phytases, association with mycorrhiza, production of cluster roots and expression of high affinity P transporters all of which contribute to increased P uptake efficiency of the plant.Other mechanisms include the use of alternative P-independent enzymes and glycolytic pathways, efficient cytoplasmic P homeostasis and higher ability to remobilize P from other plant parts all of which are part of enhanced P utilization efficiency.Traits related to the above morphological, physiological, biochemical and molecular adaptation mechanisms under P stress can be utilized in improving cultivated crops for P efficiency through breeding programs.",
      "openalex_id": "https://openalex.org/W2164252576",
      "domain": "Plant nutrient uptake and metabolism",
      "subdomain": "",
      "published_date": "2012-01-01",
      "citations": 382,
      "mechanism_score": null
    },
    {
      "title": "Adaptation Mechanisms of Small Ruminants to Environmental Heat Stress",
      "abstract": "Small ruminants are the critical source of livelihood for rural people to the development of sustainable and environmentally sound production systems. They provided a source of meat, milk, skin, and fiber. The several contributions of small ruminants to the economy of millions of rural people are however being challenged by extreme heat stress difficulties. Heat stress is one of the most detrimental factors contributing to reduced growth, production, reproduction performance, milk quantity and quality, as well as natural immunity, making animals more vulnerable to diseases and even death. However, small ruminants have successfully adapted to this extreme environment and possess some unique adaptive traits due to behavioral, morphological, physiological, and largely genetic bases. This review paper, therefore, aims to provide an integrative explanation of small ruminant adaptation to heat stress and address some responsible candidate genes in adapting to thermal-stressed environments.",
      "openalex_id": "https://openalex.org/W2916504332",
      "domain": "Effects of Environmental Stressors on Livestock",
      "subdomain": "",
      "published_date": "2019-02-28",
      "citations": 213,
      "mechanism_score": null
    },
    {
      "title": "Synchronization in chaotic systems",
      "abstract": "Certain subsystems of nonlinear, chaotic systems can be made to synchronize by linking them with common signals. The criterion for this is the sign of the sub-Lyapunov exponents. We apply these ideas to a real set of synchronizing chaotic circuits.",
      "openalex_id": "https://openalex.org/W1970442252",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "1990-02-19",
      "citations": 10465,
      "mechanism_score": null
    },
    {
      "title": "Synchronization",
      "abstract": "First recognized in 1665 by Christiaan Huygens, synchronization phenomena are abundant in science, nature, engineering and social life. Systems as diverse as clocks, singing crickets, cardiac pacemakers, firing neurons and applauding audiences exhibit a tendency to operate in synchrony. These phenomena are universal and can be understood within a common framework based on modern nonlinear dynamics. The first half of this book describes synchronization without formulae, and is based on qualitative intuitive ideas. The main effects are illustrated with experimental examples and figures, and the historical development is outlined. The remainder of the book presents the main effects of synchronization in a rigorous and systematic manner, describing classical results on synchronization of periodic oscillators, and recent developments in chaotic systems, large ensembles, and oscillatory media. This comprehensive book will be of interest to a broad audience, from graduate students to specialist researchers in physics, applied mathematics, engineering and natural sciences.",
      "openalex_id": "https://openalex.org/W950991549",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2001-10-18",
      "citations": 4477,
      "mechanism_score": null
    },
    {
      "title": "Synchronization a universal concept in nonlinear sciences",
      "abstract": "Preface 1. Introduction Part I. Synchronization Without Formulae: 2. Basic notions: the self-sustained oscillator and its phase 3. Synchronization of a periodic oscillator by external force 4. Synchronization of two and many oscillators 5. Synchronization of chaotic systems 6. Detecting synchronization in experiments Part II. Phase Locking and Frequency Entrainment: 7. Synchronization of periodic oscillators by periodic external action 8. Mutual synchronization of two interacting periodic oscillators 9. Synchronization in the presence of noise 10. Phase synchronization of chaotic systems 11. Synchronization in oscillatory media 12. Populations of globally coupled oscillators Part III. Synchronization of Chaotic Systems: 13. Complete synchronization I: basic concepts 14. Complete synchronization II: generalizations and complex systems 15. Synchronization of complex dynamics by external forces Appendix 1. Discovery of synchronization by Christiaan Huygens Appendix 2. Instantaneous phase and frequency of a signal References Index.",
      "openalex_id": "https://openalex.org/W1620414136",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2001-01-01",
      "citations": 5633,
      "mechanism_score": null
    },
    {
      "title": "Overview of Control and Grid Synchronization for Distributed Power Generation Systems",
      "abstract": "Renewable energy sources like wind, sun, and hydro are seen as a reliable alternative to the traditional energy sources such as oil, natural gas, or coal. Distributed power generation systems (DPGSs) based on renewable energy sources experience a large development worldwide, with Germany, Denmark, Japan, and USA as leaders in the development in this field. Due to the increasing number of DPGSs connected to the utility network, new and stricter standards in respect to power quality, safe running, and islanding protection are issued. As a consequence, the control of distributed generation systems should be improved to meet the requirements for grid interconnection. This paper gives an overview of the structures for the DPGS based on fuel cell, photovoltaic, and wind turbines. In addition, control structures of the grid-side converter are presented, and the possibility of compensation for low-order harmonics is also discussed. Moreover, control strategies when running on grid faults are treated. This paper ends up with an overview of synchronization methods and a discussion about their importance in the control",
      "openalex_id": "https://openalex.org/W2132755931",
      "domain": "Microgrid Control and Optimization",
      "subdomain": "",
      "published_date": "2006-10-01",
      "citations": 5073,
      "mechanism_score": null
    },
    {
      "title": "The Kuramoto model: A simple paradigm for synchronization phenomena",
      "abstract": "Synchronization phenomena in large populations of interacting elements are the subject of intense research efforts in physical, biological, chemical, and social systems. A successful approach to the problem of synchronization consists of modeling each member of the population as a phase oscillator. In this review, synchronization is analyzed in one of the most representative models of coupled phase oscillators, the Kuramoto model. A rigorous mathematical treatment, specific numerical methods, and many variations and extensions of the original model that have appeared in the last few years are presented. Relevant applications of the model in different contexts are also included.",
      "openalex_id": "https://openalex.org/W2168448159",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2005-04-07",
      "citations": 3383,
      "mechanism_score": null
    },
    {
      "title": "Robust frequency and timing synchronization for OFDM",
      "abstract": "A rapid synchronization method is presented for an orthogonal frequency-division multiplexing (OFDM) system using either a continuous transmission or a burst operation over a frequency-selective channel. The presence of a signal can be detected upon the receipt of just one training sequence of two symbols. The start of the frame and the beginning of the symbol can be found, and carrier frequency offsets of many subchannels spacings can be corrected. The algorithms operate near the Cramer-Rao lower bound for the variance of the frequency offset estimate, and the inherent averaging over many subcarriers allows acquisition at very low signal-to-noise ratios (SNRs).",
      "openalex_id": "https://openalex.org/W2110774823",
      "domain": "Advanced Wireless Communication Techniques",
      "subdomain": "",
      "published_date": "1997-01-01",
      "citations": 3364,
      "mechanism_score": null
    },
    {
      "title": "Exceeding 1.5°C global warming could trigger multiple climate tipping points",
      "abstract": "Climate tipping points occur when change in a part of the climate system becomes self-perpetuating beyond a warming threshold, leading to substantial Earth system impacts. Synthesizing paleoclimate, observational, and model-based studies, we provide a revised shortlist of global “core” tipping elements and regional “impact” tipping elements and their temperature thresholds. Current global warming of ~1.1°C above preindustrial temperatures already lies within the lower end of some tipping point uncertainty ranges. Several tipping points may be triggered in the Paris Agreement range of 1.5 to &lt;2°C global warming, with many more likely at the 2 to 3°C of warming expected on current policy trajectories. This strengthens the evidence base for urgent action to mitigate climate change and to develop improved tipping point risk assessment, early warning capability, and adaptation strategies.",
      "openalex_id": "https://openalex.org/W4295088938",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2022-09-08",
      "citations": 1673,
      "mechanism_score": null
    },
    {
      "title": "Experimental evidence for tipping points in social convention",
      "abstract": "Tipping points in social convention Once a population has converged on a consensus, how can a group with a minority viewpoint overturn it? Theoretical models have emphasized tipping points, whereby a sufficiently large minority can change the societal norm. Centola et al. devised a system to study this in controlled experiments. Groups of people who had achieved a consensus about the name of a person shown in a picture were individually exposed to a confederate who promoted a different name. The only incentive was to coordinate. When the number of confederates was roughly 25% of the group, the opinion of the majority could be tipped to that of the minority. Science , this issue p. 1116",
      "openalex_id": "https://openalex.org/W2805301067",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "2018-06-07",
      "citations": 643,
      "mechanism_score": null
    },
    {
      "title": "Evolutionary tipping points in the capacity to adapt to environmental change",
      "abstract": "Significance Environmental variation is becoming more frequent and unpredictable as a consequence of climate change, yet we currently lack the tools to evaluate the extent to which organisms may adapt to this phenomenon. Here we develop a model that explores these issues and use it to study how changes in the timescale and predictability of environmental variation may ultimately affect population viability. Our model indicates that, although populations can often cope with fairly large changes in these environmental parameters, on occasion they will collapse abruptly and go extinct. We characterize the conditions under which these evolutionary tipping points occur and discuss how vulnerability to such cryptic threats may depend on the genetic architecture and life history of the organisms involved.",
      "openalex_id": "https://openalex.org/W2107289345",
      "domain": "Evolution and Genetic Dynamics",
      "subdomain": "",
      "published_date": "2014-11-24",
      "citations": 490,
      "mechanism_score": null
    },
    {
      "title": "Tipping points in open systems: bifurcation, noise-induced and rate-dependent examples in the climate system",
      "abstract": "Abstract Tipping points associated with bifurcations (B-tipping) or induced by noise (N-tipping) are recognized mechanisms that may potentially lead to sudden climate change. We focus here on a novel class of tipping points, where a sufficiently rapid change to an input or parameter of a system may cause the system to ‘tip’ or move away from a branch of attractors. Such rate-dependent tipping, or R-tipping, need not be associated with either bifurcations or noise. We present an example of all three types of tipping in a simple global energy balance model of the climate system, illustrating the possibility of dangerous rates of change even in the absence of noise and of bifurcations in the underlying quasi-static system.",
      "openalex_id": "https://openalex.org/W2134761831",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2012-01-30",
      "citations": 650,
      "mechanism_score": null
    },
    {
      "title": "Environmental Tipping Points",
      "abstract": "Tipping points—where a small perturbation triggers a large response—can occur in many complex environmental systems. They produce abrupt and sometimes irreversible change, are inherently difficult to predict, and thus pose considerable challenges to the occupants and managers of those systems. However, tipping points can also represent opportunities. Here, different mathematical types of tipping points and different environmental processes that can give rise to them are distinguished. Then, I chart the crucial role that tipping points played in creating the modern Earth system. Looking ahead, potential large-scale tipping points are briefly reviewed before highlighting systems that could harbor tipping points across mechanisms and scales. The prospects for anticipating tipping points, avoiding dangerous ones, and encouraging others are outlined. Finally, a series of virtuous tipping points are identified, which can help transform the relationships between human societies and the environmental systems we depend upon.",
      "openalex_id": "https://openalex.org/W2101687942",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2013-08-12",
      "citations": 267,
      "mechanism_score": null
    },
    {
      "title": "Climate Tipping Points",
      "abstract": "This report reviews evidence that overshooting 1.5°C may push the earth over several tipping points, leading to irreversible and severe changes in the climate system. If triggered, tipping point impacts will rapidly cascade through socio-economic and ecological systems, leading to severe effects on human and natural systems and imposing important challenges for human adaptation. Of particular concern are the likely collapse of the West Antarctic and Greenland ice sheets and the abrupt melting of permafrost grounds in the Arctic, which would result in additional sea-level rise and greenhouse gas releases, leading to more warming. Based on the most recent science and consultations with renowned experts, Climate Tipping Points: Insights for Effective Policy Action argues that it is no longer appropriate to consider the risk of crossing tipping points as low-probability. Overshooting 1.5°C may likely lead to irreversible and severe impacts, which must be avoided, heightening the urgency to drastically reduce emissions within this decade. The report calls for a shift in how tipping points are treated in climate policy today and provides recommendations on how climate risk management strategies can better reflect the risks of tipping points in the areas of mitigation, adaptation and technological innovation.",
      "openalex_id": "https://openalex.org/W4310538351",
      "domain": "unknown",
      "subdomain": "",
      "published_date": "2022-12-02",
      "citations": 195,
      "mechanism_score": null
    },
    {
      "title": "Phase Transitions and Critical Phenomena",
      "abstract": "The field of phase transitions and critical phenomena continues to be active in research, producing a steady stream of interesting and fruitful results. It has moved into a central place in condensed matter studies. Statistical physics, and more specifically, the theory of transitions between states of matter, more or less defines what we know about 'everyday' matter and its transformations. The major aim of this serial is to provide review articles that can serve as standard references for research workers in the field, and for graduate students and others wishing to obtain reliable information on important recent developments.",
      "openalex_id": "https://openalex.org/W1540380506",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "2016-04-19",
      "citations": 11076,
      "mechanism_score": null
    },
    {
      "title": "Theory of dynamic critical phenomena",
      "abstract": "An introductory review of the central ideas in the modern theory of dynamic critical phenomena is followed by a more detailed account of recent developments in the field. The concepts of the conventional theory, mode-coupling, scaling, universality, and the renormalization group are introduced and are illustrated in the context of a simple example---the phase separation of a symmetric binary fluid. The renormalization group is then developed in some detail, and applied to a variety of systems. The main dynamic universality classes are identified and characterized. It is found that the mode-coupling and renormalization group theories successfully explain available experimental data at the critical point of pure fluids, and binary mixtures, and at many magnetic phase transitions, but that a number of discrepancies exist with data at the superfluid transition of $^{4}\\mathrm{He}$.",
      "openalex_id": "https://openalex.org/W2066359652",
      "domain": "Quantum, superfluid, helium dynamics",
      "subdomain": "",
      "published_date": "1977-07-01",
      "citations": 6690,
      "mechanism_score": null
    },
    {
      "title": "The renormalization group: Critical phenomena and the Kondo problem",
      "abstract": "This review covers several topics involving renormalization group ideas. The solution of the $s$-wave Kondo Hamiltonian, describing a single magnetic impurity in a nonmagnetic metal, is explained in detail. See Secs. VII-IX. \"Block spin\" methods, applied to the two dimensional Ising model, are explained in Sec. VI. The first three sections give a relatively short review of basic renormalization group ideas, mainly in the context of critical phenomena. The relationship of the modern renormalization group to the older problems of divergences in statistical mechanics and field theory and field theoretic renormalization is discussed in Sec. IV. In Sec. V the special case of \"marginal variables\" is discussed in detail, along with the relationship of the modern renormalization group to its original formulation by Gell-Mann and Low and others.",
      "openalex_id": "https://openalex.org/W2052810501",
      "domain": "Theoretical and Computational Physics",
      "subdomain": "",
      "published_date": "1975-10-01",
      "citations": 4397,
      "mechanism_score": null
    },
    {
      "title": "Introduction to Phase Transitions and Critical Phenomena",
      "abstract": "First Page",
      "openalex_id": "https://openalex.org/W2138256018",
      "domain": "nanoparticles nucleation surface interactions",
      "subdomain": "",
      "published_date": "1972-06-01",
      "citations": 4088,
      "mechanism_score": null
    },
    {
      "title": "<i>Introduction to Phase Transitions and Critical Phenomena</i>",
      "abstract": "This is a paperback edition of a distinguished book, originally published by Clarendon Press in 1971. It was then the first text on critical phenomena, a field that has enjoyed great activity for the past twenty years and that still continues to attract much attention. The book is at the level at which a graduate student who has studied condensed matter physics can begin to comprehend the nature of phase transitions, which involve the transformation of one state of matter into another. (A simple example is the melting of a solid to become a liquid.) Such a transformation is termed 'critical' when, after a certain amount of the substance changes phase, the entire bulk virtually instantaneously also makes the transition. A second, updated edition is planned for future publication, but in the mean time this paperback reissue will be useful in teaching the fundamental principles of this extremely interesting subject.",
      "openalex_id": "https://openalex.org/W3003303647",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "1973-01-01",
      "citations": 3653,
      "mechanism_score": null
    },
    {
      "title": "Quantum Field Theory and Critical Phenomena",
      "abstract": "Abstract Introduced as a quantum extension of Maxwell's classical theory, quantum electrodynamic (QED) has been the first example of a quantum field theory (QFT). Eventually, QFT has become the framework for the discussion of all fundamental interactions at the microscopic scale except, possibly, gravity. More surprisingly, it has also provided a framework for the understanding of second order phase transitions in statistical mechanics. In fact, as hopefully this work illustrates, QFT is the natural framework for the discussion of most systems involving an infinite number of degrees of freedom with local couplings. These systems range from cold Bose gases at the condensation temperature (about ten nanokelvin) to conventional phase transitions (from a few degrees to several hundred) and high energy particle physics up to a TeV, altogether more than twenty orders of magnitude in the energy scale. Therefore, although excellent textbooks about QFT had already been published, I thought, many years ago, that it might not be completely worthless to present a work in which the strong formal relations between particle physics and the theory of critical phenomena are systematically emphasized. This option explains some of the choices made in the presentation. A formulation in terms of field integrals has been adopted to study the properties of QFT. The language of partition and correlation functions has been used throughout, even in applications of QFT to particle physics. Renormalization and renormalization group (RG) properties are systematically discussed. The notion of effective field theory (EFT) and the emergence of renormalizable theories are described. The consequences for fine-tuning and triviality issue are emphasized. This fifth edition has been updated and fully revised.",
      "openalex_id": "https://openalex.org/W2039263963",
      "domain": "Computational Physics and Python Applications",
      "subdomain": "",
      "published_date": "2002-06-06",
      "citations": 2948,
      "mechanism_score": null
    },
    {
      "title": "Network information flow",
      "abstract": "We introduce a new class of problems called network information flow which is inspired by computer network applications. Consider a point-to-point communication network on which a number of information sources are to be multicast to certain sets of destinations. We assume that the information sources are mutually independent. The problem is to characterize the admissible coding rate region. This model subsumes all previously studied models along the same line. We study the problem with one information source, and we have obtained a simple characterization of the admissible coding rate region. Our result can be regarded as the max-flow min-cut theorem for network information flow. Contrary to one's intuition, our work reveals that it is in general not optimal to regard the information to be multicast as a \"fluid\" which can simply be routed or replicated. Rather, by employing coding at the nodes, which we refer to as network coding, bandwidth can in general be saved. This finding may have significant impact on future design of switching systems.",
      "openalex_id": "https://openalex.org/W2105831729",
      "domain": "Cooperative Communication and Network Coding",
      "subdomain": "",
      "published_date": "2000-07-01",
      "citations": 7799,
      "mechanism_score": null
    },
    {
      "title": "Information Flow and Cooperative Control of Vehicle Formations",
      "abstract": "We consider the problem of cooperation among a collection of vehicles performing a shared task using intervehicle communication to coordinate their actions. Tools from algebraic graph theory prove useful in modeling the communication network and relating its topology to formation stability. We prove a Nyquist criterion that uses the eigenvalues of the graph Laplacian matrix to determine the effect of the communication topology on formation stability. We also propose a method for decentralized information exchange between vehicles. This approach realizes a dynamical system that supplies each vehicle with a common reference to be used for cooperative motion. We prove a separation principle that decomposes formation stability into two components: Stability of this is achieved information flow for the given graph and stability of an individual vehicle for the given controller. The information flow can thus be rendered highly robust to changes in the graph, enabling tight formation control despite limitations in intervehicle communication capability.",
      "openalex_id": "https://openalex.org/W2146890818",
      "domain": "Distributed Control Multi-Agent Systems",
      "subdomain": "",
      "published_date": "2004-09-01",
      "citations": 4554,
      "mechanism_score": null
    },
    {
      "title": "An Information Flow Model for Conflict and Fission in Small Groups",
      "abstract": "The paper is devoted to game-theoretic methods for community detection in networks. The traditional methods for detecting community structure are based on selecting denser subgraphs inside the network. Here we propose to use the methods of cooperative game theory that highlight not only the link density but also the mechanisms of cluster formation. Specifically, we suggest two approaches from cooperative game theory: the first approach is based on the Myerson value, whereas the second approach is based on hedonic games. Both approaches allow to detect clusters with various resolution. However, the tuning of the resolution parameter in the hedonic games approach is particularly intuitive. Furthermore, the modularity based approach and its generalizations can be viewed as particular cases of the hedonic games.",
      "openalex_id": "https://openalex.org/W3101413764",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1977-12-01",
      "citations": 4648,
      "mechanism_score": null
    },
    {
      "title": "A lattice model of secure information flow",
      "abstract": "This paper investigates mechanisms that guarantee secure information flow in a computer system. These mechanisms are examined within a mathematical framework suitable for formulating the requirements of secure information flow among security classes. The central component of the model is a lattice structure derived from the security classes and justified by the semantics of information flow. The lattice properties permit concise formulations of the security requirements of different existing systems and facilitate the construction of mechanisms that enforce security. The model provides a unifying view of all systems that restrict information flow, enables a classification of them according to security objectives, and suggests some new approaches. It also leads to the construction of automatic program certification mechanisms for verifying the secure flow of information through a program.",
      "openalex_id": "https://openalex.org/W2094873755",
      "domain": "Security and Verification in Computing",
      "subdomain": "",
      "published_date": "1976-05-01",
      "citations": 1887,
      "mechanism_score": null
    },
    {
      "title": "Language-based information-flow security",
      "abstract": "Current standard security practices do not provide substantial assurance that the end-to-end behavior of a computing system satisfies important security policies such as confidentiality. An end-to-end confidentiality policy might assert that secret input data cannot be inferred by an attacker through the attacker's observations of system output; this policy regulates information flow. Conventional security mechanisms such as access control and encryption do not directly address the enforcement of information-flow policies. Previously, a promising new approach has been developed: the use of programming-language techniques for specifying and enforcing information-flow policies. In this paper, we survey the past three decades of research on information-flow security, particularly focusing on work that uses static program analysis to enforce information-flow policies. We give a structured view of work in the area and identify some important open challenges.",
      "openalex_id": "https://openalex.org/W2122049982",
      "domain": "Security and Verification in Computing",
      "subdomain": "",
      "published_date": "2003-01-01",
      "citations": 1883,
      "mechanism_score": null
    },
    {
      "title": "TaintDroid: an information-flow tracking system for realtime privacy monitoring on smartphones",
      "abstract": "Today's smartphone operating systems frequently fail to provide users with adequate control over and visibility into how third-party applications use their private data. We address these shortcomings with TaintDroid, an efficient, system-wide dynamic taint tracking and analysis system capable of simultaneously tracking multiple sources of sensitive data. TaintDroid provides realtime analysis by leveraging Android's virtualized execution environment. TaintDroid incurs only 14% performance overhead on a CPU-bound micro-benchmark and imposes negligible overhead on interactive third-party applications. Using TaintDroid to monitor the behavior of 30 popular third-party Android applications, we found 68 instances of potential misuse of users' private information across 20 applications. Monitoring sensitive data with TaintDroid provides informed use of third-party applications for phone users and valuable input for smartphone security service firms seeking to identify misbehaving applications.",
      "openalex_id": "https://openalex.org/W1963971515",
      "domain": "Advanced Malware Detection Techniques",
      "subdomain": "",
      "published_date": "2010-10-04",
      "citations": 2280,
      "mechanism_score": null
    },
    {
      "title": "Multifractal Cascade Dynamics and Turbulent Intermittency",
      "abstract": "Turbulent intermittency plays a fundamental role in fields ranging from combustion physics and chemical engineering to meteorology. There is a rather general agreement that multifractals are being very successful at quantifying this intermittency. However, we argue that cascade processes are the appropriate and necessary physical models to achieve dynamical modeling of turbulent intermittency. We first review some recent developments and point out new directions which overcome either completely or partially the limitations of current cascade models which are static, discrete in scale, acausal, purely phenomenological and lacking in universal features. We review the debate about universality classes for multifractal processes. Using both turbulent velocity and temperature data, we show that the latter are very well fitted by the (strong) universality, and that the recent (weak, log-Poisson) alternative is untenable for both strong and weak events. Using a continuous, space-time anisotropic framework, we then show how to produce a causal stochastic model of intermittent fields and use it to study the predictability of these fields. Finally, by returning to the origins of the turbulent \"shell models\" and restoring a large number of degrees of freedom (the Scaling Gyroscope Cascade, SGC models) we partially close the gap between the cascades and the dynamical Navier–Stokes equations. Furthermore, we point out that beyond a close agreement between universal parameters of the different modeling approaches and the empirical estimates in turbulence, there is a rather common structure involving both a \"renormalized viscosity\" and a \"renormalized forcing\". We conclude that this gives credence to the possibility of deriving analytical/renormalized models of intermittency built on this structure.",
      "openalex_id": "https://openalex.org/W2086893123",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1997-09-01",
      "citations": 279,
      "mechanism_score": null
    },
    {
      "title": "Cascading dynamics in modular networks",
      "abstract": "In this paper we study a simple cascading process in a structured heterogeneous population, namely, a network composed of two loosely coupled communities. We demonstrate that under certain conditions the cascading dynamics in such a network has a two-tiered structure that characterizes activity spreading at different rates in the communities. We study the dynamics of the model using both simulations and an analytical approach based on annealed approximation and obtain good agreement between the two. Our results suggest that network modularity might have implications in various applications, such as epidemiology and viral marketing.",
      "openalex_id": "https://openalex.org/W2063595837",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "2007-03-23",
      "citations": 105,
      "mechanism_score": null
    },
    {
      "title": "The Dynamics of Informational Cascades: The Monday Demonstrations in Leipzig, East Germany, 1989–91",
      "abstract": "This article analyzes the dynamics of turnout and the political impact of five cycles of protest, consisting of forty-two mass demonstrations that occurred on Mondays in Leipzig over the period 1989–91. These demonstrations are interpreted as an informational cascade that publicly revealed some of the previously hidden information about the malign nature of the East German communist regime. Once this information became publicly available, the viability of the regime was undermined. The Monday demonstrations subsequently died a slow death as their informational role declined.",
      "openalex_id": "https://openalex.org/W2047060383",
      "domain": "European history and politics",
      "subdomain": "",
      "published_date": "1994-10-01",
      "citations": 1034,
      "mechanism_score": null
    },
    {
      "title": "Cascade Dynamics Modeling with Attention-based Recurrent Neural Network",
      "abstract": "An ability of modeling and predicting the cascades of resharing is crucial to understanding information propagation and to launching campaign of viral marketing. Conventional methods for cascade prediction heavily depend on the hypothesis of diffusion models, e.g., independent cascade model and linear threshold model. Recently, researchers attempt to circumvent the problem of cascade prediction using sequential models (e.g., recurrent neural network, namely RNN) that do not require knowing the underlying diffusion model. Existing sequential models employ a chain structure to capture the memory effect. However, for cascade prediction, each cascade generally corresponds to a diffusion tree, causing cross-dependence in cascade---one sharing behavior could be triggered by its non-immediate predecessor in the memory chain. In this paper, we propose to an attention-based RNN to capture the cross-dependence in cascade. Furthermore, we introduce a \\emph{coverage} strategy to combat the misallocation of attention caused by the memoryless of traditional attention mechanism. Extensive experiments on both synthetic and real world datasets demonstrate the proposed models outperform state-of-the-art models at both cascade prediction and inferring diffusion tree.",
      "openalex_id": "https://openalex.org/W2740189214",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "2017-07-28",
      "citations": 108,
      "mechanism_score": null
    },
    {
      "title": "Emergence of cascading dynamics in interacting tipping elements of ecology and climate",
      "abstract": "In ecology, climate and other fields, (sub)systems have been identified that can transition into a qualitatively different state when a critical threshold or tipping point in a driving process is crossed. An understanding of those tipping elements is of great interest given the increasing influence of humans on the biophysical Earth system. Complex interactions exist between tipping elements, e.g. physical mechanisms connect subsystems of the climate system. Based on earlier work on such coupled nonlinear systems, we systematically assessed the qualitative long-term behaviour of interacting tipping elements. We developed an understanding of the consequences of interactions on the tipping behaviour allowing for tipping cascades to emerge under certain conditions. The (narrative) application of these qualitative results to real-world examples of interacting tipping elements indicates that tipping cascades with profound consequences may occur: the interacting Greenland ice sheet and thermohaline ocean circulation might tip before the tipping points of the isolated subsystems are crossed. The eutrophication of the first lake in a lake chain might propagate through the following lakes without a crossing of their individual critical nutrient input levels. The possibility of emerging cascading tipping dynamics calls for the development of a unified theory of interacting tipping elements and the quantitative analysis of interacting real-world tipping elements.",
      "openalex_id": "https://openalex.org/W3037839325",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2020-06-01",
      "citations": 92,
      "mechanism_score": null
    },
    {
      "title": "Displacement Cascades. Dynamics and Atomic Structure",
      "abstract": "Abstract The seminal ideas of Seeger, in 1958 and 1962, on the nature of a displacement cascade (DC) in irradiated crystalline materials have played an important role in the field of radiation damage. This paper first reviews the early history of displacement spikes, replacement collision sequences (RCSs), “diluted” or depleted zones and thermal spikes. Then the use is discussed of molecular dynamics (MD) simulations and field‐ion microscopy as techniques by which one can study the dynamics of the formation of DCs and the spatial array of point defects — on an atomic scale — associated with quiescent DCs, respectively. These techniques demonstrate quantitatively that a DC consists of a vacancy‐rich core surrounded by a distribution of self‐interstitial atoms (SIAs) — the latter are predominately created by RCSs. Recent results on the application of MD to the behavior of 5 keV cascades in copper are presented. Some of the results of the application of field‐ion microscopy to the study of DCs in tungsten are reviewed, and compared with the MD results.",
      "openalex_id": "https://openalex.org/W2035976038",
      "domain": "Ion-surface interactions and analysis",
      "subdomain": "",
      "published_date": "1987-11-01",
      "citations": 57,
      "mechanism_score": null
    },
    {
      "title": "Educational Organizations as Loosely Coupled Systems",
      "abstract": "Karl E. Weick In contrast to the prevailing image that elements in organizations are coupled through dense, tight linkages, it is proposed that elements are often tied together frequently and loosely. Using educational organizations as a case in point, it is argued that the concept of loose coupling incorporates a surprising number of disparate observations about organizations, suggests novel functions, creates stubborn problems for methodologists, and generates intriguing questions for scholars. Sample studies of loose coupling are suggested and research priorities are posed to foster cumulative work with this concept.1",
      "openalex_id": "https://openalex.org/W1996216743",
      "domain": "Management and Organizational Studies",
      "subdomain": "",
      "published_date": "1976-03-01",
      "citations": 7221,
      "mechanism_score": null
    },
    {
      "title": "Master Stability Functions for Synchronized Coupled Systems",
      "abstract": "We show that many coupled oscillator array configurations considered in the literature can be put into a simple form so that determining the stability of the synchronous state can be done by a master stability function, which can be tailored to one's choice of stability requirement. This solves, once and for all, the problem of synchronous stability for any linear coupling of that oscillator.",
      "openalex_id": "https://openalex.org/W2083787309",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "1998-03-09",
      "citations": 2552,
      "mechanism_score": null
    },
    {
      "title": "Loosely Coupled Systems: A Reconceptualization",
      "abstract": "Diverse applications of the concept of loose coupling are embodied in five recurring voices that focus separately on causation, typology, effects, compensations, and outcomes. Each has a tendency to drift away from a dialectical interpretation of loose coupling toward a unidimensional interpretation of loose coupling, thereby weakening the explanatory value of the concept. The authors first use the five voices to review the loose coupling literature and then to suggest more precise and more productive uses of the concept.",
      "openalex_id": "https://openalex.org/W2074684234",
      "domain": "Social Policy and Reform Studies",
      "subdomain": "",
      "published_date": "1990-04-01",
      "citations": 1944,
      "mechanism_score": null
    },
    {
      "title": "The construction industry as a loosely coupled system: implications for productivity and innovation",
      "abstract": "Previous research suggests that the construction industry is characterized by (1) particular complexity factors owing to industry specific uncertainties and interdependences, and (2) inefficiency of operations. The aim of this study was to analyse the operations and behaviour of firms as a means of dealing with complexity. The observations made indicate that the industry as a whole is featured as a loosely coupled system. Taking this as a starting point, the couplings among activities, resources and actors were analysed in different dimensions. The pattern of couplings builds on two interdependent layers: tight couplings in individual projects and loose couplings based on collective adaptations in the permanent network. It is concluded that the pattern of couplings seems to favour short term productivity while hampering innovation and learning.",
      "openalex_id": "https://openalex.org/W2162531320",
      "domain": "Construction Project Management and Performance",
      "subdomain": "",
      "published_date": "2002-10-01",
      "citations": 1006,
      "mechanism_score": null
    },
    {
      "title": "Propagation and Its Failure in Coupled Systems of Discrete Excitable Cells",
      "abstract": "We study propagation and its failure in systems of discrete coupled excitable cells. It is shown that propagation fails when coupling is weak, but succeeds if coupling is strong enough. We use a theorem of Moser on maps of the plane to establish the existence of an infinite variety of stable standing solutions when coupling is small. We use upper and lower solution techniques and perturbation analysis to show that propagation is successful when the coupling strength is large enough. These results are applied to the cubic FitzHugh–Nagumo dynamics as well as to the more realistic Beeler–Reuter model of action potentials in myocardial cells.",
      "openalex_id": "https://openalex.org/W1993693726",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "1987-06-01",
      "citations": 606,
      "mechanism_score": null
    },
    {
      "title": "Complexity of Coupled Human and Natural Systems",
      "abstract": "Integrated studies of coupled human and natural systems reveal new and complex patterns and processes not evident when studied by social or natural scientists separately. Synthesis of six case studies from around the world shows that couplings between human and natural systems vary across space, time, and organizational units. They also exhibit nonlinear dynamics with thresholds, reciprocal feedback loops, time lags, resilience, heterogeneity, and surprises. Furthermore, past couplings have legacy effects on present conditions and future possibilities.",
      "openalex_id": "https://openalex.org/W2010365184",
      "domain": "Complex Systems and Decision Making",
      "subdomain": "",
      "published_date": "2007-09-13",
      "citations": 3461,
      "mechanism_score": null
    },
    {
      "title": "Nonlinear Dynamics and Chaos: With Applications to Physics, Biology, Chemistry, and Engineering",
      "abstract": "First Page",
      "openalex_id": "https://openalex.org/W2605543710",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "1994-09-01",
      "citations": 4699,
      "mechanism_score": null
    },
    {
      "title": "Nonlinear Dynamics and Chaos",
      "abstract": "Preface. Preface to the First Edition. Acknowledgements from the First Edition. Introduction PART I: BASIC CONCEPTS OF NONLINEAR DYNAMICS An overview of nonlinear phenomena Point attractors in autonomous systems Limit cycles in autonomous systems Periodic attractors in driven oscillators Chaotic attractors in forced oscillators Stability and bifurcations of equilibria and cycles PART II ITERATED MAPS AS DYNAMICAL SYSTEMS Stability and bifurcation of maps Chaotic behaviour of one--and two--dimensional maps PART III FLOWS, OUTSTRUCTURES AND CHAOS The Geometry of Recurrence The Lorenz system Rosslers band Geometry of bifurcations PART IV APPLICATIONS IN THE PHYSICAL SCIENCES Subharmonic resonances of an offshore structure Chaotic motions of an impacting system Escape from a potential well Appendix. Illustrated Glossary. Bibliography. Online Resource. Index.",
      "openalex_id": "https://openalex.org/W2027674062",
      "domain": "Aquatic and Environmental Studies",
      "subdomain": "",
      "published_date": "1992-03-01",
      "citations": 1561,
      "mechanism_score": null
    },
    {
      "title": "Chaos and Nonlinear Dynamics",
      "abstract": "Abstract This book introduces the full range of activity in the rapidly growing field of nonlinear dynamics. Using a step-by-step introduction to dynamics and geometry in state space as the central focus of understanding nonlinear dynamics, this book includes a thorough treatment of both differential equation models and iterated map models (including a detailed derivation of the famous Feigenbaum numbers). It includes the increasingly important field of pattern formation and a survey of the controversial question of quantum chaos. Important tools such as Lyapunov exponents, fractal dimensions, and correlation dimensions are treated in detail. Several appendices provide a detailed derivation of the Lorenz model from the Navier-Stokes equation, a summary of bifurcation theory, and some simple computer programs to study nonlinear dynamics. Each chapter includes an extensive, annotated bibliography.",
      "openalex_id": "https://openalex.org/W2489691424",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "2000-09-14",
      "citations": 1359,
      "mechanism_score": null
    },
    {
      "title": "<i>Nonlinear Dynamics and Chaos: With Applications to Physics, Biology, Chemistry and Engineering</i>",
      "abstract": "Preface 1. Overview 1.0 Chaos, Fractals, and Dynamics 1.1 Capsule History of Dynamics 1.2 The Importance of Being Nonlinear 1.3 A Dynamical View of the World PART I. ONE-DIMENSIONAL FLOWS 2. Flows on the Line 2.0 Introduction 2.1 A Geometric Way of Thinking 2.2 Fixed Points and Stability 2.3 Population Growth 2.4 Linear Stability Analysis 2.5 Existence and Uniqueness 2.6 Impossibility of Oscillations 2.7 Potentials 2.8 Solving Equations on the Computer Exercises 3. Bifurcations 3.0 Introduction 3.1 Saddle-Node Bifurcation 3.2 Transcritical Bifurcation 3.3 Laser Threshold 3.4 Pitchfork Bifurcation 3.5 Overdamped Bead on a Rotating Hoop 3.6 Imperfect Bifurcations and Catastrophes 3.7 Insect Outbreak Exercises 4. Flows on the Circle 4.0 Introduction 4.1 Examples and Definitions 4.2 Uniform Oscillator 4.3 Nonuniform Oscillator 4.4 Overdamped Pendulum 4.5 Fireflies 4.6 Superconducting Josephson Junctions Exercises PART II. TWO-DIMENSIONAL FLOWS 5. Linear Systems 5.0 Introduction 5.1 Definitions and Examples 5.2 Classification of Linear Systems 5.3 Love Affairs Exercises 6. Phase Plane 6.0 Introduction 6.1 Phase Portraits 6.2 Existence, Uniqueness, and Topological Consequences 6.3 Fixed Points and Linearization 6.4 Rabbits versus Sheep 6.5 Conservative Systems 6.6 Reversible Systems 6.7 Pendulum 6.8 Index Theory Exercises 7. Limit Cycles 7.0 Introduction 7.1 Examples 7.2 Ruling Out Closed Orbits 7.3 Poincare-Bendixson Theorem 7.4 Lienard Systems 7.5 Relaxation Oscillators 7.6 Weakly Nonlinear Oscillators Exercises 8. Bifurcations Revisited 8.0 Introduction 8.1 Saddle-Node, Transcritical, and Pitchfork Bifurcations 8.2 Hopf Bifurcations 8.3 Oscillating Chemical Reactions 8.4 Global Bifurcations of Cycles 8.5 Hysteresis in the Driven Pendulum and Josephson Junction 8.6 Coupled Oscillators and Quasiperiodicity 8.7 Poincare Maps Exercises PART III. CHAOS 9. Lorenz Equations 9.0 Introduction 9.1 A Chaotic Waterwheel 9.2 Simple Properties of the Lorenz Equations 9.3 Chaos on a Strange Attractor 9.4 Lorenz Map 9.5 Exploring Parameter Space 9.6 Using Chaos to Send Secret Messages Exercises 10. One-Dimensional Maps 10.0 Introduction 10.1 Fixed Points and Cobwebs 10.2 Logistic Map: Numerics 10.3 Logistic Map: Analysis 10.4 Periodic Windows 10.5 Liapunov Exponent 10.6 Universality and Experiments 10.7 Renormalization Exercises 11. Fractals 11.0 Introduction 11.1 Countable and Uncountable Sets 11.2 Cantor Set 11.3 Dimension of Self-Similar Fractals 11.4 Box Dimension 11.5 Pointwise and Correlation Dimensions Exercises 12. Strange Attractors 12.0 Introductions 12.1 The Simplest Examples 12.2 Henon Map 12.3 Rossler System 12.4 Chemical Chaos and Attractor Reconstruction 12.5 Forced Double-Well Oscillator Exercises Answers to Selected Exercises References Author Index Subject Index",
      "openalex_id": "https://openalex.org/W2029030701",
      "domain": "Experimental and Theoretical Physics Studies",
      "subdomain": "",
      "published_date": "1995-03-01",
      "citations": 2652,
      "mechanism_score": null
    },
    {
      "title": "Nonlinear dynamics and breakup of free-surface flows",
      "abstract": "Surface-tension-driven flows and, in particular, their tendency to decay spontaneously into drops have long fascinated naturalists, the earliest systematic experiments dating back to the beginning of the 19th century. Linear stability theory governs the onset of breakup and was developed by Rayleigh, Plateau, and Maxwell. However, only recently has attention turned to the nonlinear behavior in the vicinity of the singular point where a drop separates. The increased attention is due to a number of recent and increasingly refined experiments, as well as to a host of technological applications, ranging from printing to mixing and fiber spinning. The description of drop separation becomes possible because jet motion turns out to be effectively governed by one-dimensional equations, which still contain most of the richness of the original dynamics. In addition, an attraction for physicists lies in the fact that the separation singularity is governed by universal scaling laws, which constitute an asymptotic solution of the Navier-Stokes equation before and after breakup. The Navier-Stokes equation is thus continued uniquely through the singularity. At high viscosities, a series of noise-driven instabilities has been observed, which are a nested superposition of singularities of the same universal form. At low viscosities, there is rich scaling behavior in addition to aesthetically pleasing breakup patterns driven by capillary waves. The author reviews the theoretical development of this field alongside recent experimental work, and outlines unsolved problems.",
      "openalex_id": "https://openalex.org/W2126488447",
      "domain": "Fluid Dynamics and Heat Transfer",
      "subdomain": "",
      "published_date": "1997-07-01",
      "citations": 1752,
      "mechanism_score": null
    },
    {
      "title": "Chaos and Nonlinear Dynamics: Application to Financial Markets",
      "abstract": "ABSTRACT After the stock market crash of October 19, 1987, interest in nonlinear dynamics, especially deterministic chaotic dynamics, has increased in both the financial press and the academic literature. This has come about because the frequency of large moves in stock markets is greater than would be expected under a normal distribution. There are a number of possible explanations. A popular one is that the stock market is governed by chaotic dynamics. What exactly is chaos and how is it related to nonlinear dynamics? How does one detect chaos? Is there chaos in financial markets? Are there other explanations of the movements of financial prices other than chaos? The purpose of this paper is to explore these issues.",
      "openalex_id": "https://openalex.org/W2160607725",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1991-12-01",
      "citations": 962,
      "mechanism_score": null
    },
    {
      "title": "A Complexity Measure",
      "abstract": "This paper describes a graph-theoretic complexity measure and illustrates how it can be used to manage and control program complexity. The paper first explains how the graph-theory concepts apply and gives an intuitive explanation of the graph concepts in programming terms. The control graphs of several actual Fortran programs are then presented to illustrate the correlation between intuitive complexity and the graph-theoretic complexity. Several properties of the graph-theoretic complexity are then proved which show, for example, that complexity is independent of physical size (adding or subtracting functional statements leaves complexity unchanged) and complexity depends only on the decision structure of a program.",
      "openalex_id": "https://openalex.org/W1964962870",
      "domain": "Logic, programming, and type systems",
      "subdomain": "",
      "published_date": "1976-12-01",
      "citations": 5740,
      "mechanism_score": null
    },
    {
      "title": "The complexity of theorem-proving procedures",
      "abstract": "It is shown that any recognition problem solved by a polynomial time-bounded nondeterministic Turing machine can be “reduced” to the problem of determining whether a given propositional formula is a tautology. Here “reduced” means, roughly speaking, that the first problem can be solved deterministically in polynomial time provided an oracle is available for solving the second. From this notion of reducible, polynomial degrees of difficulty are defined, and it is shown that the problem of determining tautologyhood has the same polynomial degree as the problem of determining whether the first of two given graphs is isomorphic to a subgraph of the second. Other examples are discussed. A method of measuring the complexity of proof procedures for the predicate calculus is introduced and discussed.",
      "openalex_id": "https://openalex.org/W2036265926",
      "domain": "Computability, Logic, AI Algorithms",
      "subdomain": "",
      "published_date": "1971-01-01",
      "citations": 6116,
      "mechanism_score": null
    },
    {
      "title": "Approximate entropy as a measure of system complexity.",
      "abstract": "Techniques to determine changing system complexity from data are evaluated. Convergence of a frequently used correlation dimension algorithm to a finite value does not necessarily imply an underlying deterministic model or chaos. Analysis of a recently developed family of formulas and statistics, approximate entropy (ApEn), suggests that ApEn can classify complex systems, given at least 1000 data values in diverse settings that include both deterministic chaotic and stochastic processes. The capability to discern changing complexity from such a relatively small amount of data holds promise for applications of ApEn in a variety of contexts.",
      "openalex_id": "https://openalex.org/W2077204677",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1991-03-15",
      "citations": 5657,
      "mechanism_score": null
    },
    {
      "title": "MUSCLE: a multiple sequence alignment method with reduced time and space complexity",
      "abstract": "Abstract Background In a previous paper, we introduced MUSCLE, a new program for creating multiple alignments of protein sequences, giving a brief summary of the algorithm and showing MUSCLE to achieve the highest scores reported to date on four alignment accuracy benchmarks. Here we present a more complete discussion of the algorithm, describing several previously unpublished techniques that improve biological accuracy and / or computational complexity. We introduce a new option, MUSCLE-fast, designed for high-throughput applications. We also describe a new protocol for evaluating objective functions that align two profiles. Results We compare the speed and accuracy of MUSCLE with CLUSTALW, Progressive POA and the MAFFT script FFTNS1, the fastest previously published program known to the author. Accuracy is measured using four benchmarks: BAliBASE, PREFAB, SABmark and SMART. We test three variants that offer highest accuracy (MUSCLE with default settings), highest speed (MUSCLE-fast), and a carefully chosen compromise between the two (MUSCLE-prog). We find MUSCLE-fast to be the fastest algorithm on all test sets, achieving average alignment accuracy similar to CLUSTALW in times that are typically two to three orders of magnitude less. MUSCLE-fast is able to align 1,000 sequences of average length 282 in 21 seconds on a current desktop computer. Conclusions MUSCLE offers a range of options that provide improved speed and / or alignment accuracy compared with currently available programs. MUSCLE is freely available at http://www.drive5.com/muscle .",
      "openalex_id": "https://openalex.org/W1519266993",
      "domain": "Genomics and Phylogenetic Studies",
      "subdomain": "",
      "published_date": "2004-08-19",
      "citations": 9089,
      "mechanism_score": null
    },
    {
      "title": "Combinatorial Optimization: Algorithms and Complexity.",
      "abstract": "This clearly written , mathematically rigorous text includes a novel algorithmic exposition of the simplex method and also discusses the Soviet ellipsoid algorithm for linear programming; efficient algorithms for network flow, matching, spanning trees, and matroids; the theory of NP-complete problems; approximation algorithms, local search heuristics for NPcomplete problems, more. All chapters are supplemented by thoughtprovoking problems. A useful work for graduate-level students with backgrounds in computer science, operations research, and electrical engineering. Mathematicians wishing a self-contained introduction need look no further.—American Mathematical Monthly. 1982 ed.",
      "openalex_id": "https://openalex.org/W2053913299",
      "domain": "unknown",
      "subdomain": "",
      "published_date": "1984-03-01",
      "citations": 6028,
      "mechanism_score": null
    },
    {
      "title": "Food Web Complexity and Species Diversity",
      "abstract": "It is suggested that local animal species diversity is related to the number of predators in the system and their efficiency in preventing single species from monopolizing some important, limiting, requisite. In the marine rocky intertidal this requisite usually is space. Where predators capable of preventing monopolies are missing, or are experimentally removed, the systems become less diverse. On a local scale, no relationship between latitude (10⚬ to 49⚬ N.) and diversity was found. On a geographic scale, an increased stability of annual production may lead to an increased capacity for systems to support higher-level carnivores. Hence tropical, or other, ecosystems are more diverse, and are characterized by disproportionately more carnivores.",
      "openalex_id": "https://openalex.org/W2054637019",
      "domain": "Isotope Analysis in Ecology",
      "subdomain": "",
      "published_date": "1966-01-01",
      "citations": 5304,
      "mechanism_score": null
    }
  ],
  "scored_papers": [
    {
      "title": "NEURAL NETWORK DYNAMICS",
      "abstract": "Neural network modeling is often concerned with stimulus-driven responses, but most of the activity in the brain is internally generated. Here, we review network models of internally generated activity, focusing on three types of network dynamics: (a) sustained responses to transient stimuli, which provide a model of working memory; (b) oscillatory network activity; and (c) chaotic activity, which models complex patterns of background spiking in cortical and other circuits. We also review propagation of stimulus-driven activity through spontaneously active networks. Exploring these aspects of neural network dynamics is critical for understanding how neural circuits produce cognitive function.",
      "openalex_id": "https://openalex.org/W2123745704",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2005-03-22",
      "citations": 503,
      "mechanism_score": 10
    },
    {
      "title": "Emergent behavior in active colloids",
      "abstract": "Active colloids are microscopic particles, which self-propel through viscous\\nfluids by converting energy extracted from their environment into directed\\nmotion. We first explain how articial microswimmers move forward by generating\\nnear-surface flow fields via self-phoresis or the self-induced Marangoni\\neffect. We then discuss generic features of the dynamics of single active\\ncolloids in bulk and in confinement, as well as in the presence of gravity,\\nfield gradients, and fluid flow. In the third part, we review the emergent\\ncollective behavior of active colloidal suspensions focussing on their\\nstructural and dynamic properties. After summarizing experimental observations,\\nwe give an overview on the progress in modeling collectively moving active\\ncolloids. While active Brownian particles are heavily used to study collective\\ndynamics on large scales, more advanced methods are necessary to explore the\\nimportance of hydrodynamic and phoretic particle interactions. Finally, the\\nrelevant physical approaches to quantify the emergent collective behavior are\\npresented.\\n",
      "openalex_id": "https://openalex.org/W2254944678",
      "domain": "Micro and Nano Robotics",
      "subdomain": "",
      "published_date": "2016-05-11",
      "citations": 396,
      "mechanism_score": 10
    },
    {
      "title": "A Robot that Walks; Emergent Behaviors from a Carefully Evolved Network",
      "abstract": "Most animals have significant behavioral expertise built in without having to explicitly learn it all from scratch. This expertise is a product of evolution of the organism; it can be viewed as a very long-term form of learning which provides a structured system within which individuals might learn more specialized skills or abilities. This paper suggests one possible mechanism for analagous robot evolution by describing a carefully designed series of networks, each one being a strict augmentation of the previous one, which control a six-legged walking machine capable of walking over rough terrain and following a person passively sensed in the infrared spectrum. As the completely decentralized networks are augmented, the robot's performance and behavior repertoire demonstrably improve. The rationale for such demonstrations is that they may provide a hint as to the requirements for automatically building massive networks to carry out complex sensory-motor tasks. The experiments with an actual robot ensure that an essence of reality is maintained and that no critical disabling problems have been ignored.",
      "openalex_id": "https://openalex.org/W2624516165",
      "domain": "Modular Robots and Swarm Intelligence",
      "subdomain": "",
      "published_date": "1989-06-01",
      "citations": 546,
      "mechanism_score": 10
    },
    {
      "title": "A robot that walks; emergent behaviors from a carefully evolved network",
      "abstract": "The author describes a carefully designed series of networks, each one being a strict augmentation of the previous one, which control a six-legged walking machine capable of walking over rough terrain and following a person passively sensed in the infrared spectrum. As the completely decentralized networks are augmented, the robot's performance and behavior repertoire demonstrably improve. The rationale for such demonstrations is that they can help identify requirements for automatically building massive networks to carry out complex sensory-motor tasks. The experiments with an actual robot ensure that an essence reality is maintained and that no critical disabling problems have been ignored. The present work is based on the drawing of analogies between evolution in the animal world and robotic evaluation.< <ETX xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">&gt;</ETX>",
      "openalex_id": "https://openalex.org/W1640247718",
      "domain": "Robotic Locomotion and Control",
      "subdomain": "",
      "published_date": "2003-01-07",
      "citations": 213,
      "mechanism_score": 10
    },
    {
      "title": "Self-Organization in Biological Systems",
      "abstract": "The synchronized flashing of fireflies at night. The spiraling patterns of an aggregating slime mold. The anastomosing network of army-ant trails. The coordinated movements of a school of fish. Researchers are finding in such patterns--phenomena that have fascinated naturalists for centuries--a fertile new approach to understanding biological systems: the study of self-organization. This book, a primer on self-organization in biological systems for students and other enthusiasts, introduces readers to the basic concepts and tools for studying self-organization and then examines numerous examples of self-organization in the natural world. Self-organization refers to diverse pattern formation processes in the physical and biological world, from sand grains assembling into rippled dunes to cells combining to create highly structured tissues to individual insects working to create sophisticated societies. What these diverse systems hold in common is the proximate means by which they acquire order and structure. In self-organizing systems, pattern at the global level emerges solely from interactions among lower-level components. Remarkably, even very complex structures result from the iteration of surprisingly simple behaviors performed by individuals relying on only local information. This striking conclusion suggests important lines of inquiry: To what degree is environmental rather than individual complexity responsible for group complexity? To what extent have widely differing organisms adopted similar, convergent strategies of pattern formation? How, specifically, has natural selection determined the rules governing interactions within biological systems? Broad in scope, thorough yet accessible, this book is a self-contained introduction to self-organization and complexity in biology--a field of study at the forefront of life sciences research",
      "openalex_id": "https://openalex.org/W1629051378",
      "domain": "Genetics, Bioinformatics, and Biomedical Research",
      "subdomain": "",
      "published_date": "2001-12-31",
      "citations": 2912,
      "mechanism_score": 10
    },
    {
      "title": "Physics of microswimmers—single particle motion and collective behavior: a review",
      "abstract": "Locomotion and transport of microorganisms in fluids is an essential aspect of life. Search for food, orientation toward light, spreading of off-spring, and the formation of colonies are only possible due to locomotion. Swimming at the microscale occurs at low Reynolds numbers, where fluid friction and viscosity dominates over inertia. Here, evolution achieved propulsion mechanisms, which overcome and even exploit drag. Prominent propulsion mechanisms are rotating helical flagella, exploited by many bacteria, and snake-like or whip-like motion of eukaryotic flagella, utilized by sperm and algae. For artificial microswimmers, alternative concepts to convert chemical energy or heat into directed motion can be employed, which are potentially more efficient. The dynamics of microswimmers comprises many facets, which are all required to achieve locomotion. In this article, we review the physics of locomotion of biological and synthetic microswimmers, and the collective behavior of their assemblies. Starting from individual microswimmers, we describe the various propulsion mechanism of biological and synthetic systems and address the hydrodynamic aspects of swimming. This comprises synchronization and the concerted beating of flagella and cilia. In addition, the swimming behavior next to surfaces is examined. Finally, collective and cooperate phenomena of various types of isotropic and anisotropic swimmers with and without hydrodynamic interactions are discussed.",
      "openalex_id": "https://openalex.org/W1904457290",
      "domain": "Micro and Nano Robotics",
      "subdomain": "",
      "published_date": "2015-04-28",
      "citations": 1326,
      "mechanism_score": 10
    },
    {
      "title": "Synchronization",
      "abstract": "First recognized in 1665 by Christiaan Huygens, synchronization phenomena are abundant in science, nature, engineering and social life. Systems as diverse as clocks, singing crickets, cardiac pacemakers, firing neurons and applauding audiences exhibit a tendency to operate in synchrony. These phenomena are universal and can be understood within a common framework based on modern nonlinear dynamics. The first half of this book describes synchronization without formulae, and is based on qualitative intuitive ideas. The main effects are illustrated with experimental examples and figures, and the historical development is outlined. The remainder of the book presents the main effects of synchronization in a rigorous and systematic manner, describing classical results on synchronization of periodic oscillators, and recent developments in chaotic systems, large ensembles, and oscillatory media. This comprehensive book will be of interest to a broad audience, from graduate students to specialist researchers in physics, applied mathematics, engineering and natural sciences.",
      "openalex_id": "https://openalex.org/W950991549",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2001-10-18",
      "citations": 4477,
      "mechanism_score": 10
    },
    {
      "title": "Synchronization a universal concept in nonlinear sciences",
      "abstract": "Preface 1. Introduction Part I. Synchronization Without Formulae: 2. Basic notions: the self-sustained oscillator and its phase 3. Synchronization of a periodic oscillator by external force 4. Synchronization of two and many oscillators 5. Synchronization of chaotic systems 6. Detecting synchronization in experiments Part II. Phase Locking and Frequency Entrainment: 7. Synchronization of periodic oscillators by periodic external action 8. Mutual synchronization of two interacting periodic oscillators 9. Synchronization in the presence of noise 10. Phase synchronization of chaotic systems 11. Synchronization in oscillatory media 12. Populations of globally coupled oscillators Part III. Synchronization of Chaotic Systems: 13. Complete synchronization I: basic concepts 14. Complete synchronization II: generalizations and complex systems 15. Synchronization of complex dynamics by external forces Appendix 1. Discovery of synchronization by Christiaan Huygens Appendix 2. Instantaneous phase and frequency of a signal References Index.",
      "openalex_id": "https://openalex.org/W1620414136",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2001-01-01",
      "citations": 5633,
      "mechanism_score": 10
    },
    {
      "title": "Tipping points in open systems: bifurcation, noise-induced and rate-dependent examples in the climate system",
      "abstract": "Abstract Tipping points associated with bifurcations (B-tipping) or induced by noise (N-tipping) are recognized mechanisms that may potentially lead to sudden climate change. We focus here on a novel class of tipping points, where a sufficiently rapid change to an input or parameter of a system may cause the system to ‘tip’ or move away from a branch of attractors. Such rate-dependent tipping, or R-tipping, need not be associated with either bifurcations or noise. We present an example of all three types of tipping in a simple global energy balance model of the climate system, illustrating the possibility of dangerous rates of change even in the absence of noise and of bifurcations in the underlying quasi-static system.",
      "openalex_id": "https://openalex.org/W2134761831",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2012-01-30",
      "citations": 650,
      "mechanism_score": 10
    },
    {
      "title": "Cascade Dynamics Modeling with Attention-based Recurrent Neural Network",
      "abstract": "An ability of modeling and predicting the cascades of resharing is crucial to understanding information propagation and to launching campaign of viral marketing. Conventional methods for cascade prediction heavily depend on the hypothesis of diffusion models, e.g., independent cascade model and linear threshold model. Recently, researchers attempt to circumvent the problem of cascade prediction using sequential models (e.g., recurrent neural network, namely RNN) that do not require knowing the underlying diffusion model. Existing sequential models employ a chain structure to capture the memory effect. However, for cascade prediction, each cascade generally corresponds to a diffusion tree, causing cross-dependence in cascade---one sharing behavior could be triggered by its non-immediate predecessor in the memory chain. In this paper, we propose to an attention-based RNN to capture the cross-dependence in cascade. Furthermore, we introduce a \\emph{coverage} strategy to combat the misallocation of attention caused by the memoryless of traditional attention mechanism. Extensive experiments on both synthetic and real world datasets demonstrate the proposed models outperform state-of-the-art models at both cascade prediction and inferring diffusion tree.",
      "openalex_id": "https://openalex.org/W2740189214",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "2017-07-28",
      "citations": 108,
      "mechanism_score": 10
    },
    {
      "title": "Emergence of cascading dynamics in interacting tipping elements of ecology and climate",
      "abstract": "In ecology, climate and other fields, (sub)systems have been identified that can transition into a qualitatively different state when a critical threshold or tipping point in a driving process is crossed. An understanding of those tipping elements is of great interest given the increasing influence of humans on the biophysical Earth system. Complex interactions exist between tipping elements, e.g. physical mechanisms connect subsystems of the climate system. Based on earlier work on such coupled nonlinear systems, we systematically assessed the qualitative long-term behaviour of interacting tipping elements. We developed an understanding of the consequences of interactions on the tipping behaviour allowing for tipping cascades to emerge under certain conditions. The (narrative) application of these qualitative results to real-world examples of interacting tipping elements indicates that tipping cascades with profound consequences may occur: the interacting Greenland ice sheet and thermohaline ocean circulation might tip before the tipping points of the isolated subsystems are crossed. The eutrophication of the first lake in a lake chain might propagate through the following lakes without a crossing of their individual critical nutrient input levels. The possibility of emerging cascading tipping dynamics calls for the development of a unified theory of interacting tipping elements and the quantitative analysis of interacting real-world tipping elements.",
      "openalex_id": "https://openalex.org/W3037839325",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2020-06-01",
      "citations": 92,
      "mechanism_score": 10
    },
    {
      "title": "The construction industry as a loosely coupled system: implications for productivity and innovation",
      "abstract": "Previous research suggests that the construction industry is characterized by (1) particular complexity factors owing to industry specific uncertainties and interdependences, and (2) inefficiency of operations. The aim of this study was to analyse the operations and behaviour of firms as a means of dealing with complexity. The observations made indicate that the industry as a whole is featured as a loosely coupled system. Taking this as a starting point, the couplings among activities, resources and actors were analysed in different dimensions. The pattern of couplings builds on two interdependent layers: tight couplings in individual projects and loose couplings based on collective adaptations in the permanent network. It is concluded that the pattern of couplings seems to favour short term productivity while hampering innovation and learning.",
      "openalex_id": "https://openalex.org/W2162531320",
      "domain": "Construction Project Management and Performance",
      "subdomain": "",
      "published_date": "2002-10-01",
      "citations": 1006,
      "mechanism_score": 10
    },
    {
      "title": "Complexity of Coupled Human and Natural Systems",
      "abstract": "Integrated studies of coupled human and natural systems reveal new and complex patterns and processes not evident when studied by social or natural scientists separately. Synthesis of six case studies from around the world shows that couplings between human and natural systems vary across space, time, and organizational units. They also exhibit nonlinear dynamics with thresholds, reciprocal feedback loops, time lags, resilience, heterogeneity, and surprises. Furthermore, past couplings have legacy effects on present conditions and future possibilities.",
      "openalex_id": "https://openalex.org/W2010365184",
      "domain": "Complex Systems and Decision Making",
      "subdomain": "",
      "published_date": "2007-09-13",
      "citations": 3461,
      "mechanism_score": 10
    },
    {
      "title": "Nonlinear Dynamics and Chaos",
      "abstract": "Preface. Preface to the First Edition. Acknowledgements from the First Edition. Introduction PART I: BASIC CONCEPTS OF NONLINEAR DYNAMICS An overview of nonlinear phenomena Point attractors in autonomous systems Limit cycles in autonomous systems Periodic attractors in driven oscillators Chaotic attractors in forced oscillators Stability and bifurcations of equilibria and cycles PART II ITERATED MAPS AS DYNAMICAL SYSTEMS Stability and bifurcation of maps Chaotic behaviour of one--and two--dimensional maps PART III FLOWS, OUTSTRUCTURES AND CHAOS The Geometry of Recurrence The Lorenz system Rosslers band Geometry of bifurcations PART IV APPLICATIONS IN THE PHYSICAL SCIENCES Subharmonic resonances of an offshore structure Chaotic motions of an impacting system Escape from a potential well Appendix. Illustrated Glossary. Bibliography. Online Resource. Index.",
      "openalex_id": "https://openalex.org/W2027674062",
      "domain": "Aquatic and Environmental Studies",
      "subdomain": "",
      "published_date": "1992-03-01",
      "citations": 1561,
      "mechanism_score": 10
    },
    {
      "title": "<i>Nonlinear Dynamics and Chaos: With Applications to Physics, Biology, Chemistry and Engineering</i>",
      "abstract": "Preface 1. Overview 1.0 Chaos, Fractals, and Dynamics 1.1 Capsule History of Dynamics 1.2 The Importance of Being Nonlinear 1.3 A Dynamical View of the World PART I. ONE-DIMENSIONAL FLOWS 2. Flows on the Line 2.0 Introduction 2.1 A Geometric Way of Thinking 2.2 Fixed Points and Stability 2.3 Population Growth 2.4 Linear Stability Analysis 2.5 Existence and Uniqueness 2.6 Impossibility of Oscillations 2.7 Potentials 2.8 Solving Equations on the Computer Exercises 3. Bifurcations 3.0 Introduction 3.1 Saddle-Node Bifurcation 3.2 Transcritical Bifurcation 3.3 Laser Threshold 3.4 Pitchfork Bifurcation 3.5 Overdamped Bead on a Rotating Hoop 3.6 Imperfect Bifurcations and Catastrophes 3.7 Insect Outbreak Exercises 4. Flows on the Circle 4.0 Introduction 4.1 Examples and Definitions 4.2 Uniform Oscillator 4.3 Nonuniform Oscillator 4.4 Overdamped Pendulum 4.5 Fireflies 4.6 Superconducting Josephson Junctions Exercises PART II. TWO-DIMENSIONAL FLOWS 5. Linear Systems 5.0 Introduction 5.1 Definitions and Examples 5.2 Classification of Linear Systems 5.3 Love Affairs Exercises 6. Phase Plane 6.0 Introduction 6.1 Phase Portraits 6.2 Existence, Uniqueness, and Topological Consequences 6.3 Fixed Points and Linearization 6.4 Rabbits versus Sheep 6.5 Conservative Systems 6.6 Reversible Systems 6.7 Pendulum 6.8 Index Theory Exercises 7. Limit Cycles 7.0 Introduction 7.1 Examples 7.2 Ruling Out Closed Orbits 7.3 Poincare-Bendixson Theorem 7.4 Lienard Systems 7.5 Relaxation Oscillators 7.6 Weakly Nonlinear Oscillators Exercises 8. Bifurcations Revisited 8.0 Introduction 8.1 Saddle-Node, Transcritical, and Pitchfork Bifurcations 8.2 Hopf Bifurcations 8.3 Oscillating Chemical Reactions 8.4 Global Bifurcations of Cycles 8.5 Hysteresis in the Driven Pendulum and Josephson Junction 8.6 Coupled Oscillators and Quasiperiodicity 8.7 Poincare Maps Exercises PART III. CHAOS 9. Lorenz Equations 9.0 Introduction 9.1 A Chaotic Waterwheel 9.2 Simple Properties of the Lorenz Equations 9.3 Chaos on a Strange Attractor 9.4 Lorenz Map 9.5 Exploring Parameter Space 9.6 Using Chaos to Send Secret Messages Exercises 10. One-Dimensional Maps 10.0 Introduction 10.1 Fixed Points and Cobwebs 10.2 Logistic Map: Numerics 10.3 Logistic Map: Analysis 10.4 Periodic Windows 10.5 Liapunov Exponent 10.6 Universality and Experiments 10.7 Renormalization Exercises 11. Fractals 11.0 Introduction 11.1 Countable and Uncountable Sets 11.2 Cantor Set 11.3 Dimension of Self-Similar Fractals 11.4 Box Dimension 11.5 Pointwise and Correlation Dimensions Exercises 12. Strange Attractors 12.0 Introductions 12.1 The Simplest Examples 12.2 Henon Map 12.3 Rossler System 12.4 Chemical Chaos and Attractor Reconstruction 12.5 Forced Double-Well Oscillator Exercises Answers to Selected Exercises References Author Index Subject Index",
      "openalex_id": "https://openalex.org/W2029030701",
      "domain": "Experimental and Theoretical Physics Studies",
      "subdomain": "",
      "published_date": "1995-03-01",
      "citations": 2652,
      "mechanism_score": 10
    },
    {
      "title": "Biochemical adaptation: Mechanism and process in physiological evolution",
      "abstract": "Biochemical Adaptation: Mechanism and Process in Physiological Evolution Hochachka, P. W., Somero, G. N.; Oxford University Press, 2002, 480 pp., ISBN 0-195-11702-6 (hardback), $80, ISBN 0-195-11703-4 (paperback), $40. This is an interesting book. Its aim is to provide an integrative review of knowledge in biochemistry from the viewpoint of the biologist interested in the synthetic analysis of the many data that have been found in biochemistry, particularly in the last two decades. The authors aim to integrate a wide range of information from fields such as metabolic regulation, genomics, or evolution. The major aim of the book is to find physiological implications from a wide set of data spread in the literature. The authors choose cellular metabolism, the influence of oxygen availability, the diving response, the tolerance to hypoxia, the evolution of the internal milieu, and the regulation of body temperature as the main parameters to study the integrative vision of biochemistry that is provided in this book. The main problem with this book, and with others of its kind, is that the reader needs to know the basic facts of biochemistry before attempting to study this volume. Indeed one has to know in some depth the basic facts of biochemistry and molecular biology, from metabolism to the regulation of gene expression, before studying the integrative approach offered by this book. Of course, it is impossible to offer both approaches in the same volume, i.e. the description of the main facts that constitute the large body of biochemistry and molecular biology today and also to offer the integrative vision that is offered in this book. Also, one might argue that some critically important physiological facts such as aging are not approached in this book. On the other hand, this volume offers a very unusual and very ingenious approach to the study of biochemistry. It will be useful for university students interested in biochemistry from many different approaches. Once the student has got a good hold on the basic facts of biochemistry from the analytical viewpoint, i.e. studying a classical biochemistry text book, then great pleasure can be derived from studying this book, which offers a radically new approach to biochemistry from the viewpoint of the adaptation of changes in conditions that spur the physiological evolution. Thus, I thoroughly recommend reading this book for those students of biochemistry interested not only in the usual analytical approach to problems but also in the more integrative physiological approach to the study of biochemistry.",
      "openalex_id": "https://openalex.org/W1994362240",
      "domain": "Genetics and Physical Performance",
      "subdomain": "",
      "published_date": "2002-05-01",
      "citations": 751,
      "mechanism_score": 9.5
    },
    {
      "title": "Master Stability Functions for Synchronized Coupled Systems",
      "abstract": "We show that many coupled oscillator array configurations considered in the literature can be put into a simple form so that determining the stability of the synchronous state can be done by a master stability function, which can be tailored to one's choice of stability requirement. This solves, once and for all, the problem of synchronous stability for any linear coupling of that oscillator.",
      "openalex_id": "https://openalex.org/W2083787309",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "1998-03-09",
      "citations": 2552,
      "mechanism_score": 9.5
    },
    {
      "title": "Chaos and Nonlinear Dynamics",
      "abstract": "Abstract This book introduces the full range of activity in the rapidly growing field of nonlinear dynamics. Using a step-by-step introduction to dynamics and geometry in state space as the central focus of understanding nonlinear dynamics, this book includes a thorough treatment of both differential equation models and iterated map models (including a detailed derivation of the famous Feigenbaum numbers). It includes the increasingly important field of pattern formation and a survey of the controversial question of quantum chaos. Important tools such as Lyapunov exponents, fractal dimensions, and correlation dimensions are treated in detail. Several appendices provide a detailed derivation of the Lorenz model from the Navier-Stokes equation, a summary of bifurcation theory, and some simple computer programs to study nonlinear dynamics. Each chapter includes an extensive, annotated bibliography.",
      "openalex_id": "https://openalex.org/W2489691424",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "2000-09-14",
      "citations": 1359,
      "mechanism_score": 9.5
    },
    {
      "title": "Nonlinear dynamics and breakup of free-surface flows",
      "abstract": "Surface-tension-driven flows and, in particular, their tendency to decay spontaneously into drops have long fascinated naturalists, the earliest systematic experiments dating back to the beginning of the 19th century. Linear stability theory governs the onset of breakup and was developed by Rayleigh, Plateau, and Maxwell. However, only recently has attention turned to the nonlinear behavior in the vicinity of the singular point where a drop separates. The increased attention is due to a number of recent and increasingly refined experiments, as well as to a host of technological applications, ranging from printing to mixing and fiber spinning. The description of drop separation becomes possible because jet motion turns out to be effectively governed by one-dimensional equations, which still contain most of the richness of the original dynamics. In addition, an attraction for physicists lies in the fact that the separation singularity is governed by universal scaling laws, which constitute an asymptotic solution of the Navier-Stokes equation before and after breakup. The Navier-Stokes equation is thus continued uniquely through the singularity. At high viscosities, a series of noise-driven instabilities has been observed, which are a nested superposition of singularities of the same universal form. At low viscosities, there is rich scaling behavior in addition to aesthetically pleasing breakup patterns driven by capillary waves. The author reviews the theoretical development of this field alongside recent experimental work, and outlines unsolved problems.",
      "openalex_id": "https://openalex.org/W2126488447",
      "domain": "Fluid Dynamics and Heat Transfer",
      "subdomain": "",
      "published_date": "1997-07-01",
      "citations": 1752,
      "mechanism_score": 9.5
    },
    {
      "title": "Synaptic Mechanisms and Network Dynamics Underlying Spatial Working Memory in a Cortical Network Model",
      "abstract": "Single-neuron recordings from behaving primates have established a link between working memory processes and information-specific neuronal persistent activity in the prefrontal cortex. Using a network model endowed with a columnar architecture and based on the physiological properties of cortical neurons and synapses, we have examined the synaptic mechanisms of selective persistent activity underlying spatial working memory in the prefrontal cortex. Our model reproduces the phenomenology of the oculomotor delayed-response experiment of Funahashi et al. (S. Funahashi, C.J. Bruce and P.S. Goldman-Rakic, Mnemonic coding of visual space in the monkey's dorsolateral prefrontal cortex. J Neurophysiol 61:331-349, 1989). To observe stable spontaneous and persistent activity, we find that recurrent synaptic excitation should be primarily mediated by NMDA receptors, and that overall recurrent synaptic interactions should be dominated by inhibition. Isodirectional tuning of adjacent pyramidal cells and interneurons can be accounted for by a structured pyramid-to-interneuron connectivity. Robust memory storage against random drift of the tuned persistent activity and against distractors (intervening stimuli during the delay period) may be enhanced by neuromodulation of recurrent synapses. Experimentally testable predictions concerning the neural basis of working memory are discussed.",
      "openalex_id": "https://openalex.org/W1989512479",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2000-09-01",
      "citations": 1203,
      "mechanism_score": 9.0
    },
    {
      "title": "Patterns and collective behavior in granular media: Theoretical concepts",
      "abstract": "Granular materials are ubiquitous in our daily lives. While they have been a\\nsubject of intensive engineering research for centuries, in the last decade\\ngranular matter attracted significant attention of physicists. Yet despite a\\nmajor efforts by many groups, the theoretical description of granular systems\\nremains largely a plethora of different, often contradicting concepts and\\napproaches. Authors give an overview of various theoretical models emerged in\\nthe physics of granular matter, with the focus on the onset of collective\\nbehavior and pattern formation. Their aim is two-fold: to identify general\\nprinciples common for granular systems and other complex non-equilibrium\\nsystems, and to elucidate important distinctions between collective behavior in\\ngranular and continuum pattern-forming systems.\\n",
      "openalex_id": "https://openalex.org/W2069457875",
      "domain": "Granular flow and fluidized beds",
      "subdomain": "",
      "published_date": "2006-06-01",
      "citations": 824,
      "mechanism_score": 9.0
    },
    {
      "title": "Environmental Tipping Points",
      "abstract": "Tipping points—where a small perturbation triggers a large response—can occur in many complex environmental systems. They produce abrupt and sometimes irreversible change, are inherently difficult to predict, and thus pose considerable challenges to the occupants and managers of those systems. However, tipping points can also represent opportunities. Here, different mathematical types of tipping points and different environmental processes that can give rise to them are distinguished. Then, I chart the crucial role that tipping points played in creating the modern Earth system. Looking ahead, potential large-scale tipping points are briefly reviewed before highlighting systems that could harbor tipping points across mechanisms and scales. The prospects for anticipating tipping points, avoiding dangerous ones, and encouraging others are outlined. Finally, a series of virtuous tipping points are identified, which can help transform the relationships between human societies and the environmental systems we depend upon.",
      "openalex_id": "https://openalex.org/W2101687942",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2013-08-12",
      "citations": 267,
      "mechanism_score": 9.0
    },
    {
      "title": "Ordering, metastability and phase transitions in two-dimensional systems",
      "abstract": "A new definition of order called topological order is proposed for two-dimensional systems in which no long-range order of the conventional type exists. The possibility of a phase transition characterized by a change in the response of the system to an external perturbation is discussed in the context of a mean field type of approximation. The critical behaviour found in this model displays very weak singularities. The application of these ideas to the xy model of magnetism, the solid-liquid transition, and the neutral superfluid are discussed. This type of phase transition cannot occur in a superconductor nor in a Heisenberg ferromagnet.",
      "openalex_id": "https://openalex.org/W2086860422",
      "domain": "Physics of Superconductivity and Magnetism",
      "subdomain": "",
      "published_date": "1973-04-12",
      "citations": 9267,
      "mechanism_score": 8.5
    },
    {
      "title": "Quantum Phase Transitions",
      "abstract": "Quantum Phase Transitions is the first book to describe in detail the fundamental changes that can occur in the macroscopic nature of matter at zero temperature due to small variations in a given external parameter. The subject plays a central role in the study of the electrical and magnetic properties of numerous important solid state materials. The author begins by developing the theory of quantum phase transitions in the simplest possible class of non-disordered, interacting systems - the quantum Ising and rotor models. Particular attention is paid to their non-zero temperature dynamic and transport properties in the vicinity of the quantum critical point. Several other quantum phase transitions of increasing complexity are then discussed and clarified. Throughout, the author interweaves experimental results with presentation of theoretical models, and well over 500 references are included. The book will be of great interest to graduate students and researchers in condensed matter physics.",
      "openalex_id": "https://openalex.org/W4308326495",
      "domain": "Advanced Physical and Chemical Molecular Interactions",
      "subdomain": "",
      "published_date": "2000-01-13",
      "citations": 3388,
      "mechanism_score": 8.5
    },
    {
      "title": "Adaptation Mechanisms of Small Ruminants to Environmental Heat Stress",
      "abstract": "Small ruminants are the critical source of livelihood for rural people to the development of sustainable and environmentally sound production systems. They provided a source of meat, milk, skin, and fiber. The several contributions of small ruminants to the economy of millions of rural people are however being challenged by extreme heat stress difficulties. Heat stress is one of the most detrimental factors contributing to reduced growth, production, reproduction performance, milk quantity and quality, as well as natural immunity, making animals more vulnerable to diseases and even death. However, small ruminants have successfully adapted to this extreme environment and possess some unique adaptive traits due to behavioral, morphological, physiological, and largely genetic bases. This review paper, therefore, aims to provide an integrative explanation of small ruminant adaptation to heat stress and address some responsible candidate genes in adapting to thermal-stressed environments.",
      "openalex_id": "https://openalex.org/W2916504332",
      "domain": "Effects of Environmental Stressors on Livestock",
      "subdomain": "",
      "published_date": "2019-02-28",
      "citations": 213,
      "mechanism_score": 8.5
    },
    {
      "title": "The Kuramoto model: A simple paradigm for synchronization phenomena",
      "abstract": "Synchronization phenomena in large populations of interacting elements are the subject of intense research efforts in physical, biological, chemical, and social systems. A successful approach to the problem of synchronization consists of modeling each member of the population as a phase oscillator. In this review, synchronization is analyzed in one of the most representative models of coupled phase oscillators, the Kuramoto model. A rigorous mathematical treatment, specific numerical methods, and many variations and extensions of the original model that have appeared in the last few years are presented. Relevant applications of the model in different contexts are also included.",
      "openalex_id": "https://openalex.org/W2168448159",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "2005-04-07",
      "citations": 3383,
      "mechanism_score": 8.5
    },
    {
      "title": "Quantum Field Theory and Critical Phenomena",
      "abstract": "Abstract Introduced as a quantum extension of Maxwell's classical theory, quantum electrodynamic (QED) has been the first example of a quantum field theory (QFT). Eventually, QFT has become the framework for the discussion of all fundamental interactions at the microscopic scale except, possibly, gravity. More surprisingly, it has also provided a framework for the understanding of second order phase transitions in statistical mechanics. In fact, as hopefully this work illustrates, QFT is the natural framework for the discussion of most systems involving an infinite number of degrees of freedom with local couplings. These systems range from cold Bose gases at the condensation temperature (about ten nanokelvin) to conventional phase transitions (from a few degrees to several hundred) and high energy particle physics up to a TeV, altogether more than twenty orders of magnitude in the energy scale. Therefore, although excellent textbooks about QFT had already been published, I thought, many years ago, that it might not be completely worthless to present a work in which the strong formal relations between particle physics and the theory of critical phenomena are systematically emphasized. This option explains some of the choices made in the presentation. A formulation in terms of field integrals has been adopted to study the properties of QFT. The language of partition and correlation functions has been used throughout, even in applications of QFT to particle physics. Renormalization and renormalization group (RG) properties are systematically discussed. The notion of effective field theory (EFT) and the emergence of renormalizable theories are described. The consequences for fine-tuning and triviality issue are emphasized. This fifth edition has been updated and fully revised.",
      "openalex_id": "https://openalex.org/W2039263963",
      "domain": "Computational Physics and Python Applications",
      "subdomain": "",
      "published_date": "2002-06-06",
      "citations": 2948,
      "mechanism_score": 8.5
    },
    {
      "title": "Propagation and Its Failure in Coupled Systems of Discrete Excitable Cells",
      "abstract": "We study propagation and its failure in systems of discrete coupled excitable cells. It is shown that propagation fails when coupling is weak, but succeeds if coupling is strong enough. We use a theorem of Moser on maps of the plane to establish the existence of an infinite variety of stable standing solutions when coupling is small. We use upper and lower solution techniques and perturbation analysis to show that propagation is successful when the coupling strength is large enough. These results are applied to the cubic FitzHugh–Nagumo dynamics as well as to the more realistic Beeler–Reuter model of action potentials in myocardial cells.",
      "openalex_id": "https://openalex.org/W1993693726",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "subdomain": "",
      "published_date": "1987-06-01",
      "citations": 606,
      "mechanism_score": 8.5
    },
    {
      "title": "Desert dust suppressing precipitation: A possible desertification feedback loop",
      "abstract": "The effect of desert dust on cloud properties and precipitation has so far been studied solely by using theoretical models, which predict that rainfall would be enhanced. Here we present observations showing the contrary; the effect of dust on cloud properties is to inhibit precipitation. Using satellite and aircraft observations we show that clouds forming within desert dust contain small droplets and produce little precipitation by drop coalescence. Measurement of the size distribution and the chemical analysis of individual Saharan dust particles collected in such a dust storm suggest a possible mechanism for the diminished rainfall. The detrimental impact of dust on rainfall is smaller than that caused by smoke from biomass burning or anthropogenic air pollution, but the large abundance of desert dust in the atmosphere renders it important. The reduction of precipitation from clouds affected by desert dust can cause drier soil, which in turn raises more dust, thus providing a possible feedback loop to further decrease precipitation. Furthermore, anthropogenic changes of land use exposing the topsoil can initiate such a desertification feedback process.",
      "openalex_id": "https://openalex.org/W2124867185",
      "domain": "Aeolian processes and effects",
      "subdomain": "",
      "published_date": "2001-05-15",
      "citations": 849,
      "mechanism_score": 8.0
    },
    {
      "title": "Quantum phase transition from a superfluid to a Mott insulator in a gas of ultracold atoms",
      "abstract": "For a system at a temperature of absolute zero, all thermal fluctuations are frozen out, while quantum fluctuations prevail. These microscopic quantum fluctuations can induce a macroscopic phase transition in the ground state of a many-body system when the relative strength of two competing energy terms is varied across a critical value. Here we observe such a quantum phase transition in a Bose-Einstein condensate with repulsive interactions, held in a three-dimensional optical lattice potential. As the potential depth of the lattice is increased, a transition is observed from a superfluid to a Mott insulator phase. In the superfluid phase, each atom is spread out over the entire lattice, with long-range phase coherence. But in the insulating phase, exact numbers of atoms are localized at individual lattice sites, with no phase coherence across the lattice; this phase is characterized by a gap in the excitation spectrum. We can induce reversible changes between the two ground states of the system.",
      "openalex_id": "https://openalex.org/W2007391198",
      "domain": "Cold Atom Physics and Bose-Einstein Condensates",
      "subdomain": "",
      "published_date": "2002-01-01",
      "citations": 5734,
      "mechanism_score": 8.0
    },
    {
      "title": "Top management team turnover as an adaptation mechanism: The role of the environment",
      "abstract": "Abstract Based on an organizational adaptation framework, this study examines the influence of three environmental dimensions–munificence, stability, and complexity–on top management team turnover. In addition to investigating the direct influence of these environmental dimensions, indirect effects through firm performance and strategic change are also examined; the indirect effect of environmental complexity through demographic heterogeneity is also studied. Path analysis indicates that the direct effects of the three environmental dimensions predominate. Indirect effects were nonsignificant except for the effect of instability and munificence through strategic change. By expanding the team turnover context to include environmental and strategic dimensions, in addition to previously examined performance and heterogeneity factors, this study enhances our understanding of managerial turnover as a form of organizational adaptation.",
      "openalex_id": "https://openalex.org/W2023579566",
      "domain": "Innovation and Knowledge Management",
      "subdomain": "",
      "published_date": "1993-10-01",
      "citations": 429,
      "mechanism_score": 8.0
    },
    {
      "title": "Cascading dynamics in modular networks",
      "abstract": "In this paper we study a simple cascading process in a structured heterogeneous population, namely, a network composed of two loosely coupled communities. We demonstrate that under certain conditions the cascading dynamics in such a network has a two-tiered structure that characterizes activity spreading at different rates in the communities. We study the dynamics of the model using both simulations and an analytical approach based on annealed approximation and obtain good agreement between the two. Our results suggest that network modularity might have implications in various applications, such as epidemiology and viral marketing.",
      "openalex_id": "https://openalex.org/W2063595837",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "2007-03-23",
      "citations": 105,
      "mechanism_score": 7.5
    },
    {
      "title": "Emergent Behavior in Flocks",
      "abstract": "We provide a model (for both continuous and discrete time) describing the evolution of a flock. Our model is parameterized by a constant beta capturing the rate of decay-which in our model is polynomial-of the influence between birds in the flock as they separate in space. Our main result shows that when beta<1/2 convergence of the flock to a common velocity is guaranteed, while for betages1/2 convergence is guaranteed under some condition on the initial positions and velocities of the birds only",
      "openalex_id": "https://openalex.org/W2103714988",
      "domain": "Distributed Control Multi-Agent Systems",
      "subdomain": "",
      "published_date": "2007-05-01",
      "citations": 1744,
      "mechanism_score": 7.0
    },
    {
      "title": "Novel Type of Phase Transition in a System of Self-Driven Particles",
      "abstract": "A simple model with a novel type of dynamics is introduced in order to investigate the emergence of self-ordered motion in systems of particles with biologically motivated interaction. In our model particles are driven with a constant absolute velocity and at each time step assume the average direction of motion of the particles in their neighborhood with some random perturbation ($\\eta$) added. We present numerical evidence that this model results in a kinetic phase transition from no transport (zero average velocity, $| {\\bf v}_a | =0$) to finite net transport through spontaneous symmetry breaking of the rotational symmetry. The transition is continuous since $| {\\bf v}_a |$ is found to scale as $(\\eta_c-\\eta)^\\beta$ with $\\beta\\simeq 0.45$.",
      "openalex_id": "https://openalex.org/W2015410655",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "1995-08-07",
      "citations": 7212,
      "mechanism_score": 7.0
    },
    {
      "title": "Climate Tipping Points",
      "abstract": "This report reviews evidence that overshooting 1.5°C may push the earth over several tipping points, leading to irreversible and severe changes in the climate system. If triggered, tipping point impacts will rapidly cascade through socio-economic and ecological systems, leading to severe effects on human and natural systems and imposing important challenges for human adaptation. Of particular concern are the likely collapse of the West Antarctic and Greenland ice sheets and the abrupt melting of permafrost grounds in the Arctic, which would result in additional sea-level rise and greenhouse gas releases, leading to more warming. Based on the most recent science and consultations with renowned experts, Climate Tipping Points: Insights for Effective Policy Action argues that it is no longer appropriate to consider the risk of crossing tipping points as low-probability. Overshooting 1.5°C may likely lead to irreversible and severe impacts, which must be avoided, heightening the urgency to drastically reduce emissions within this decade. The report calls for a shift in how tipping points are treated in climate policy today and provides recommendations on how climate risk management strategies can better reflect the risks of tipping points in the areas of mitigation, adaptation and technological innovation.",
      "openalex_id": "https://openalex.org/W4310538351",
      "domain": "unknown",
      "subdomain": "",
      "published_date": "2022-12-02",
      "citations": 195,
      "mechanism_score": 7.0
    },
    {
      "title": "The Statistical Evaluation of Social Network Dynamics",
      "abstract": "A class of statistical models is proposed for longitudinal network data. The dependent variable is the changing (or evolving) relation network, represented by two or more observations of a directed graph with a fixed set of actors. The network evolution is modeled as the consequence of the actors making new choices, or withdrawing existing choices, on the basis of functions, with fixed and random components, that the actors try to maximize. Individual and dyadic exogenous variables can be used as covariates. The change in the network is modeled as the stochastic result of network effects (reciprocity, transitivity, etc.) and these covariates. The existing network structure is a dynamic constraint for the evolution of the structure itself. The models are continuous-time Markov chain models that can be implemented as simulation models. The model parameters are estimated from observed data. For estimating and testing these models, statistical procedures are proposed that are based on the method of moments. The statistical procedures are implemented using a stochastic approximation algorithm based on computer simulations of the network evolution process.",
      "openalex_id": "https://openalex.org/W2104725117",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "2001-01-01",
      "citations": 1202,
      "mechanism_score": 6.5
    },
    {
      "title": "A one‐parameter Budyko model for water balance captures emergent behavior in darwinian hydrologic models",
      "abstract": "Abstract Hydrologic models can be categorized as being either Newtonian or Darwinian in nature. The Newtonian approach requires a thorough understanding of the individual physical processes acting in a watershed in order to build a detailed hydrologic model based on the conservation equations. The Darwinian approach seeks to explain the behavior of a hydrologic system as a whole by identifying simple and robust temporal or spatial patterns that capture the relevant processes. Darwinian‐based hydrologic models include the Soil Conservation Service (SCS) curve number model, the “abcd” model, and the Budyko‐type models. However, these models were developed based on widely differing principles and assumptions and applied to distinct time scales. Here, we derive a one‐parameter Budyko‐type model for mean annual water balance which is based on a generalization of the proportionality hypothesis of the SCS model and therefore is independent of temporal scale. Furthermore, we show that the new model is equivalent to the key equation of the “abcd” model. Theoretical lower and upper bounds of the new model are identified and validated based on previous observations. Thus, we illustrate a temporal pattern of water balance amongst Darwinian hydrologic models, which allows for synthesis with the Newtonian approach and offers opportunities for progress in hydrologic modeling.",
      "openalex_id": "https://openalex.org/W1587146230",
      "domain": "Hydrology and Watershed Management Studies",
      "subdomain": "",
      "published_date": "2014-06-17",
      "citations": 317,
      "mechanism_score": 6.5
    },
    {
      "title": "Quantum Spin Hall Effect and Topological Phase Transition in HgTe Quantum Wells",
      "abstract": "We show that the quantum spin Hall (QSH) effect, a state of matter with topological properties distinct from those of conventional insulators, can be realized in mercury telluride–cadmium telluride semiconductor quantum wells. When the thickness of the quantum well is varied, the electronic state changes from a normal to an “inverted” type at a critical thickness d c . We show that this transition is a topological quantum phase transition between a conventional insulating phase and a phase exhibiting the QSH effect with a single pair of helical edge states. We also discuss methods for experimental detection of the QSH effect.",
      "openalex_id": "https://openalex.org/W2117734893",
      "domain": "Topological Materials and Phenomena",
      "subdomain": "",
      "published_date": "2006-12-14",
      "citations": 6888,
      "mechanism_score": 6.5
    },
    {
      "title": "Theory of dynamic critical phenomena",
      "abstract": "An introductory review of the central ideas in the modern theory of dynamic critical phenomena is followed by a more detailed account of recent developments in the field. The concepts of the conventional theory, mode-coupling, scaling, universality, and the renormalization group are introduced and are illustrated in the context of a simple example---the phase separation of a symmetric binary fluid. The renormalization group is then developed in some detail, and applied to a variety of systems. The main dynamic universality classes are identified and characterized. It is found that the mode-coupling and renormalization group theories successfully explain available experimental data at the critical point of pure fluids, and binary mixtures, and at many magnetic phase transitions, but that a number of discrepancies exist with data at the superfluid transition of $^{4}\\mathrm{He}$.",
      "openalex_id": "https://openalex.org/W2066359652",
      "domain": "Quantum, superfluid, helium dynamics",
      "subdomain": "",
      "published_date": "1977-07-01",
      "citations": 6690,
      "mechanism_score": 6.5
    },
    {
      "title": "Negative Feedback Loop of Wnt Signaling through Upregulation of Conductin/Axin2 in Colorectal and Liver Tumors",
      "abstract": "Activation of Wnt signaling through Î²-catenin/TCF complexes is a key event in the development of various tumors, in particular colorectal and liver tumors. Wnt signaling is controlled by the negative regulator conductin/axin2/axil, which induces degradation of Î²-catenin by functional interaction with the tumor suppressor APC and the serine/threonine kinase GSK3Î². Here we show that conductin is upregulated in human tumors that are induced by Î²-catenin/Wnt signaling, i.e., high levels of conductin protein and mRNA were found in colorectal and liver tumors but not in the corresponding normal tissues. In various other tumor types, conductin levels did not differ between tumor and normal tissue. Upregulation of conductin was also observed in the APC-deficient intestinal tumors of Min mice. Inhibition of Wnt signaling by a dominant-negative mutant of TCF downregulated conductin but not the related protein, axin, in DLD1 colorectal tumor cells. Conversely, activation of Wnt signaling by Wnt-1 or dishevelled increased conductin levels in MDA MB 231 and Neuro2A cells, respectively. In time course experiments, stabilization of Î²-catenin preceded the upregulation of conductin by Wnt-1. These results demonstrate that conductin is a target of the Wnt signaling pathway. Upregulation of conductin may constitute a negative feedback loop that controls Wnt signaling activity.",
      "openalex_id": "https://openalex.org/W2112763851",
      "domain": "Wnt/β-catenin signaling in development and cancer",
      "subdomain": "",
      "published_date": "2002-02-01",
      "citations": 1027,
      "mechanism_score": 6.0
    },
    {
      "title": "An E2F/miR-20a Autoregulatory Feedback Loop",
      "abstract": "The E2F family of transcription factors is essential in the regulation of the cell cycle and apoptosis. While the activity of E2F1-3 is tightly controlled by the retinoblastoma family of proteins, the expression of these factors is also regulated at the level of transcription, post-translational modifications and protein stability. Recently, a new level of regulation of E2Fs has been identified, where micro-RNAs (miRNAs) from the mir-17-92 cluster influence the translation of the E2F1 mRNA. We now report that miR-20a, a member of the mir-17-92 cluster, modulates the translation of the E2F2 and E2F3 mRNAs via binding sites in their 3'-untranslated region. We also found that the endogenous E2F1, E2F2, and E2F3 directly bind the promoter of the mir-17-92 cluster activating its transcription, suggesting an autoregulatory feedback loop between E2F factors and miRNAs from the mir-17-92 cluster. Our data also point toward an anti-apoptotic role for miR-20a, since overexpression of this miRNA decreased apoptosis in a prostate cancer cell line, while inhibition of miR-20a by an antisense oligonucleotide resulted in increased cell death after doxorubicin treatment. This anti-apoptotic role of miR-20a may explain some of the oncogenic capacities of the mir-17-92 cluster. Altogether, these results suggest that the autoregulation between E2F1-3 and miR-20a is important for preventing an abnormal accumulation of E2F1-3 and may play a role in the regulation of cellular proliferation and apoptosis.",
      "openalex_id": "https://openalex.org/W2042027879",
      "domain": "MicroRNA in disease regulation",
      "subdomain": "",
      "published_date": "2006-11-29",
      "citations": 614,
      "mechanism_score": 6.0
    },
    {
      "title": "At home in the universe: the search for laws of self-organization and complexity",
      "abstract": "Complexity theory is one of the most controversial areas of current scientific research. Developing out of chaos theory, complexity suggests that there are hidden tendencies in nature to select ordered states, even when statistically they are vastly outnumbered by chaotic possibilities: that there is a deep natural impulse towards order, counteracting the degenerative tendencies of the Second Law of Thermodynamics. Like chaos, complexity is a multidisciplinary area of research and those involved include physicists, economists and biologists. This is a study of complexity.",
      "openalex_id": "https://openalex.org/W2100317815",
      "domain": "Chaos, Complexity, and Education",
      "subdomain": "",
      "published_date": "1996-02-01",
      "citations": 2902,
      "mechanism_score": 6.0
    },
    {
      "title": "Phase Transitions and Critical Phenomena",
      "abstract": "The field of phase transitions and critical phenomena continues to be active in research, producing a steady stream of interesting and fruitful results. It has moved into a central place in condensed matter studies. Statistical physics, and more specifically, the theory of transitions between states of matter, more or less defines what we know about 'everyday' matter and its transformations. The major aim of this serial is to provide review articles that can serve as standard references for research workers in the field, and for graduate students and others wishing to obtain reliable information on important recent developments.",
      "openalex_id": "https://openalex.org/W1540380506",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "2016-04-19",
      "citations": 11076,
      "mechanism_score": 6.0
    },
    {
      "title": "Phase Transitions and Critical Phenomena",
      "abstract": "The field of phase transitions and critical phenomena continues to be active in research, producing a steady stream of interesting and fruitful results. It has moved into a central place in condensed matter studies. Statistical physics, and more specifically, the theory of transitions between states of matter, more or less defines what we know about 'everyday' matter and its transformations. The major aim of this serial is to provide review articles that can serve as standard references for research workers in the field, and for graduate students and others wishing to obtain reliable information on important recent developments.",
      "openalex_id": "https://openalex.org/W1540380506",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "2016-04-19",
      "citations": 11076,
      "mechanism_score": 6.0
    },
    {
      "title": "<i>Introduction to Phase Transitions and Critical Phenomena</i>",
      "abstract": "This is a paperback edition of a distinguished book, originally published by Clarendon Press in 1971. It was then the first text on critical phenomena, a field that has enjoyed great activity for the past twenty years and that still continues to attract much attention. The book is at the level at which a graduate student who has studied condensed matter physics can begin to comprehend the nature of phase transitions, which involve the transformation of one state of matter into another. (A simple example is the melting of a solid to become a liquid.) Such a transformation is termed 'critical' when, after a certain amount of the substance changes phase, the entire bulk virtually instantaneously also makes the transition. A second, updated edition is planned for future publication, but in the mean time this paperback reissue will be useful in teaching the fundamental principles of this extremely interesting subject.",
      "openalex_id": "https://openalex.org/W3003303647",
      "domain": "Advanced Thermodynamics and Statistical Mechanics",
      "subdomain": "",
      "published_date": "1973-01-01",
      "citations": 3653,
      "mechanism_score": 6.0
    },
    {
      "title": "An Information Flow Model for Conflict and Fission in Small Groups",
      "abstract": "The paper is devoted to game-theoretic methods for community detection in networks. The traditional methods for detecting community structure are based on selecting denser subgraphs inside the network. Here we propose to use the methods of cooperative game theory that highlight not only the link density but also the mechanisms of cluster formation. Specifically, we suggest two approaches from cooperative game theory: the first approach is based on the Myerson value, whereas the second approach is based on hedonic games. Both approaches allow to detect clusters with various resolution. However, the tuning of the resolution parameter in the hedonic games approach is particularly intuitive. Furthermore, the modularity based approach and its generalizations can be viewed as particular cases of the hedonic games.",
      "openalex_id": "https://openalex.org/W3101413764",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1977-12-01",
      "citations": 4648,
      "mechanism_score": 6.0
    },
    {
      "title": "Multifractal Cascade Dynamics and Turbulent Intermittency",
      "abstract": "Turbulent intermittency plays a fundamental role in fields ranging from combustion physics and chemical engineering to meteorology. There is a rather general agreement that multifractals are being very successful at quantifying this intermittency. However, we argue that cascade processes are the appropriate and necessary physical models to achieve dynamical modeling of turbulent intermittency. We first review some recent developments and point out new directions which overcome either completely or partially the limitations of current cascade models which are static, discrete in scale, acausal, purely phenomenological and lacking in universal features. We review the debate about universality classes for multifractal processes. Using both turbulent velocity and temperature data, we show that the latter are very well fitted by the (strong) universality, and that the recent (weak, log-Poisson) alternative is untenable for both strong and weak events. Using a continuous, space-time anisotropic framework, we then show how to produce a causal stochastic model of intermittent fields and use it to study the predictability of these fields. Finally, by returning to the origins of the turbulent \"shell models\" and restoring a large number of degrees of freedom (the Scaling Gyroscope Cascade, SGC models) we partially close the gap between the cascades and the dynamical Navier–Stokes equations. Furthermore, we point out that beyond a close agreement between universal parameters of the different modeling approaches and the empirical estimates in turbulence, there is a rather common structure involving both a \"renormalized viscosity\" and a \"renormalized forcing\". We conclude that this gives credence to the possibility of deriving analytical/renormalized models of intermittency built on this structure.",
      "openalex_id": "https://openalex.org/W2086893123",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1997-09-01",
      "citations": 279,
      "mechanism_score": 6.0
    },
    {
      "title": "Displacement Cascades. Dynamics and Atomic Structure",
      "abstract": "Abstract The seminal ideas of Seeger, in 1958 and 1962, on the nature of a displacement cascade (DC) in irradiated crystalline materials have played an important role in the field of radiation damage. This paper first reviews the early history of displacement spikes, replacement collision sequences (RCSs), “diluted” or depleted zones and thermal spikes. Then the use is discussed of molecular dynamics (MD) simulations and field‐ion microscopy as techniques by which one can study the dynamics of the formation of DCs and the spatial array of point defects — on an atomic scale — associated with quiescent DCs, respectively. These techniques demonstrate quantitatively that a DC consists of a vacancy‐rich core surrounded by a distribution of self‐interstitial atoms (SIAs) — the latter are predominately created by RCSs. Recent results on the application of MD to the behavior of 5 keV cascades in copper are presented. Some of the results of the application of field‐ion microscopy to the study of DCs in tungsten are reviewed, and compared with the MD results.",
      "openalex_id": "https://openalex.org/W2035976038",
      "domain": "Ion-surface interactions and analysis",
      "subdomain": "",
      "published_date": "1987-11-01",
      "citations": 57,
      "mechanism_score": 6.0
    },
    {
      "title": "Interaction ruling animal collective behavior depends on topological rather than metric distance: Evidence from a field study",
      "abstract": "Numerical models indicate that collective animal behavior may emerge from simple local rules of interaction among the individuals. However, very little is known about the nature of such interaction, so that models and theories mostly rely on aprioristic assumptions. By reconstructing the three-dimensional positions of individual birds in airborne flocks of a few thousand members, we show that the interaction does not depend on the metric distance, as most current models and theories assume, but rather on the topological distance. In fact, we discovered that each bird interacts on average with a fixed number of neighbors (six to seven), rather than with all neighbors within a fixed metric distance. We argue that a topological interaction is indispensable to maintain a flock's cohesion against the large density changes caused by external perturbations, typically predation. We support this hypothesis by numerical simulations, showing that a topological interaction grants significantly higher cohesion of the aggregation compared with a standard metric one.",
      "openalex_id": "https://openalex.org/W2112164016",
      "domain": "Animal Behavior and Reproduction",
      "subdomain": "",
      "published_date": "2008-01-28",
      "citations": 1981,
      "mechanism_score": 5.5
    },
    {
      "title": "Overview of Control and Grid Synchronization for Distributed Power Generation Systems",
      "abstract": "Renewable energy sources like wind, sun, and hydro are seen as a reliable alternative to the traditional energy sources such as oil, natural gas, or coal. Distributed power generation systems (DPGSs) based on renewable energy sources experience a large development worldwide, with Germany, Denmark, Japan, and USA as leaders in the development in this field. Due to the increasing number of DPGSs connected to the utility network, new and stricter standards in respect to power quality, safe running, and islanding protection are issued. As a consequence, the control of distributed generation systems should be improved to meet the requirements for grid interconnection. This paper gives an overview of the structures for the DPGS based on fuel cell, photovoltaic, and wind turbines. In addition, control structures of the grid-side converter are presented, and the possibility of compensation for low-order harmonics is also discussed. Moreover, control strategies when running on grid faults are treated. This paper ends up with an overview of synchronization methods and a discussion about their importance in the control",
      "openalex_id": "https://openalex.org/W2132755931",
      "domain": "Microgrid Control and Optimization",
      "subdomain": "",
      "published_date": "2006-10-01",
      "citations": 5073,
      "mechanism_score": 5.5
    },
    {
      "title": "Exceeding 1.5°C global warming could trigger multiple climate tipping points",
      "abstract": "Climate tipping points occur when change in a part of the climate system becomes self-perpetuating beyond a warming threshold, leading to substantial Earth system impacts. Synthesizing paleoclimate, observational, and model-based studies, we provide a revised shortlist of global “core” tipping elements and regional “impact” tipping elements and their temperature thresholds. Current global warming of ~1.1°C above preindustrial temperatures already lies within the lower end of some tipping point uncertainty ranges. Several tipping points may be triggered in the Paris Agreement range of 1.5 to &lt;2°C global warming, with many more likely at the 2 to 3°C of warming expected on current policy trajectories. This strengthens the evidence base for urgent action to mitigate climate change and to develop improved tipping point risk assessment, early warning capability, and adaptation strategies.",
      "openalex_id": "https://openalex.org/W4295088938",
      "domain": "Ecosystem dynamics and resilience",
      "subdomain": "",
      "published_date": "2022-09-08",
      "citations": 1673,
      "mechanism_score": 5.5
    },
    {
      "title": "Network Dynamics and Field Evolution: The Growth of Interorganizational Collaboration in the Life Sciences",
      "abstract": "A recursive analysis of network and institutional evolution is offered to account for the decentralized structure of the commercial field of the life sciences. Four alternative logics of attachment—accumulative advantage, homophily, follow‐the‐trend, and multiconnectivity—are tested to explain the structure and dynamics of interorganizational collaboration in biotechnology. Using multiple novel methods, the authors demonstrate how different rules for affiliation shape network evolution. Commercialization strategies pursued by early corporate entrants are supplanted by universities, research institutes, venture capital, and small firms. As organizations increase their collaborative activities and diversify their ties to others, cohesive subnetworks form, characterized by multiple, independent pathways. These structural components, in turn, condition the choices and opportunities available to members of a field, thereby reinforcing an attachment logic based on differential connections to diverse partners.",
      "openalex_id": "https://openalex.org/W1645343793",
      "domain": "Business Strategy and Innovation",
      "subdomain": "",
      "published_date": "2005-01-01",
      "citations": 1988,
      "mechanism_score": 5.0
    },
    {
      "title": "Protocols for self-organization of a wireless sensor network",
      "abstract": "We present a suite of algorithms for self-organization of wireless sensor networks in which there is a scalably large number of mainly static nodes with highly constrained energy resources. The protocols further support slow mobility by a subset of the nodes, energy-efficient routing, and formation of ad hoc subnetworks for carrying out cooperative signal processing functions among a set of the nodes.",
      "openalex_id": "https://openalex.org/W2162650992",
      "domain": "Energy Efficient Wireless Sensor Networks",
      "subdomain": "",
      "published_date": "2000-01-01",
      "citations": 2063,
      "mechanism_score": 5.0
    },
    {
      "title": "Attachment and reflective function: Their role in self-organization",
      "abstract": "The paper traces the relationship between attachment processes and the development of the capacity to envision mental states in self and others. We suggest that the ability to mentalize, to represent behavior in terms of mental states, or to have “a theory of mind” is a key determinant of self-organization which is acquired in the context of the child's early social relationships. Evidence for an association between the quality of attachment relationship and reflective function in the parent and the child is reviewed and interpreted in the context of current models of theory of mind development. A model of the development of self-organization is proposed which has at its core the caregiver's ability to communicate understanding of the child's intentional stance. The implications of the model for pathological self-development are explored, with specific reference to the consequences of maltreatment.",
      "openalex_id": "https://openalex.org/W2121454967",
      "domain": "Child and Animal Learning Development",
      "subdomain": "",
      "published_date": "1997-12-01",
      "citations": 1628,
      "mechanism_score": 5.0
    },
    {
      "title": "Threshold models of diffusion and collective behavior",
      "abstract": "(1983). Threshold models of diffusion and collective behavior. The Journal of Mathematical Sociology: Vol. 9, No. 3, pp. 165-179.",
      "openalex_id": "https://openalex.org/W2032319881",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1983-11-01",
      "citations": 480,
      "mechanism_score": 5.0
    },
    {
      "title": "Evolutionary tipping points in the capacity to adapt to environmental change",
      "abstract": "Significance Environmental variation is becoming more frequent and unpredictable as a consequence of climate change, yet we currently lack the tools to evaluate the extent to which organisms may adapt to this phenomenon. Here we develop a model that explores these issues and use it to study how changes in the timescale and predictability of environmental variation may ultimately affect population viability. Our model indicates that, although populations can often cope with fairly large changes in these environmental parameters, on occasion they will collapse abruptly and go extinct. We characterize the conditions under which these evolutionary tipping points occur and discuss how vulnerability to such cryptic threats may depend on the genetic architecture and life history of the organisms involved.",
      "openalex_id": "https://openalex.org/W2107289345",
      "domain": "Evolution and Genetic Dynamics",
      "subdomain": "",
      "published_date": "2014-11-24",
      "citations": 490,
      "mechanism_score": 5.0
    },
    {
      "title": "Information Flow and Cooperative Control of Vehicle Formations",
      "abstract": "We consider the problem of cooperation among a collection of vehicles performing a shared task using intervehicle communication to coordinate their actions. Tools from algebraic graph theory prove useful in modeling the communication network and relating its topology to formation stability. We prove a Nyquist criterion that uses the eigenvalues of the graph Laplacian matrix to determine the effect of the communication topology on formation stability. We also propose a method for decentralized information exchange between vehicles. This approach realizes a dynamical system that supplies each vehicle with a common reference to be used for cooperative motion. We prove a separation principle that decomposes formation stability into two components: Stability of this is achieved information flow for the given graph and stability of an individual vehicle for the given controller. The information flow can thus be rendered highly robust to changes in the graph, enabling tight formation control despite limitations in intervehicle communication capability.",
      "openalex_id": "https://openalex.org/W2146890818",
      "domain": "Distributed Control Multi-Agent Systems",
      "subdomain": "",
      "published_date": "2004-09-01",
      "citations": 4554,
      "mechanism_score": 5.0
    },
    {
      "title": "A lattice model of secure information flow",
      "abstract": "This paper investigates mechanisms that guarantee secure information flow in a computer system. These mechanisms are examined within a mathematical framework suitable for formulating the requirements of secure information flow among security classes. The central component of the model is a lattice structure derived from the security classes and justified by the semantics of information flow. The lattice properties permit concise formulations of the security requirements of different existing systems and facilitate the construction of mechanisms that enforce security. The model provides a unifying view of all systems that restrict information flow, enables a classification of them according to security objectives, and suggests some new approaches. It also leads to the construction of automatic program certification mechanisms for verifying the secure flow of information through a program.",
      "openalex_id": "https://openalex.org/W2094873755",
      "domain": "Security and Verification in Computing",
      "subdomain": "",
      "published_date": "1976-05-01",
      "citations": 1887,
      "mechanism_score": 5.0
    },
    {
      "title": "Language-based information-flow security",
      "abstract": "Current standard security practices do not provide substantial assurance that the end-to-end behavior of a computing system satisfies important security policies such as confidentiality. An end-to-end confidentiality policy might assert that secret input data cannot be inferred by an attacker through the attacker's observations of system output; this policy regulates information flow. Conventional security mechanisms such as access control and encryption do not directly address the enforcement of information-flow policies. Previously, a promising new approach has been developed: the use of programming-language techniques for specifying and enforcing information-flow policies. In this paper, we survey the past three decades of research on information-flow security, particularly focusing on work that uses static program analysis to enforce information-flow policies. We give a structured view of work in the area and identify some important open challenges.",
      "openalex_id": "https://openalex.org/W2122049982",
      "domain": "Security and Verification in Computing",
      "subdomain": "",
      "published_date": "2003-01-01",
      "citations": 1883,
      "mechanism_score": 5.0
    },
    {
      "title": "Chaos and Nonlinear Dynamics: Application to Financial Markets",
      "abstract": "ABSTRACT After the stock market crash of October 19, 1987, interest in nonlinear dynamics, especially deterministic chaotic dynamics, has increased in both the financial press and the academic literature. This has come about because the frequency of large moves in stock markets is greater than would be expected under a normal distribution. There are a number of possible explanations. A popular one is that the stock market is governed by chaotic dynamics. What exactly is chaos and how is it related to nonlinear dynamics? How does one detect chaos? Is there chaos in financial markets? Are there other explanations of the movements of financial prices other than chaos? The purpose of this paper is to explore these issues.",
      "openalex_id": "https://openalex.org/W2160607725",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1991-12-01",
      "citations": 962,
      "mechanism_score": 5.0
    },
    {
      "title": "The p53-mdm-2 autoregulatory feedback loop.",
      "abstract": "The p53 protein can bind to a set of specific DNA sequences, and this may activate the transcription of genes adjacent to these DNA elements. The mdm-2 gene is shown here to contain a p53 DNA-binding site and a genetically responsive element such that expression of the mdm-2 gene can be regulated by the level of wild-type p53 protein. The mdm-2 protein, in turn, can complex with p53 and decrease its ability to act as a positive transcription factor at the mdm-2 gene-responsive element. In this way, the mdm-2 gene is autoregulated. The p53 protein regulates the mdm-2 gene at the level of transcription, and the mdm-2 protein regulates the p53 protein at the level of its activity. This creates a feedback loop that regulates both the activity of the p53 protein and the expression of the mdm-2 gene.",
      "openalex_id": "https://openalex.org/W2170494099",
      "domain": "Cancer-related Molecular Pathways",
      "subdomain": "",
      "published_date": "1993-07-01",
      "citations": 1789,
      "mechanism_score": 4.5
    },
    {
      "title": "Cognitive radio: brain-empowered wireless communications",
      "abstract": "Cognitive radio is viewed as a novel approach for improving the utilization of a precious natural resource: the radio electromagnetic spectrum. The cognitive radio, built on a software-defined radio, is defined as an intelligent wireless communication system that is aware of its environment and uses the methodology of understanding-by-building to learn from the environment and adapt to statistical variations in the input stimuli, with two primary objectives in mind: /spl middot/ highly reliable communication whenever and wherever needed; /spl middot/ efficient utilization of the radio spectrum. Following the discussion of interference temperature as a new metric for the quantification and management of interference, the paper addresses three fundamental cognitive tasks. 1) Radio-scene analysis. 2) Channel-state estimation and predictive modeling. 3) Transmit-power control and dynamic spectrum management. This work also discusses the emergent behavior of cognitive radio.",
      "openalex_id": "https://openalex.org/W2071707134",
      "domain": "Cognitive Radio Networks and Spectrum Sensing",
      "subdomain": "",
      "published_date": "2005-02-01",
      "citations": 11904,
      "mechanism_score": 4.5
    },
    {
      "title": "Social Problems as Collective Behavior",
      "abstract": "Sociologists have erred in locating social problems in objective conditions. Instead, social problems have their being in a process of collective definition. This process determines whether social problems will arise, whether they become legitimated, how they are shaped in discussion, how they come to be addressed in official policy, and how they, are reconstituted in putting planned action into effect. Sociological theory and study must respect this process.",
      "openalex_id": "https://openalex.org/W2129695636",
      "domain": "Contemporary Sociological Theory and Practice",
      "subdomain": "",
      "published_date": "1971-01-01",
      "citations": 1057,
      "mechanism_score": 4.5
    },
    {
      "title": "Biochemical Adaptation: Mechanism and Process in Physiological Evolution",
      "abstract": "1. The Goals and Scope of This Volume 2. Cellular Metabolism, Regulation, and Homeostasis 3. Influence of Oxygen Availability 4. The Diving Response and Its Evolution 5. Human Hypoxia Tolerance 6. Water-Solute Adaptations: The Evolution and Regulation of the Internal Milieu 7. Temperature",
      "openalex_id": "https://openalex.org/W1604984248",
      "domain": "High Altitude and Hypoxia",
      "subdomain": "",
      "published_date": "1984-06-21",
      "citations": 1502,
      "mechanism_score": 4.5
    },
    {
      "title": "Synchronization in chaotic systems",
      "abstract": "Certain subsystems of nonlinear, chaotic systems can be made to synchronize by linking them with common signals. The criterion for this is the sign of the sub-Lyapunov exponents. We apply these ideas to a real set of synchronizing chaotic circuits.",
      "openalex_id": "https://openalex.org/W1970442252",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "1990-02-19",
      "citations": 10465,
      "mechanism_score": 4.5
    },
    {
      "title": "The Dynamics of Informational Cascades: The Monday Demonstrations in Leipzig, East Germany, 1989–91",
      "abstract": "This article analyzes the dynamics of turnout and the political impact of five cycles of protest, consisting of forty-two mass demonstrations that occurred on Mondays in Leipzig over the period 1989–91. These demonstrations are interpreted as an informational cascade that publicly revealed some of the previously hidden information about the malign nature of the East German communist regime. Once this information became publicly available, the viability of the regime was undermined. The Monday demonstrations subsequently died a slow death as their informational role declined.",
      "openalex_id": "https://openalex.org/W2047060383",
      "domain": "European history and politics",
      "subdomain": "",
      "published_date": "1994-10-01",
      "citations": 1034,
      "mechanism_score": 4.5
    },
    {
      "title": "Inhibition of mTORC1 leads to MAPK pathway activation through a PI3K-dependent feedback loop in human cancer",
      "abstract": "Numerous studies have established a causal link between aberrant mammalian target of rapamycin (mTOR) activation and tumorigenesis, indicating that mTOR inhibition may have therapeutic potential. In this study, we show that rapamycin and its analogs activate the MAPK pathway in human cancer, in what represents a novel mTORC1-MAPK feedback loop. We found that tumor samples from patients with biopsy-accessible solid tumors of advanced disease treated with RAD001, a rapamycin derivative, showed an administration schedule-dependent increase in activation of the MAPK pathway. RAD001 treatment also led to MAPK activation in a mouse model of prostate cancer. We further show that rapamycin-induced MAPK activation occurs in both normal cells and cancer cells lines and that this feedback loop depends on an S6K-PI3K-Ras pathway. Significantly, pharmacological inhibition of the MAPK pathway enhanced the antitumoral effect of mTORC1 inhibition by rapamycin in cancer cells in vitro and in a xenograft mouse model. Taken together, our findings identify MAPK activation as a consequence of mTORC1 inhibition and underscore the potential of a combined therapeutic approach with mTORC1 and MAPK inhibitors, currently employed as single agents in the clinic, for the treatment of human cancers.",
      "openalex_id": "https://openalex.org/W2157983986",
      "domain": "PI3K/AKT/mTOR signaling in cancer",
      "subdomain": "",
      "published_date": "2008-08-01",
      "citations": 1356,
      "mechanism_score": 4.0
    },
    {
      "title": "Analysis of a sleep-dependent neuronal feedback loop: the slow-wave microcontinuity of the EEG",
      "abstract": "Increasing depth of sleep corresponds to an increasing gain in the neuronal feedback loops that generate the low-frequency (slow-wave) electroencephalogram (EEG). We derived the maximum-likelihood estimator of the feedback gain and applied it to quantify sleep depth. The estimator computes the fraction (0%-100%) of the current slow wave which continues in the near-future (0.02 s later) EEG. Therefore, this percentage was dubbed slow-wave microcontinuity (SW%). It is not affected by anatomical parameters such as skull thickness, which can considerably bias the commonly used slow-wave power (SWP). In our study, both of the estimators SW% and SWP were monitored throughout two nights in 22 subjects. Each subject took temazepam (a benzodiazepine) on one of the two nights. Both estimators detected the effects of age, temazepam, and time of night on sleep. Females were found to have twice the SWP of males, but no gender effect on SW% was found. This confirms earlier reports that gender affects SWP but not sleep depth. Subjectively assessed differences in sleep quality between the nights were correlated to differences in SW%, not in SWP. These results demonstrate that slow-wave microcontinuity, being based on a physiological model of sleep, reflects sleep depth more closely than SWP does.",
      "openalex_id": "https://openalex.org/W2144691514",
      "domain": "EEG and Brain-Computer Interfaces",
      "subdomain": "",
      "published_date": "2000-01-01",
      "citations": 861,
      "mechanism_score": 4.0
    },
    {
      "title": "Brain network dynamics are hierarchically organized in time",
      "abstract": "Significance We address the important question of the temporal organization of large-scale brain networks, finding that the spontaneous transitions between networks of interacting brain areas are predictable. More specifically, the network activity is highly organized into a hierarchy of two distinct metastates, such that transitions are more probable within, than between, metastates. One of these metastates represents higher order cognition, and the other represents the sensorimotor systems. Furthermore, the time spent in each metastate is subject-specific, is heritable, and relates to behavior. Although evidence of non–random-state transitions has been found at the microscale, this finding at the whole-brain level, together with its relation to behavior, has wide implications regarding the cognitive role of large-scale resting-state networks.",
      "openalex_id": "https://openalex.org/W2765216222",
      "domain": "Neural dynamics and brain function",
      "subdomain": "",
      "published_date": "2017-10-30",
      "citations": 922,
      "mechanism_score": 4.0
    },
    {
      "title": "Experimental evidence for tipping points in social convention",
      "abstract": "Tipping points in social convention Once a population has converged on a consensus, how can a group with a minority viewpoint overturn it? Theoretical models have emphasized tipping points, whereby a sufficiently large minority can change the societal norm. Centola et al. devised a system to study this in controlled experiments. Groups of people who had achieved a consensus about the name of a person shown in a picture were individually exposed to a confederate who promoted a different name. The only incentive was to coordinate. When the number of confederates was roughly 25% of the group, the opinion of the majority could be tipped to that of the minority. Science , this issue p. 1116",
      "openalex_id": "https://openalex.org/W2805301067",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "2018-06-07",
      "citations": 643,
      "mechanism_score": 4.0
    },
    {
      "title": "The renormalization group: Critical phenomena and the Kondo problem",
      "abstract": "This review covers several topics involving renormalization group ideas. The solution of the $s$-wave Kondo Hamiltonian, describing a single magnetic impurity in a nonmagnetic metal, is explained in detail. See Secs. VII-IX. \"Block spin\" methods, applied to the two dimensional Ising model, are explained in Sec. VI. The first three sections give a relatively short review of basic renormalization group ideas, mainly in the context of critical phenomena. The relationship of the modern renormalization group to the older problems of divergences in statistical mechanics and field theory and field theoretic renormalization is discussed in Sec. IV. In Sec. V the special case of \"marginal variables\" is discussed in detail, along with the relationship of the modern renormalization group to its original formulation by Gell-Mann and Low and others.",
      "openalex_id": "https://openalex.org/W2052810501",
      "domain": "Theoretical and Computational Physics",
      "subdomain": "",
      "published_date": "1975-10-01",
      "citations": 4397,
      "mechanism_score": 4.0
    },
    {
      "title": "Introduction to Phase Transitions and Critical Phenomena",
      "abstract": "First Page",
      "openalex_id": "https://openalex.org/W2138256018",
      "domain": "nanoparticles nucleation surface interactions",
      "subdomain": "",
      "published_date": "1972-06-01",
      "citations": 4088,
      "mechanism_score": 4.0
    },
    {
      "title": "Loosely Coupled Systems: A Reconceptualization",
      "abstract": "Diverse applications of the concept of loose coupling are embodied in five recurring voices that focus separately on causation, typology, effects, compensations, and outcomes. Each has a tendency to drift away from a dialectical interpretation of loose coupling toward a unidimensional interpretation of loose coupling, thereby weakening the explanatory value of the concept. The authors first use the five voices to review the loose coupling literature and then to suggest more precise and more productive uses of the concept.",
      "openalex_id": "https://openalex.org/W2074684234",
      "domain": "Social Policy and Reform Studies",
      "subdomain": "",
      "published_date": "1990-04-01",
      "citations": 1944,
      "mechanism_score": 4.0
    },
    {
      "title": "Food Web Complexity and Species Diversity",
      "abstract": "It is suggested that local animal species diversity is related to the number of predators in the system and their efficiency in preventing single species from monopolizing some important, limiting, requisite. In the marine rocky intertidal this requisite usually is space. Where predators capable of preventing monopolies are missing, or are experimentally removed, the systems become less diverse. On a local scale, no relationship between latitude (10⚬ to 49⚬ N.) and diversity was found. On a geographic scale, an increased stability of annual production may lead to an increased capacity for systems to support higher-level carnivores. Hence tropical, or other, ecosystems are more diverse, and are characterized by disproportionately more carnivores.",
      "openalex_id": "https://openalex.org/W2054637019",
      "domain": "Isotope Analysis in Ecology",
      "subdomain": "",
      "published_date": "1966-01-01",
      "citations": 5304,
      "mechanism_score": 4.0
    },
    {
      "title": "Networks, Dynamics, and the Small‐World Phenomenon",
      "abstract": "The small‐world phenomenon formalized in this article as the coincidence of high local clustering and short global separation, is shown to be a general feature of sparse, decentralized networks that are neither completely ordered nor completely random. Networks of this kind have received little attention, yet they appear to be widespread in the social and natural sciences, as is indicated here by three distinct examples. Furthermore, small admixtures of randomness to an otherwise ordered network can have a dramatic impact on its dynamical, as well as structural, properties‐a feature illustrated by a simple model of disease transmission.",
      "openalex_id": "https://openalex.org/W2002470750",
      "domain": "Complex Network Analysis Techniques",
      "subdomain": "",
      "published_date": "1999-09-01",
      "citations": 1530,
      "mechanism_score": 3.5
    },
    {
      "title": "Self-Organization of CdSe Nanocrystallites into Three-Dimensional Quantum Dot Superlattices",
      "abstract": "The self-organization of CdSe nanocrystallites into three-dimensional semiconductor quantum dot superlattices (colloidal crystals) is demonstrated. The size and spacing of the dots within the superlattice are controlled with near atomic precision. This control is a result of synthetic advances that provide CdSe nanocrystallites that are monodisperse within the limit of atomic roughness. The methodology is not limited to semiconductor quantum dots but provides general procedures for the preparation and characterization of ordered structures of nanocrystallites from a variety of materials.",
      "openalex_id": "https://openalex.org/W2038237598",
      "domain": "Quantum Dots Synthesis And Properties",
      "subdomain": "",
      "published_date": "1995-11-24",
      "citations": 2198,
      "mechanism_score": 3.5
    },
    {
      "title": "Threshold Models of Collective Behavior",
      "abstract": "National audience",
      "openalex_id": "https://openalex.org/W2041157860",
      "domain": "Opinion Dynamics and Social Influence",
      "subdomain": "",
      "published_date": "1978-05-01",
      "citations": 5895,
      "mechanism_score": 3.5
    },
    {
      "title": "Management of soil phosphorus and plant adaptation mechanisms to phosphorus stress for sustainable crop production: a review",
      "abstract": "Phosphorus is one of the seventeen essential nutrients required for plant growth.Despite its importance, it is limiting crop yield on more than 40% of the world's arable land.Moreover, global P reserves are being depleted at a higher rate and according to some estimates there will be no soil P reserve by the year 2050.This is a potential threat to sustainable crop production.Most of the P applied in the form of fertilizers may be adsorbed by the soil, and is not available for plants lacking specific adaptations.Available soil P and hence crop yield can, however, be increased through applying P containing fertilizers to feed the ever increasing world population.The P contained in crop residues if left in the field can be recycled by incorporating the residues into the soil whereas part of P in crop residues fed to livestock can be returned back to the soil in the form of manure and as bone meal.Additionally, plants have evolved a diverse array of strategies to obtain adequate P for their growth under P limiting conditions (a term called as P-efficiency mechanisms).Plant P-efficiency mechanisms include both improved uptake efficiency (the ability of a plant to take up more P under P limiting condition) and improved utilization efficiency (the ability of a plant to produce higher dry matter yield per unit P taken up).Uptake efficiency mechanisms include modification of root architecture, development of large root system, longer root hairs and thinner roots, exudation of low molecular weight organic acids, protons and enzymes such as phosphatases and phytases, association with mycorrhiza, production of cluster roots and expression of high affinity P transporters all of which contribute to increased P uptake efficiency of the plant.Other mechanisms include the use of alternative P-independent enzymes and glycolytic pathways, efficient cytoplasmic P homeostasis and higher ability to remobilize P from other plant parts all of which are part of enhanced P utilization efficiency.Traits related to the above morphological, physiological, biochemical and molecular adaptation mechanisms under P stress can be utilized in improving cultivated crops for P efficiency through breeding programs.",
      "openalex_id": "https://openalex.org/W2164252576",
      "domain": "Plant nutrient uptake and metabolism",
      "subdomain": "",
      "published_date": "2012-01-01",
      "citations": 382,
      "mechanism_score": 3.5
    },
    {
      "title": "Robust frequency and timing synchronization for OFDM",
      "abstract": "A rapid synchronization method is presented for an orthogonal frequency-division multiplexing (OFDM) system using either a continuous transmission or a burst operation over a frequency-selective channel. The presence of a signal can be detected upon the receipt of just one training sequence of two symbols. The start of the frame and the beginning of the symbol can be found, and carrier frequency offsets of many subchannels spacings can be corrected. The algorithms operate near the Cramer-Rao lower bound for the variance of the frequency offset estimate, and the inherent averaging over many subcarriers allows acquisition at very low signal-to-noise ratios (SNRs).",
      "openalex_id": "https://openalex.org/W2110774823",
      "domain": "Advanced Wireless Communication Techniques",
      "subdomain": "",
      "published_date": "1997-01-01",
      "citations": 3364,
      "mechanism_score": 3.5
    },
    {
      "title": "Educational Organizations as Loosely Coupled Systems",
      "abstract": "Karl E. Weick In contrast to the prevailing image that elements in organizations are coupled through dense, tight linkages, it is proposed that elements are often tied together frequently and loosely. Using educational organizations as a case in point, it is argued that the concept of loose coupling incorporates a surprising number of disparate observations about organizations, suggests novel functions, creates stubborn problems for methodologists, and generates intriguing questions for scholars. Sample studies of loose coupling are suggested and research priorities are posed to foster cumulative work with this concept.1",
      "openalex_id": "https://openalex.org/W1996216743",
      "domain": "Management and Organizational Studies",
      "subdomain": "",
      "published_date": "1976-03-01",
      "citations": 7221,
      "mechanism_score": 3.5
    },
    {
      "title": "Combinatorial Optimization: Algorithms and Complexity.",
      "abstract": "This clearly written , mathematically rigorous text includes a novel algorithmic exposition of the simplex method and also discusses the Soviet ellipsoid algorithm for linear programming; efficient algorithms for network flow, matching, spanning trees, and matroids; the theory of NP-complete problems; approximation algorithms, local search heuristics for NPcomplete problems, more. All chapters are supplemented by thoughtprovoking problems. A useful work for graduate-level students with backgrounds in computer science, operations research, and electrical engineering. Mathematicians wishing a self-contained introduction need look no further.—American Mathematical Monthly. 1982 ed.",
      "openalex_id": "https://openalex.org/W2053913299",
      "domain": "unknown",
      "subdomain": "",
      "published_date": "1984-03-01",
      "citations": 6028,
      "mechanism_score": 3.5
    },
    {
      "title": "Salinity Stress Responses and Adaptation Mechanisms in Eukaryotic Green Microalgae",
      "abstract": "High salinity is a challenging environmental stress for organisms to overcome. Unicellular photosynthetic microalgae are especially vulnerable as they have to grapple not only with ionic imbalance and osmotic stress but also with the generated reactive oxygen species (ROS) interfering with photosynthesis. This review attempts to compare and contrast mechanisms that algae, particularly the eukaryotic Chlamydomonas microalgae, exhibit in order to immediately respond to harsh conditions caused by high salinity. The review also collates adaptation mechanisms of freshwater algae strains under persistent high salt conditions. Understanding both short-term and long-term algal responses to high salinity is integral to further fundamental research in algal biology and biotechnology.",
      "openalex_id": "https://openalex.org/W2994857466",
      "domain": "Algal biology and biofuel production",
      "subdomain": "",
      "published_date": "2019-12-17",
      "citations": 309,
      "mechanism_score": 3.0
    },
    {
      "title": "Network information flow",
      "abstract": "We introduce a new class of problems called network information flow which is inspired by computer network applications. Consider a point-to-point communication network on which a number of information sources are to be multicast to certain sets of destinations. We assume that the information sources are mutually independent. The problem is to characterize the admissible coding rate region. This model subsumes all previously studied models along the same line. We study the problem with one information source, and we have obtained a simple characterization of the admissible coding rate region. Our result can be regarded as the max-flow min-cut theorem for network information flow. Contrary to one's intuition, our work reveals that it is in general not optimal to regard the information to be multicast as a \"fluid\" which can simply be routed or replicated. Rather, by employing coding at the nodes, which we refer to as network coding, bandwidth can in general be saved. This finding may have significant impact on future design of switching systems.",
      "openalex_id": "https://openalex.org/W2105831729",
      "domain": "Cooperative Communication and Network Coding",
      "subdomain": "",
      "published_date": "2000-07-01",
      "citations": 7799,
      "mechanism_score": 3.0
    },
    {
      "title": "Approximate entropy as a measure of system complexity.",
      "abstract": "Techniques to determine changing system complexity from data are evaluated. Convergence of a frequently used correlation dimension algorithm to a finite value does not necessarily imply an underlying deterministic model or chaos. Analysis of a recently developed family of formulas and statistics, approximate entropy (ApEn), suggests that ApEn can classify complex systems, given at least 1000 data values in diverse settings that include both deterministic chaotic and stochastic processes. The capability to discern changing complexity from such a relatively small amount of data holds promise for applications of ApEn in a variety of contexts.",
      "openalex_id": "https://openalex.org/W2077204677",
      "domain": "Complex Systems and Time Series Analysis",
      "subdomain": "",
      "published_date": "1991-03-15",
      "citations": 5657,
      "mechanism_score": 3.0
    },
    {
      "title": "Nonlinear Dynamics and Chaos: With Applications to Physics, Biology, Chemistry, and Engineering",
      "abstract": "First Page",
      "openalex_id": "https://openalex.org/W2605543710",
      "domain": "Chaos control and synchronization",
      "subdomain": "",
      "published_date": "1994-09-01",
      "citations": 4699,
      "mechanism_score": 2.5
    },
    {
      "title": "A Complexity Measure",
      "abstract": "This paper describes a graph-theoretic complexity measure and illustrates how it can be used to manage and control program complexity. The paper first explains how the graph-theory concepts apply and gives an intuitive explanation of the graph concepts in programming terms. The control graphs of several actual Fortran programs are then presented to illustrate the correlation between intuitive complexity and the graph-theoretic complexity. Several properties of the graph-theoretic complexity are then proved which show, for example, that complexity is independent of physical size (adding or subtracting functional statements leaves complexity unchanged) and complexity depends only on the decision structure of a program.",
      "openalex_id": "https://openalex.org/W1964962870",
      "domain": "Logic, programming, and type systems",
      "subdomain": "",
      "published_date": "1976-12-01",
      "citations": 5740,
      "mechanism_score": 2.0
    },
    {
      "title": "TaintDroid: an information-flow tracking system for realtime privacy monitoring on smartphones",
      "abstract": "Today's smartphone operating systems frequently fail to provide users with adequate control over and visibility into how third-party applications use their private data. We address these shortcomings with TaintDroid, an efficient, system-wide dynamic taint tracking and analysis system capable of simultaneously tracking multiple sources of sensitive data. TaintDroid provides realtime analysis by leveraging Android's virtualized execution environment. TaintDroid incurs only 14% performance overhead on a CPU-bound micro-benchmark and imposes negligible overhead on interactive third-party applications. Using TaintDroid to monitor the behavior of 30 popular third-party Android applications, we found 68 instances of potential misuse of users' private information across 20 applications. Monitoring sensitive data with TaintDroid provides informed use of third-party applications for phone users and valuable input for smartphone security service firms seeking to identify misbehaving applications.",
      "openalex_id": "https://openalex.org/W1963971515",
      "domain": "Advanced Malware Detection Techniques",
      "subdomain": "",
      "published_date": "2010-10-04",
      "citations": 2280,
      "mechanism_score": 1.5
    },
    {
      "title": "The complexity of theorem-proving procedures",
      "abstract": "It is shown that any recognition problem solved by a polynomial time-bounded nondeterministic Turing machine can be “reduced” to the problem of determining whether a given propositional formula is a tautology. Here “reduced” means, roughly speaking, that the first problem can be solved deterministically in polynomial time provided an oracle is available for solving the second. From this notion of reducible, polynomial degrees of difficulty are defined, and it is shown that the problem of determining tautologyhood has the same polynomial degree as the problem of determining whether the first of two given graphs is isomorphic to a subgraph of the second. Other examples are discussed. A method of measuring the complexity of proof procedures for the predicate calculus is introduced and discussed.",
      "openalex_id": "https://openalex.org/W2036265926",
      "domain": "Computability, Logic, AI Algorithms",
      "subdomain": "",
      "published_date": "1971-01-01",
      "citations": 6116,
      "mechanism_score": 1.5
    },
    {
      "title": "MUSCLE: a multiple sequence alignment method with reduced time and space complexity",
      "abstract": "Abstract Background In a previous paper, we introduced MUSCLE, a new program for creating multiple alignments of protein sequences, giving a brief summary of the algorithm and showing MUSCLE to achieve the highest scores reported to date on four alignment accuracy benchmarks. Here we present a more complete discussion of the algorithm, describing several previously unpublished techniques that improve biological accuracy and / or computational complexity. We introduce a new option, MUSCLE-fast, designed for high-throughput applications. We also describe a new protocol for evaluating objective functions that align two profiles. Results We compare the speed and accuracy of MUSCLE with CLUSTALW, Progressive POA and the MAFFT script FFTNS1, the fastest previously published program known to the author. Accuracy is measured using four benchmarks: BAliBASE, PREFAB, SABmark and SMART. We test three variants that offer highest accuracy (MUSCLE with default settings), highest speed (MUSCLE-fast), and a carefully chosen compromise between the two (MUSCLE-prog). We find MUSCLE-fast to be the fastest algorithm on all test sets, achieving average alignment accuracy similar to CLUSTALW in times that are typically two to three orders of magnitude less. MUSCLE-fast is able to align 1,000 sequences of average length 282 in 21 seconds on a current desktop computer. Conclusions MUSCLE offers a range of options that provide improved speed and / or alignment accuracy compared with currently available programs. MUSCLE is freely available at http://www.drive5.com/muscle .",
      "openalex_id": "https://openalex.org/W1519266993",
      "domain": "Genomics and Phylogenetic Studies",
      "subdomain": "",
      "published_date": "2004-08-19",
      "citations": 9089,
      "mechanism_score": 1.5
    },
    {
      "title": "Self-Reports in Organizational Research: Problems and Prospects",
      "abstract": "Self-reports figure prominently in organizational and management research, but there are several problems associated with their use. This article identifies six categories of self-reports and discusses such problems as common method variance, the consistency motif, and social desirability. Statistical and post hoc remedies and some procedural methods for dealing with artifactual bias are presented and evaluated. Recommendations for future research are also offered.",
      "openalex_id": "https://openalex.org/W2150238850",
      "domain": "Job Satisfaction and Organizational Behavior",
      "subdomain": "",
      "published_date": "1986-12-01",
      "citations": 16605,
      "mechanism_score": 0.0
    }
  ],
  "extracted_mechanisms": [
    {
      "paper_id": 0,
      "description": "Mechanism from: A Robot that Walks; Emergent Behaviors from a Care...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Modular Robots and Swarm Intelligence",
      "embedding": null
    },
    {
      "paper_id": 0,
      "description": "Mechanism from: Physics of microswimmers—single particle motion an...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Micro and Nano Robotics",
      "embedding": null
    },
    {
      "paper_id": 0,
      "description": "Mechanism from: Synchronization...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "embedding": null
    },
    {
      "paper_id": 0,
      "description": "Mechanism from: Synchronization a universal concept in nonlinear s...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Nonlinear Dynamics and Pattern Formation",
      "embedding": null
    },
    {
      "paper_id": 0,
      "description": "Mechanism from: Tipping points in open systems: bifurcation, noise...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Ecosystem dynamics and resilience",
      "embedding": null
    },
    {
      "paper_id": 0,
      "description": "Mechanism from: Cascade Dynamics Modeling with Attention-based Rec...",
      "structural_description": "Two-component system where A increases B and B decreases A, creating oscillatory dynamics",
      "mechanism_type": "feedback_loop",
      "domain": "Complex Network Analysis Techniques",
      "embedding": null
    }
  ]
}