{
  "session": 52,
  "date": "2026-02-13",
  "total_candidates_reviewed": 40,
  "same_paper_duplicates": 1,
  "valid_candidates_reviewed": 39,
  "discoveries_found": 12,
  "precision": 0.3076923076923077,
  "rating_distribution": {
    "excellent": 2,
    "good": 10,
    "weak": 27
  },
  "discoveries": [
    {
      "candidate_rank": 2,
      "similarity": 0.6166113018989563,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe diverging relaxation times near criticality governed by universal scaling laws. Mech 1: Approaching bifurcation causes critical slowing with characteristic critical exponents controlling short-time and asymptotic behavior. Mech 2: Markov system with heterogeneity and asymmetry parameters creates critical locus where relaxation time diverges, with heterogeneity dominating dynamics near criticality. Structural isomorphism: proximity to critical point → slowed convergence → universal scaling behavior. Cross-domain: nonlinear dynamics ↔ statistical physics.",
      "paper_1_id": 917,
      "paper_1_domain": "nlin",
      "paper_1_title": "Critical Slowing Down at Bifurcations",
      "paper_1_mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes.",
      "paper_2_id": 153,
      "paper_2_domain": "physics",
      "paper_2_title": "Heterogeneity dominates irreversibility in random Markov models",
      "paper_2_mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts.",
      "structural_pattern": "Critical phase transitions exhibit universal slowing dynamics: approaching criticality → diverging relaxation times → characteristic scaling laws → qualitative regime change."
    },
    {
      "candidate_rank": 3,
      "similarity": 0.6001496911048889,
      "rating": "good",
      "rating_reasoning": "Both describe population-level strategy evolution through multiple interacting processes with stochastic effects. Mech 1: Three behavioral types (conformists/nonconformists/imitators) interact, with population size determining equilibration - finite populations show perpetual oscillations that vanish in large populations through stochastic averaging. Mech 2: Strategy distributions evolve via selection (performance-based survival), innovation (mutation), and perturbation (shocks), with two-layer adaptation (individual learning + population evolution) determining outcomes. Structural core: strategy distributions evolve through multi-mechanism dynamics where population size/structure and stochasticity jointly determine equilibrium behavior. Cross-domain: behavioral ecology ↔ evolutionary finance.",
      "paper_1_id": 457,
      "paper_1_domain": "q-bio",
      "paper_1_title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
      "paper_1_mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging.",
      "paper_2_id": 369,
      "paper_2_domain": "physics",
      "paper_2_title": "FinEvo: From Isolated Backtests to Ecological Market Games for Multi-Agent Financial Strategy Evolution",
      "paper_2_mechanism": "Strategy distributions evolve through selection (performance-based survival), innovation (mutation), and environmental perturbation (external shocks). Individual agents adapt using local signals while population composition shifts based on relative fitness. Two-layer adaptation - individual learning plus population-level evolution - determines whether strategies persist, collapse, or form coalitions.",
      "structural_pattern": "Population strategy evolution emerges from coupled processes (selection, innovation/imitation, stochastic effects) operating at individual and collective levels, with system size determining equilibration versus perpetual fluctuation."
    },
    {
      "candidate_rank": 5,
      "similarity": 0.5997282862663269,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe cooperation maintained through feedback between individual behavior and collective states. Mech 1: Reciprocal group dynamics and behavioral inertia drive cooperation levels - cooperation depends on observed group patterns rather than participant identity, creating stable cooperation through behavioral feedback operating identically across agent types. Mech 2: Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental feedback creates coupling: behavior → resources → payoffs → incentives → behavior. Reputation-based cooperation interacts with ecological constraints in a bidirectional loop. Structural isomorphism: cooperation emerges from feedback loop connecting individual actions to collective state to individual incentives. Cross-domain: economics (public goods) ↔ biology (indirect reciprocity).",
      "paper_1_id": 100,
      "paper_1_domain": "econ",
      "paper_1_title": "Human-AI Cooperation in Public Goods Game",
      "paper_1_mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback.",
      "paper_2_id": 461,
      "paper_2_domain": "q-bio",
      "paper_2_title": "Indirect Reciprocity with Environmental Feedback",
      "paper_2_mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation.",
      "structural_pattern": "Cooperation stability emerges from bidirectional feedback: individual behavior → collective state (group patterns/resource levels) → modified incentives/payoffs → reinforced cooperation. Feedback operates independently of agent identity or type."
    },
    {
      "candidate_rank": 7,
      "similarity": 0.5714245438575745,
      "rating": "good",
      "rating_reasoning": "Both describe how network topology creates systematic observation bias that drives strategic behavior toward distorted equilibria. Mech 1: Agents care about performance relative to network-connected peers, creating strategic interdependencies where network topology determines how competitive pressures propagate, affecting equilibrium prices through aggregated peer comparisons. Mech 2: Agents observe only network-local samples biased by position (algorithmic ranking, homophily), not global population. Locality parameter controls observation bias magnitude, creating distorted beliefs about opponent sophistication that drive strategic escalation beyond what accurate information would produce. Structural isomorphism: network position → biased information access (peer sample vs local sample) → distorted beliefs/incentives → altered strategic decisions. Cross-domain: economics (asset pricing) ↔ computer science (algorithmic game theory).",
      "paper_1_id": 199,
      "paper_1_domain": "econ",
      "paper_1_title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
      "paper_1_mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments.",
      "paper_2_id": 2170,
      "paper_2_domain": "cs",
      "paper_2_title": "The Architecture of Illusion: Network Opacity",
      "paper_2_mechanism": "Network-mediated observation bias creates systematic misperception in strategic reasoning. Agents observe only network-local sample biased by position (algorithmic ranking, homophily), not global population. Locality parameter controls observation bias magnitude, creating distorted beliefs about opponent sophistication that drive strategic escalation beyond what accurate global information would produce.",
      "structural_pattern": "Network structure mediates information access, creating systematic observation bias: network position → local/biased sample → misperception of global state → strategic decisions diverging from full-information equilibrium."
    },
    {
      "candidate_rank": 12,
      "similarity": 0.548354983329773,
      "rating": "excellent",
      "rating_reasoning": "Both mechanisms describe how heterogeneity creates dual, opposing effects on cooperation leading to complex stability landscapes. Mech 1: Free-rider problem in shared resources where cleaning costs and contamination risks create multi-stability and hysteresis - small parameter changes cause abrupt shifts between cooperation and free-riding equilibria. Cleaning cost primarily determines altruism stability. Mech 2: Cooperation and disease coevolve through network structure where heterogeneity has double-edged effects. Structural heterogeneity (high connectivity) creates leverage points - hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride as disease reservoirs, undermining cooperation. Influence asymmetry facilitates, motivation asymmetry degrades. Beautiful structural isomorphism: heterogeneity is simultaneously cooperation's catalyst (through leverage points/hubs) and inhibitor (through weakest links/low-cost agents), creating rich multi-stable dynamics with tipping points. Cross-domain: social dilemmas ↔ epidemiology.",
      "paper_1_id": 1973,
      "paper_1_domain": "q-bio",
      "paper_1_title": "Free-Rider Problem in Shared Resources",
      "paper_1_mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria.",
      "paper_2_id": 352,
      "paper_2_domain": "physics",
      "paper_2_title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
      "paper_2_mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it.",
      "structural_pattern": "Heterogeneity acts as double-edged sword in cooperation: structural/influence heterogeneity creates leverage points catalyzing cooperation (hubs/high-cost agents lead), while cost/motivation heterogeneity creates weakest links undermining cooperation (low-risk/low-cost agents free-ride), producing complex multi-stable dynamics with hysteresis and tipping points."
    },
    {
      "candidate_rank": 13,
      "similarity": 0.5468021035194397,
      "rating": "good",
      "rating_reasoning": "Both describe how network topology creates systematic information bias that shapes collective dynamics. Mech 1: Higher-order network structure (hypergraphs beyond pairwise links) shapes imitation dynamics through group-dependent adoption rates. Information diversity achieved through structured sampling from local neighborhoods. Adoption probability depends on group composition and size, not just neighbor count. Network hypergraph structure determines equilibrium strategy distributions through sampling bias. Mech 2: Network-mediated observation bias creates systematic misperception. Agents observe only network-local samples biased by position (algorithmic ranking, homophily), not global population. Locality parameter controls bias magnitude, creating distorted beliefs about opponent sophistication driving strategic escalation beyond what accurate global information would produce. Structural core: network topology → biased local sampling → distorted perception of global state → altered equilibrium behavior. Cross-domain: physics (imitation dynamics) ↔ computer science (algorithmic game theory).",
      "paper_1_id": 2044,
      "paper_1_domain": "physics",
      "paper_1_title": "Structure-aware imitation dynamics on higher-order networks",
      "paper_1_mechanism": "Higher-order network structure (beyond pairwise) shapes imitation dynamics through group-dependent adoption rates. Information diversity achieved through structured sampling from local neighborhoods. Adoption probability depends on group composition and size, not just neighbor count. Network hypergraph structure determines equilibrium strategy distributions through sampling bias.",
      "paper_2_id": 2170,
      "paper_2_domain": "cs",
      "paper_2_title": "The Architecture of Illusion: Network Opacity",
      "paper_2_mechanism": "Network-mediated observation bias creates systematic misperception in strategic reasoning. Agents observe only network-local sample biased by position (algorithmic ranking, homophily), not global population. Locality parameter controls observation bias magnitude, creating distorted beliefs about opponent sophistication that drive strategic escalation beyond what accurate global information would produce.",
      "structural_pattern": "Network topology constrains information access to biased local samples: network structure (hypergraph/position) → local sampling mechanism → systematically distorted beliefs about global state → equilibrium behavior differing from full-information baseline."
    },
    {
      "candidate_rank": 14,
      "similarity": 0.5442762970924377,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe cascade propagation through networks where topology and initial shock characteristics jointly determine damage extent. Mech 1: Token-mediated dependencies in DeFi create dense inter-component connections. Shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine extent and path of cascading failures across the system. Mech 2: Localized damage initiates at a seed node and propagates to neighbors. Structural position of seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties. Structural isomorphism: localized perturbation/damage → propagation through network links → topology-dependent cascade extent → system-wide outcome determined by network structure and shock epicenter. Cross-domain: decentralized finance ↔ network science (attack resilience).",
      "paper_1_id": 814,
      "paper_1_domain": "econ",
      "paper_1_title": "DeFi Credit Exposures and Contagion",
      "paper_1_mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system.",
      "paper_2_id": 1943,
      "paper_2_domain": "cs",
      "paper_2_title": "Seed Node Position and Network Damage",
      "paper_2_mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties.",
      "structural_pattern": "Network cascade propagation: localized shock/damage at seed → spread through network links → extent determined by network topology (connectivity, link weights) and seed position → system-wide outcome depends on structure-epicenter interaction, not just average properties."
    },
    {
      "candidate_rank": 16,
      "similarity": 0.5400546193122864,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe how ecological complexity (spatial heterogeneity or temporal chaos) enables species coexistence that would be unstable under simpler conditions. Mech 1: Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in fine-tuned marginal states, creating instability. Network topology encodes dispersal effectiveness. Mech 2: Species cross-feed through metabolite leakage creating coupled population-chemical dynamics. Network structure determines attractor types (fixed points to high-dimensional chaos). High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently. Structural core: complex dynamics (spatial heterogeneity/temporal chaos) prevent competitive exclusion by creating refuge mechanisms - heterogeneous spatial structure provides coexistence above threshold, chaotic temporal dynamics enable coexistence through quasi-stationary switching. Cross-domain: metacommunity ecology ↔ population dynamics.",
      "paper_1_id": 1970,
      "paper_1_domain": "q-bio",
      "paper_1_title": "Habitat Heterogeneity and Metacommunity Dynamics",
      "paper_1_mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel.",
      "paper_2_id": 168,
      "paper_2_domain": "physics",
      "paper_2_title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
      "paper_2_mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently.",
      "structural_pattern": "Complexity enables coexistence beyond competitive exclusion: spatial heterogeneity (above critical threshold) or temporal chaos (high-dimensional intermittent switching) create refuge mechanisms preventing winner-take-all outcomes that occur in simple homogeneous/stable systems."
    },
    {
      "candidate_rank": 17,
      "similarity": 0.5368678569793701,
      "rating": "excellent",
      "rating_reasoning": "Both mechanisms describe bidirectional feedback between network topology and node attributes, creating coevolutionary dynamics with emergent collective properties. Mech 1: Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback loop between individual cognitive structure and collective creative outcomes. Cognitive topology shapes collective creativity which reshapes individual cognition. Mech 2: Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback: opinion convergence ↔ network structure formation. Interaction function form determines emergent structures and stability. Gorgeous structural isomorphism: node attributes (semantic structure/opinions) ↔ network topology (idea exchange/edge weights) create coevolutionary feedback loop where individual-level states and network-level connectivity mutually reinforce, producing emergent collective phenomena. Cross-domain: cognitive networks (creativity) ↔ social networks (opinion dynamics). Beautiful match!",
      "paper_1_id": 644,
      "paper_1_domain": "cs",
      "paper_1_title": "Semantic Memory to Collective Creativity",
      "paper_1_mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes.",
      "paper_2_id": 354,
      "paper_2_domain": "physics",
      "paper_2_title": "Emergent structures in coupled opinion and network dynamics",
      "paper_2_mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability.",
      "structural_pattern": "Bidirectional coevolution between network structure and node states: node attributes (cognitive structure/opinions) shape interaction topology (idea exchange/connection strength) ↔ network topology shapes attribute dynamics (ideational stimulation/opinion influence) → emergent collective properties through coupled feedback loop."
    },
    {
      "candidate_rank": 35,
      "similarity": 0.509902834892273,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe critical phase transitions characterized by emergent slow collective modes that reorganize system dynamics qualitatively. Mech 1: As system approaches bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. System exhibits characteristic critical exponents governing short-time behavior, asymptotic decay, and crossover between regimes. Mech 2: Qualitative phase transition via spectral condensation at criticality. Progressive reentrant coupling drives system toward infrared critical regime where extensive band of slow collective modes emerges (spectral condensation), reorganizing dynamics qualitatively. Creates emergent capabilities absent at subcritical regime - transition in kind not degree, regardless of scale. Structural isomorphism: approaching criticality → emergence of slow modes (diverging relaxation time / spectral condensation) → qualitative reorganization of dynamics → universal scaling laws / emergent capabilities. Cross-domain: nonlinear dynamics (bifurcations) ↔ complex systems theory (phase transitions).",
      "paper_1_id": 917,
      "paper_1_domain": "nlin",
      "paper_1_title": "Critical Slowing Down at Bifurcations",
      "paper_1_mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes.",
      "paper_2_id": 2194,
      "paper_2_domain": "physics",
      "paper_2_title": "Emergence of Superintelligence from Critical Dynamics",
      "paper_2_mechanism": "Qualitative phase transition via spectral condensation at criticality. Progressive reentrant coupling drives system toward infrared critical regime where extensive band of slow collective modes emerges (spectral condensation), reorganizing dynamics qualitatively. Creates emergent capabilities absent at subcritical regime - transition in kind not degree, regardless of system scale.",
      "structural_pattern": "Critical phase transitions exhibit universal structure: approaching criticality → emergence of slow collective modes (relaxation time divergence / spectral condensation) → qualitative reorganization of dynamics → transition in kind characterized by scaling laws and emergent properties."
    },
    {
      "candidate_rank": 37,
      "similarity": 0.5077577829360962,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe coevolutionary dynamics where network position/topology and individual activity/attributes mutually shape each other through feedback. Mech 1: Agent's position in collaboration network determines productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but effect is asymmetric - reverse direction shows no detectable influence. Network position and productivity coevolve. Mech 2: Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. Feedback between opinion convergence and network structure formation. Interaction function determines emergent structures. Structural core: network position/topology ↔ node attributes/activity create coevolutionary feedback where structural position amplifies individual effects and individual states reshape network structure. Cross-domain: economics (collaboration networks) ↔ physics (opinion dynamics).",
      "paper_1_id": 87,
      "paper_1_domain": "econ",
      "paper_1_title": "Strategic Interactions in Science and Technology Networks",
      "paper_1_mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence.",
      "paper_2_id": 354,
      "paper_2_domain": "physics",
      "paper_2_title": "Emergent structures in coupled opinion and network dynamics",
      "paper_2_mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability.",
      "structural_pattern": "Network-attribute coevolution through bidirectional feedback: network position amplifies individual activity/output through complementarities ↔ individual states (productivity/opinions) reshape network structure (new connections/edge weights) → emergent collective dynamics."
    },
    {
      "candidate_rank": 38,
      "similarity": 0.5062606334686279,
      "rating": "good",
      "rating_reasoning": "Both mechanisms describe adoption/imitation dynamics shaped by network structure where local interactions and network topology jointly determine diffusion patterns. Mech 1: Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network structure mediates diffusion. Mech 2: Higher-order network structure (beyond pairwise) shapes imitation dynamics through group-dependent adoption rates. Information diversity achieved through structured sampling from local neighborhoods. Adoption probability depends on group composition and size, not just neighbor count. Network hypergraph structure determines equilibrium strategy distributions through sampling bias. Structural core: adoption/imitation spreads through network where local interaction structure (spatial proximity + network connections / hypergraph group composition) determines diffusion rate and equilibrium. Network topology shapes collective adoption dynamics through local interaction mechanisms. Cross-domain: economics (technology diffusion) ↔ physics (imitation dynamics).",
      "paper_1_id": 191,
      "paper_1_domain": "econ",
      "paper_1_title": "Technology Adoption and Network Externalities in Financial Systems",
      "paper_1_mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics.",
      "paper_2_id": 2044,
      "paper_2_domain": "physics",
      "paper_2_title": "Structure-aware imitation dynamics on higher-order networks",
      "paper_2_mechanism": "Higher-order network structure (beyond pairwise) shapes imitation dynamics through group-dependent adoption rates. Information diversity achieved through structured sampling from local neighborhoods. Adoption probability depends on group composition and size, not just neighbor count. Network hypergraph structure determines equilibrium strategy distributions through sampling bias.",
      "structural_pattern": "Network-mediated adoption dynamics: local interaction structure (spatial+network connections / hypergraph groups) → adoption pressure through neighbor states → cumulative diffusion along network paths → equilibrium adoption distribution shaped by network topology and local interaction rules."
    }
  ]
}