[
  {
    "candidate_rank": 1,
    "similarity": 0.7363924980163574,
    "rating": "excellent",
    "rating_reasoning": "Both mechanisms describe cell size homeostasis through multi-phase feedback control. Paper 1: sizer/timer/adder strategies with extrinsic (population-density) and intrinsic (cell-size-dependent) feedback creating trade-offs. Paper 2: size deviations create feedback to growth rate and cycle timing, reducing to stochastically forced harmonic oscillator in linear regime. Fundamentally the same structural pattern: multi-phase feedback control systems maintain homeostasis through coupled dynamics of state variables (size) and timing mechanisms (cell cycle phases), with noise integration affecting apparent control strategy.",
    "paper_1_id": 525,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "unknown",
    "paper_1_title": "Effects of multi-phase control mechanism on fibroblast dynamics",
    "paper_1_mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control.",
    "paper_2_id": 540,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "q-bio",
    "paper_2_title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
    "paper_2_mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration.",
    "structural_pattern": "Multi-phase feedback control creates homeostatic regulation through coupled dynamics of state variables and timing mechanisms, with trade-offs between extrinsic (population-level) and intrinsic (individual-level) control."
  },
  {
    "candidate_rank": 4,
    "similarity": 0.7064264416694641,
    "rating": "excellent",
    "rating_reasoning": "Both describe cell size homeostasis through control strategies that compensate for stochastic fluctuations, but in different organisms (fibroblasts vs bacteria). Paper 1: sizer/timer/adder strategies with extrinsic/intrinsic feedback trade-offs. Paper 2: size fluctuates due to noisy growth and division, homeostasis mechanisms compensate through size control strategies, population dynamics alter distributions through exponential growth effects, extrinsic noise and population structure jointly determine distributions. Same fundamental mechanism: size control strategies operate at individual level while population-level dynamics affect observed distributions. Multi-level feedback system spanning individual and population scales.",
    "paper_1_id": 525,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "unknown",
    "paper_1_title": "Effects of multi-phase control mechanism on fibroblast dynamics",
    "paper_1_mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control.",
    "paper_2_id": 530,
    "paper_2_arxiv": "2602.00044v1",
    "paper_2_domain": "q-bio",
    "paper_2_title": "Cell size control in bacteria",
    "paper_2_mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions.",
    "structural_pattern": "Size homeostasis emerges from control strategies that compensate for stochastic fluctuations through multi-level feedback spanning individual and population scales, with different measurement contexts revealing different aspects of the same underlying control system."
  },
  {
    "candidate_rank": 5,
    "similarity": 0.6691850423812866,
    "rating": "excellent",
    "rating_reasoning": "Both describe how network centrality determines productivity/innovation output through strategic complementarities. Paper 1: firms in collaboration networks - central firms access diverse knowledge from multiple partners, peripheral firms limited by fewer connections, successful innovators attract more partners (preferential attachment) reinforcing centrality advantage. Paper 2: Katz-Bonacich centrality captures complementarities, position determines productivity, scientific productivity enhances technological output asymmetrically. Same structural pattern: network position → access to complementary resources → enhanced output, with positive feedback creating self-reinforcing centrality advantage. Cross-domain match: economics (firm innovation) ↔ science networks.",
    "paper_1_id": 77,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "unknown",
    "paper_1_title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
    "paper_1_mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage.",
    "paper_2_id": 87,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "econ",
    "paper_2_title": "Strategic Interactions in Science and Technology Networks",
    "paper_2_mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence.",
    "structural_pattern": "Network centrality creates productivity advantage through complementarities and knowledge access from connected agents, with positive feedback (preferential attachment or success-breeds-success) reinforcing structural position over time."
  },
  {
    "candidate_rank": 10,
    "similarity": 0.6166112422943115,
    "rating": "good",
    "rating_reasoning": "Both describe critical dynamics near transition points where relaxation times diverge. Paper 1 (nlin): approaching bifurcations causes dramatic slowing of convergence, relaxation time diverges with universal scaling laws, critical exponents govern behavior. Paper 2 (physics): Markov dynamics with heterogeneity/asymmetry parameters, critical locus where relaxation times diverge, near criticality small heterogeneity changes cause large dynamical shifts. Same structure: near critical points, systems exhibit diverging timescales following universal scaling, creating dramatic sensitivity to parameter changes. Cross-domain: nonlinear dynamics ↔ statistical physics.",
    "paper_1_id": 917,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "nlin",
    "paper_1_title": "Critical Slowing Down at Bifurcations",
    "paper_1_mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes.",
    "paper_2_id": 153,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "physics",
    "paper_2_title": "Heterogeneity dominates irreversibility in random Markov models",
    "paper_2_mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts.",
    "structural_pattern": "Near critical points, relaxation times diverge following universal scaling laws, creating dramatic sensitivity where small parameter changes cause large dynamical shifts with characteristic critical exponents governing temporal behavior."
  },
  {
    "candidate_rank": 11,
    "similarity": 0.6001496911048889,
    "rating": "good",
    "rating_reasoning": "Both describe strategy evolution in populations with frequency-dependent dynamics. Paper 1 (q-bio): three behavioral types (conformists, nonconformists, imitators) interact, perpetual oscillations in small populations but stochastic averaging dampens fluctuations in large populations. Paper 2 (physics/finance): strategies evolve through selection (performance-based), innovation (mutation), environmental perturbation, with two-layer adaptation (individual learning + population evolution). Similar structure: competing strategies in populations evolve through selection and innovation, with population size and multi-scale dynamics affecting stability and persistence. Cross-domain: behavioral evolution ↔ financial markets.",
    "paper_1_id": 457,
    "paper_1_arxiv": "2602.01492v1",
    "paper_1_domain": "q-bio",
    "paper_1_title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
    "paper_1_mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging.",
    "paper_2_id": 369,
    "paper_2_arxiv": "2602.00948v1",
    "paper_2_domain": "physics",
    "paper_2_title": "FinEvo: From Isolated Backtests to Ecological Market Games for Multi-Agent Financial Strategy Evolution",
    "paper_2_mechanism": "Strategy distributions evolve through selection (performance-based survival), innovation (mutation), and environmental perturbation (external shocks). Individual agents adapt using local signals while population composition shifts based on relative fitness. Two-layer adaptation - individual learning plus population-level evolution - determines whether strategies persist, collapse, or form coalitions.",
    "structural_pattern": "Strategy distributions in populations evolve through selection (performance-based) and innovation, with multi-scale dynamics (individual adaptation + population-level evolution) and population size affecting whether systems exhibit perpetual oscillations or equilibration."
  },
  {
    "candidate_rank": 13,
    "similarity": 0.5997282862663269,
    "rating": "good",
    "rating_reasoning": "Both describe cooperation dynamics emerging from feedback between individual behaviors and collective conditions. Paper 1 (econ): reciprocal group dynamics and behavioral inertia drive cooperation, patterns depend on observed group behavior regardless of agent identity, normative mechanisms create stable cooperation through behavioral feedback. Paper 2 (q-bio): individual behaviors shape reputation (social norms) while affecting collective resource levels, environmental changes alter payoffs creating feedback between strategic behavior and resource dynamics. Similar structure: cooperation emerges from bi-directional feedback - behaviors affect collective state (norms or resources), collective state reshapes individual incentives. Cross-domain: behavioral economics ↔ evolutionary biology.",
    "paper_1_id": 100,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "econ",
    "paper_1_title": "Human-AI Cooperation in Public Goods Game",
    "paper_1_mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback.",
    "paper_2_id": 461,
    "paper_2_arxiv": "2602.03835v1",
    "paper_2_domain": "q-bio",
    "paper_2_title": "Indirect Reciprocity with Environmental Feedback",
    "paper_2_mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation.",
    "structural_pattern": "Cooperation emerges from bidirectional feedback between individual strategic behaviors and collective conditions: behaviors affect collective state (social norms or environmental resources), which then reshapes individual incentives and future behavior."
  },
  {
    "candidate_rank": 17,
    "similarity": 0.5687321424484253,
    "rating": "good",
    "rating_reasoning": "Both describe innovation output enhanced through network spillovers and strategic complementarities. Paper 1: firms in collaboration networks, central firms access diverse knowledge, network structure determines innovation capacity, preferential attachment. Paper 2: R&D spillovers from one entity enhance neighboring innovation, Stackelberg leader-follower dynamics reach Nash equilibrium, highly-qualified employment amplifies spillovers creating synergies. Similar structure: innovation depends on network position and spillover effects from connected entities, with complementarities and strategic interactions determining output. Cross-domain: firm collaboration networks ↔ regional innovation systems.",
    "paper_1_id": 77,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "unknown",
    "paper_1_title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
    "paper_1_mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage.",
    "paper_2_id": 953,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "econ",
    "paper_2_title": "R&D Spillovers and Regional Innovation",
    "paper_2_mechanism": "R&D spillovers from one entity enhance innovation in neighboring entities. Strategic interactions follow Stackelberg dynamics where leaders and followers reach Nash equilibrium. Highly-qualified employment amplifies spillover effects, creating synergies between different types of R&D investment and regional innovation output.",
    "structural_pattern": "Innovation output increases through network-mediated spillover effects and strategic complementarities, with entity position and connection quality amplifying knowledge transfer and creating synergistic enhancement."
  },
  {
    "candidate_rank": 21,
    "similarity": 0.548354983329773,
    "rating": "excellent",
    "rating_reasoning": "Both describe cooperation dilemmas where heterogeneity has double-edged effects - can facilitate OR undermine cooperation depending on the type of heterogeneity. Paper 1 (q-bio): free-rider problem with cleaning costs, contamination risk, social incentives, multi-stability and hysteresis between cooperation/free-riding equilibria. Paper 2 (physics): cooperation-epidemic coevolution on networks, structural heterogeneity creates leverage (hubs protect due to amplified risk), cost heterogeneity creates weakest links (low-risk free-ride as disease reservoirs). Excellent structural isomorphism: heterogeneity is double-edged sword - influence asymmetry facilitates, motivation asymmetry degrades. Cross-domain: shared resources ↔ epidemic control.",
    "paper_1_id": 1973,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "q-bio",
    "paper_1_title": "Free-Rider Problem in Shared Resources",
    "paper_1_mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria.",
    "paper_2_id": 352,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "physics",
    "paper_2_title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
    "paper_2_mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it.",
    "structural_pattern": "Heterogeneity in cooperation dilemmas is fundamentally double-edged: structural heterogeneity (influence asymmetry) creates leverage points that facilitate cooperation, while cost heterogeneity (motivation asymmetry) creates weakest links that enable free-riding and undermine cooperation, with system exhibiting multi-stability."
  },
  {
    "candidate_rank": 22,
    "similarity": 0.5442762970924377,
    "rating": "good",
    "rating_reasoning": "Both describe cascade propagation through networks where structural position determines amplification or dampening. Paper 1 (econ): DeFi contagion through token-mediated dependencies, shock propagates through dependency links, network topology and link weights determine cascading failure extent. Paper 2 (cs): network damage initiates at seed node and propagates to neighbors, seed node's structural position (local connectivity and topology) amplifies or dampens damage, cumulative link severing depends on seed characteristics not average properties. Similar structure: initial perturbation + network propagation rules + structural position determines cascade extent. Cross-domain: financial contagion ↔ network damage.",
    "paper_1_id": 814,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "econ",
    "paper_1_title": "DeFi Credit Exposures and Contagion",
    "paper_1_mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system.",
    "paper_2_id": 1943,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "cs",
    "paper_2_title": "Seed Node Position and Network Damage",
    "paper_2_mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties.",
    "structural_pattern": "Cascade propagation through networks depends critically on initiating node's structural position and network topology: local connectivity and link weights determine whether perturbations amplify (cascading failures) or dampen (contained damage), with outcomes governed by structural properties not average statistics."
  },
  {
    "candidate_rank": 24,
    "similarity": 0.5400546193122864,
    "rating": "good",
    "rating_reasoning": "Both describe how spatial/network structure enables species coexistence beyond simple competitive exclusion predictions. Paper 1 (q-bio): spatial structure and dispersal networks determine persistence, heterogeneous habitats support coexistence above critical threshold, homogeneous environments create instability, topology encodes dispersal effectiveness. Paper 2 (physics): cross-feeding network structure determines dynamics, high-dimensional chaos enables coexistence beyond competitive exclusion through intermittent switching among quasi-stationary states. Similar structure: network/spatial topology enables coexistence through mechanisms that transcend mean-field predictions, but through different pathways (heterogeneity threshold vs chaotic switching). Cross-domain: metacommunity ecology ↔ microbial ecosystems.",
    "paper_1_id": 1970,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "q-bio",
    "paper_1_title": "Habitat Heterogeneity and Metacommunity Dynamics",
    "paper_1_mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel.",
    "paper_2_id": 168,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "physics",
    "paper_2_title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
    "paper_2_mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently.",
    "structural_pattern": "Network or spatial structure enables species coexistence beyond competitive exclusion limits through topology-dependent mechanisms: heterogeneity thresholds, dispersal kernels, or high-dimensional chaotic switching, with outcomes transcending mean-field predictions."
  },
  {
    "candidate_rank": 25,
    "similarity": 0.5368678569793701,
    "rating": "excellent",
    "rating_reasoning": "Both describe coevolution between attributes (ideas/opinions) and network structure through bidirectional feedback. Paper 1 (cs): individual semantic network topology determines ideational breadth, agents exchange ideation traces, lower initial overlap predicts larger stimulation gains, shared sources create network redundancy, feedback between cognitive structure and collective outcomes. Paper 2 (physics): opinions and edge weights coevolve, interaction strength depends on opinion distance, similar opinions strengthen connections, connection strength amplifies opinion influence, feedback creates emergent structures. Excellent structural isomorphism: attributes affect connection formation, connections affect attribute dynamics, creating coupled coevolution. Cross-domain: collective creativity ↔ social dynamics.",
    "paper_1_id": 644,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "cs",
    "paper_1_title": "Semantic Memory to Collective Creativity",
    "paper_1_mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes.",
    "paper_2_id": 354,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "physics",
    "paper_2_title": "Emergent structures in coupled opinion and network dynamics",
    "paper_2_mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability.",
    "structural_pattern": "Attributes (ideas/opinions) and network structure coevolve through bidirectional feedback: attribute similarity affects connection strength (assortative linking), connection strength affects attribute dynamics (influence propagation), creating coupled coevolution with emergent collective structures."
  },
  {
    "candidate_rank": 9,
    "similarity": 0.6278334856033325,
    "rating": "good",
    "rating_reasoning": "Both describe cell size regulation but through different mechanisms. Paper 1: multi-phase control mechanisms (sizer/timer/adder) with extrinsic/intrinsic feedback trade-offs. Paper 2: proliferation generates area variability while mechanical forces regulate packing, division creates asymmetry, mechanical constraints limit expansion, area polydispersity from balance between proliferation-driven variability and mechanical relaxation. Related but not identical - Paper 1 focuses on control strategies across cell cycle, Paper 2 on interplay between proliferation-driven variability and mechanical constraints. Both about balancing processes maintaining size distributions, but through different regulatory modes.",
    "paper_1_id": 525,
    "paper_1_arxiv": "N/A",
    "paper_1_domain": "unknown",
    "paper_1_title": "Effects of multi-phase control mechanism on fibroblast dynamics",
    "paper_1_mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control.",
    "paper_2_id": 528,
    "paper_2_arxiv": "N/A",
    "paper_2_domain": "q-bio",
    "paper_2_title": "Cell proliferation maintains cell area polydispersity in the growing fruit fly wing epithelium",
    "paper_2_mechanism": "Cell proliferation generates area variability while mechanical forces regulate packing. Cell division creates size asymmetry between daughter cells. Mechanical constraints from neighbors limit expansion. Area polydispersity emerges from balance between proliferation-driven variability and mechanical relaxation. Cell-cell adhesion and cortical tension determine equilibrium distributions.",
    "structural_pattern": "Cell size distributions emerge from balance between proliferation processes (generating variability through division) and regulatory constraints (feedback control or mechanical forces), with equilibrium determined by opposing tendencies."
  }
]
