[
  {
    "paper_id": 638,
    "domain": "cs",
    "title": "Toward Effective Multimodal Graph Foundation Model",
    "mechanism": "Multi-granular problem decomposition with specialized operations at each scale. System separates concerns across hierarchical levels (local vs global), applying distinct transformations at each granularity (embedding-level interaction, node-level alignment), then combining results to bridge semantic gaps across modalities or domains."
  },
  {
    "paper_id": 872,
    "domain": "q-fin",
    "title": "History Is Not Enough: Adaptive Dataflow System",
    "mechanism": "Adaptive control loop for data curation under distribution shift. System couples data manipulation module with performance monitor, using gradient-based optimization to continuously adjust curation parameters based on downstream task performance, creating feedback between model outcomes and data generation strategy."
  },
  {
    "paper_id": 941,
    "domain": "q-bio",
    "title": "PLANET v2.0: Protein-Ligand Affinity Prediction",
    "mechanism": "Probabilistic ensemble prediction via mixture density modeling. Instead of predicting single-point outcomes, model represents full probability distribution over possible configurations (contact maps, interaction geometries), then aggregates via mathematical expectation to produce robust predictions that account for uncertainty in binding modes."
  },
  {
    "paper_id": 997,
    "domain": "cs",
    "title": "On Dual Connectivity in 6G Leo Constellations",
    "mechanism": "Multi-path redundancy management under asymmetric channel properties. System maintains multiple communication paths with heterogeneous characteristics (delay, reliability, loss rates), dynamically switching between duplication, switching, or coding strategies to balance resource efficiency against reliability based on path diversity."
  },
  {
    "paper_id": 1353,
    "domain": "cs",
    "title": "Restoring Sparsity in Potts Machines",
    "mechanism": "Mean-field approximation to reduce coupling density. System replaces dense pairwise constraint interactions with dynamically updated single-node bias terms (mean fields), trading exact global coordination for approximate local summaries that maintain solution quality while dramatically reducing graph density and enabling hardware scalability."
  },
  {
    "paper_id": 1540,
    "domain": "stat",
    "title": "Optimal Learning-Rate Schedules under Functional Scaling Laws",
    "mechanism": "Phase transition in optimal strategy based on task difficulty regime. System exhibits qualitatively different behaviors (power decay vs warmup-stable-decay) separated by sharp threshold determined by ratio of signal learning rate to noise forgetting capacity. Easy-task regime benefits from gradual decay, hard-task regime requires maintaining peak resources until near completion."
  },
  {
    "paper_id": 1565,
    "domain": "cs",
    "title": "AEGPO: Adaptive Entropy-Guided Policy Optimization",
    "mechanism": "Dual-signal adaptive resource allocation using entropy as proxy for learning value. Global level: relative entropy change identifies high-value samples for prioritized exploration. Local level: absolute entropy peaks identify critical moments within each trajectory. Concentrates computation where information gain is highest rather than uniform distribution."
  },
  {
    "paper_id": 1629,
    "domain": "math",
    "title": "Optimal Control for Epidemic with Predator-Prey Dynamics",
    "mechanism": "Coupled multi-timescale dynamics with threshold-based control transition. Fast epidemiological process coupled to slow ecological oscillation, where amplitude of slow cycle determines disease persistence via threshold (ecological reproduction number). Natural control sufficient above threshold; below threshold requires engineered intervention to navigate both timescales simultaneously."
  },
  {
    "paper_id": 1744,
    "domain": "cs",
    "title": "Improve LLM Systems with User Logs",
    "mechanism": "Cognitive gap-guided integration of noisy real-world feedback. System quantifies disparity between model's prior knowledge and authentic user data, uses gap assessment to adaptively filter noise and construct separate processing pathways for different experience types (primary vs reflective), enabling selective knowledge integration while avoiding corruption."
  },
  {
    "paper_id": 1985,
    "domain": "cs",
    "title": "Convex Hull 3D Filtering with GPU Ray Tracing",
    "mechanism": "Coarse-to-fine preprocessing strategy via approximate delimiter construction. System builds rough boundary (Manhattan polyhedron) using massively parallel computation to rapidly discard irrelevant elements, then applies exact algorithm to reduced set, trading small upfront cost for large reduction in downstream complexity and energy consumption."
  },
  {
    "paper_id": 2068,
    "domain": "q-bio",
    "title": "Impulsive Release for Wolbachia Mosquitoes",
    "mechanism": "Impulsive periodic intervention under environmental stress. System alternates between autonomous dynamics and discrete intervention events (periodic releases), with environmental perturbations (temperature stress) potentially reversing intervention effects. Success threshold depends on balancing intervention frequency, stress magnitude, and fitness costs to maintain desired state despite continuous environmental pressure."
  },
  {
    "paper_id": 32,
    "domain": "cs",
    "title": "Learning to Share: Selective Memory for Parallel Agents",
    "mechanism": "Learned selective information sharing across parallel exploration processes. Multiple independent teams explore different solution trajectories with learned controller deciding which intermediate results to place in globally-accessible shared memory. Balances exploration diversity (parallel independence) against computational efficiency (reuse of overlapping sub-solutions), using stepwise credit assignment to identify globally useful information."
  },
  {
    "paper_id": 125,
    "domain": "q-bio",
    "title": "GP-DHT: Cross-Species GRN Inference",
    "mechanism": "Dual-scope representation learning with contrastive regularization under distribution shift. System captures both local pairwise regulatory logic and global cross-context expression patterns via dual-head architecture. Contrastive learning enforces structural constraints in representation space, providing robustness against noise, sparsity, and cross-domain distributional shifts beyond what supervised signal alone provides."
  },
  {
    "paper_id": 175,
    "domain": "physics",
    "title": "Imperfect Turing Patterns via Diffusiophoresis",
    "mechanism": "Multi-scale pattern formation via coupled reaction-diffusion and particle assembly. Classical Turing mechanism (single length scale from reaction-diffusion balance) coupled to finite-size particle assembly driven by background chemical gradient (diffusiophoresis) plus particle-particle interactions. Introduces additional control parameters (particle size, Péclet number, interaction strength) creating imperfections, grain textures, and multi-scale structures."
  },
  {
    "paper_id": 321,
    "domain": "cs",
    "title": "RRAttention: Dynamic Block Sparse Attention",
    "mechanism": "Distributed sampling via coordinated round-robin rotation for global coverage. Multiple parallel processing heads each sample different query subset, with sampling positions rotated across heads (round-robin) to ensure comprehensive coverage while maintaining query independence. Aggregate findings at stride level to reconstruct global pattern from distributed local samples, reducing complexity while preserving awareness."
  },
  {
    "paper_id": 323,
    "domain": "cs",
    "title": "OdysseyArena: Long-Horizon Inductive Interactions",
    "mechanism": "Inductive rule discovery from interaction experience vs deductive execution from explicit rules. Agent must autonomously infer latent transition dynamics through long-horizon active exploration rather than following pre-specified environmental laws. Requires building internal model of state evolution from observed trajectories, enabling strategic foresight and coherent planning over extended interaction sequences."
  },
  {
    "paper_id": 376,
    "domain": "q-bio",
    "title": "GPCR-Ligand Simulation via Residual Isometric Flow",
    "mechanism": "Residual dynamics modeling via decoupling static topology from temporal fluctuations. System learns isometric latent representation preserving geometric constraints (static topology), then models temporal evolution via relative displacements anchored to initial structure rather than absolute coordinates. Separates invariant structural relationships from dynamic conformational changes, improving computational efficiency while maintaining physical fidelity."
  },
  {
    "paper_id": 422,
    "domain": "cs",
    "title": "Energy-Efficient Neuromorphic Computing for Edge AI",
    "mechanism": "Adaptive threshold modulation based on input statistics for energy-performance trade-off. System dynamically adjusts neuron excitability thresholds based on input distribution characteristics, reducing event activity (spike rate, energy consumption) while preserving task accuracy. Combined with hardware-aware co-optimization jointly optimizing network architecture and physical resource allocation for target platform constraints."
  },
  {
    "paper_id": 469,
    "domain": "physics",
    "title": "Extended Boltzmann Theory Non-Equilibrium Relaxation",
    "mechanism": "Multi-mode coupled non-equilibrium relaxation with cross-mode energy exchange. System tracks multiple energy pools (translational, rotational degrees of freedom) with distinct temperatures evolving through collision-mediated energy transfer. Relaxation dynamics exhibit mode coupling where heat flux interactions between pools affect global equilibration rates, creating thermal conductivity dependence on degree of inter-mode non-equilibrium."
  },
  {
    "paper_id": 674,
    "domain": "cs",
    "title": "Agent2Agent Threats in Safety-Critical Assistants",
    "mechanism": "Formal separation of protected assets from attack propagation paths in security modeling. Framework decouples 'what to protect' (asset taxonomy via victim-centric harm modeling) from 'how attacks propagate' (graph-based path analysis distinguishing poison paths for data contamination vs trigger paths for activation). Enables systematic multi-stage threat discovery via bi-level search over separated concern spaces."
  },
  {
    "paper_id": 1008,
    "domain": "cs",
    "title": "TKG-Thinker: Temporal Knowledge Graph Reasoning",
    "mechanism": "Dual-stage learning: supervised bootstrapping followed by reinforcement-based policy refinement. First stage (supervised fine-tuning) instills core planning capabilities via demonstration data (chain-of-thought). Second stage (reinforcement learning) refines decision policies through dynamic environment interaction using multi-dimensional rewards, enabling autonomous adaptation to complex temporal constraints beyond static supervision coverage."
  },
  {
    "paper_id": 1098,
    "domain": "cs",
    "title": "Large-Scale Channel Sounding for 6G",
    "mechanism": "Sparse non-uniform sampling with likelihood-based reconstruction. System uses sparse irregular sampling pattern (avoiding dense uniform grid that requires prohibitive measurement count), then reconstructs full channel information via likelihood-rectified multipath component extraction. Trades direct measurement completeness for computational inference, dramatically reducing measurement overhead while maintaining characterization fidelity."
  },
  {
    "paper_id": 1138,
    "domain": "cs",
    "title": "Mitigating GIL Bottlenecks in Edge AI",
    "mechanism": "Saturation cliff in parallel resource provisioning under serialization constraint. System exhibits non-monotonic performance curve: increasing thread count initially improves throughput (I/O latency masking), but beyond critical threshold causes sharp degradation (≥20%) due to global interpreter lock serialization. Requires adaptive profiling to identify optimal operating point balancing latency hiding against coordination overhead."
  },
  {
    "paper_id": 1375,
    "domain": "cs",
    "title": "ROMAN: Autonomous Driving System Testing",
    "mechanism": "Reward-orchestrated multi-head attention for high-risk scenario generation. Multiple attention heads each explore different dimension of scenario space (traffic law compliance, environmental complexity, safety risk), with reward function orchestrating attention allocation to prioritize generation of rare critical edge cases that expose system vulnerabilities rather than common benign scenarios."
  },
  {
    "paper_id": 1401,
    "domain": "cs",
    "title": "Constrained Dynamic Gaussian Splatting",
    "mechanism": "Budget-constrained continuous optimization vs heuristic discrete pruning. Formulates resource allocation as continuous optimization problem with explicit budget constraint (Lagrangian formulation), enabling principled quality-resource trade-offs. Contrasts with heuristic pruning (discrete add/remove decisions) that struggles to find optimal allocation under hard limits, achieving better quality at same memory budget."
  },
  {
    "paper_id": 1417,
    "domain": "cs",
    "title": "TinyGuard: Lightweight Byzantine Defense",
    "mechanism": "Compact statistical fingerprinting for computational efficiency in anomaly detection. Instead of full-dimensional gradient comparisons (O(d) complexity in high-dimensional parameter space), extract low-dimensional statistical summaries (fingerprints) capturing essential distributional characteristics. Enables lightweight anomaly detection via compact signature comparison rather than raw data comparison, dramatically reducing overhead while maintaining Byzantine robustness."
  },
  {
    "paper_id": 2105,
    "domain": "cs",
    "title": "Hybrid RAI for SLA Compliance in 6G",
    "mechanism": "Responsibility gap closure via embedded auditability in distributed autonomous control. Closed-loop multi-vendor AI orchestration creates causal attribution problem (which agent caused SLA violation?). Framework embeds fairness, robustness, and auditability constraints directly into control loop via responsible AI games integrated with stochastic optimization, enabling traceable causal attribution in distributed decision-making."
  },
  {
    "paper_id": 2139,
    "domain": "q-bio",
    "title": "AbFlow: End-to-end Antibody Design",
    "mechanism": "End-to-end generative design with multi-scale geometric guidance via optimal transport. Flow-matching framework generates full-atom structures while simultaneously exploiting antigen-specific surface geometry to jointly optimize local binding interface and global structural integrity. Surface-enhanced equivariant network propagates geometric constraints from binding site across scales."
  },
  {
    "paper_id": 2170,
    "domain": "cs",
    "title": "The Architecture of Illusion: Network Opacity",
    "mechanism": "Network-mediated observation bias creates systematic misperception in strategic reasoning. Agents observe only network-local sample biased by position (algorithmic ranking, homophily), not global population. Locality parameter controls observation bias magnitude, creating distorted beliefs about opponent sophistication that drive strategic escalation beyond what accurate global information would produce."
  },
  {
    "paper_id": 2194,
    "domain": "physics",
    "title": "Emergence of Superintelligence from Critical Dynamics",
    "mechanism": "Qualitative phase transition via spectral condensation at criticality. Progressive reentrant coupling drives system toward infrared critical regime where extensive band of slow collective modes emerges (spectral condensation), reorganizing dynamics qualitatively. Creates emergent capabilities absent at subcritical regime - transition in kind not degree, regardless of system scale."
  }
]