[
  {
    "paper_id": 1972,
    "arxiv_id": "2602.06200v1",
    "domain": "q-bio",
    "title": "Threshold Resource Redistribution in Spatially-Structured Kinship Networks",
    "mechanism_description": "Threshold-based resource redistribution creates feedback between network structure and resource allocation ability. Agents below threshold solicit help; helpers contribute fractionally based on relatedness. Higher local density and relational closeness emerge as redistribution-dependent survival creates centralized clusters through cooperative resource sharing."
  },
  {
    "paper_id": 363,
    "arxiv_id": "2602.01902v1",
    "domain": "physics",
    "title": "Effect of higher-order interactions on noisy majority-rule dynamics with random group sizes",
    "mechanism_description": "Variable group sizes in majority-rule dynamics create heterogeneous influence through effective majority leverage. Rare large-group events can realign substantial population fractions. Critical threshold for independence depends on group-size distribution - heavy-tailed distributions enhance robustness to disorder through occasional macroscopic coordination events."
  },
  {
    "paper_id": 369,
    "arxiv_id": "2602.00948v1",
    "domain": "physics",
    "title": "FinEvo: From Isolated Backtests to Ecological Market Games for Multi-Agent Financial Strategy Evolution",
    "mechanism_description": "Strategy distributions evolve through selection (performance-based survival), innovation (mutation), and environmental perturbation (external shocks). Individual agents adapt using local signals while population composition shifts based on relative fitness. Two-layer adaptation - individual learning plus population-level evolution - determines whether strategies persist, collapse, or form coalitions."
  },
  {
    "paper_id": 448,
    "arxiv_id": "2602.05583v1",
    "domain": "q-bio",
    "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns in semiarid ecosystems",
    "mechanism_description": "Intermittent resource pulses interact with positive density dependence (Allee effects) to generate irregular spatial clusters. During favorable pulses, local facilitation enables patch expansion; during scarcity, neighborhood density determines survival. Resilience emerges from spatial covariance and local density rather than total biomass."
  },
  {
    "paper_id": 495,
    "arxiv_id": "2602.05476v1",
    "domain": "cs",
    "title": "Tight FPT Approximations for Fair k-center with Outliers",
    "mechanism_description": "Iterative ball-finding with structural trichotomy decomposes fairness-constrained clustering into cases based on representation balance. Identify feasible balls satisfying group constraints while discarding outliers. Trichotomy (balanced, skewed-correctable, impossible) guides solution construction without projection, enabling approximation through case-by-case handling."
  },
  {
    "paper_id": 644,
    "arxiv_id": "2602.03068v1",
    "domain": "cs",
    "title": "From semantic memory to collective creativity: A generative cognitive foundation for social creativity models",
    "mechanism_description": "Semantic network topology determines ideational breadth - low modularity yields broader exploration. When agents exchange ideation traces, lower pre-interaction overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy as convergent semantic neighborhoods limit diversity of generated ideas."
  },
  {
    "paper_id": 799,
    "arxiv_id": "2511.23344v1",
    "domain": "q-bio",
    "title": "A theory for coexistence and selection of branched actin networks in a shared and finite pool of monomers",
    "mechanism_description": "Local monomer depletion from network growth creates negative feedback between network density and growth rate. Higher density causes faster monomer consumption and slower growth. Multiple networks sharing finite monomer pool reach steady states through self-regulation. Under strong competition, coexistence transitions to selection."
  },
  {
    "paper_id": 862,
    "arxiv_id": "2601.20452v1",
    "domain": "q-fin",
    "title": "Manipulation in Prediction Markets: An Agent-based Modeling Experiment",
    "mechanism_description": "High-budget agents (whales) shift market prices proportionally to their capital share. Distortion duration depends on non-whale learning rates and herding intensity. Fast learners correct distortions quickly; herding amplifies and prolongs whale influence as coordinated followers reinforce biased prices even when informed traders exit."
  },
  {
    "paper_id": 895,
    "arxiv_id": "2602.04550v1",
    "domain": "math",
    "title": "Locally Gentle State Certification for High Dimensional Quantum Systems",
    "mechanism_description": "Measurement gentleness constraint (α-bounded state perturbation) imposes information extraction penalty. Sample complexity scales as d/α² - the trade-off between disturbance and information parallels privacy mechanisms. Gentler measurements require more samples but preserve quantum state for reuse, creating fundamental efficiency-preservation trade-off."
  },
  {
    "paper_id": 1028,
    "arxiv_id": "2601.22978v1",
    "domain": "cs",
    "title": "SpecIBT: Formally Verified Protection Against Speculative Control-Flow Hijacking",
    "mechanism_description": "Combining hardware control-flow integrity with speculative load hardening creates conditional protection. BTB misspeculation detection sets misspeculation flag, triggering selective hardening only on mispredicted paths. Security cost activates only during attacks, not during normal execution - detection enables targeted rather than blanket protection."
  },
  {
    "paper_id": 1056,
    "arxiv_id": "2602.03225v1",
    "domain": "physics",
    "title": "Tuning interactions between static-field-shielded polar molecules with microwaves",
    "mechanism_description": "Microwave field modulates interaction potential of field-shielded molecules. S-wave scattering length tunable by microwave parameters while maintaining loss suppression. External field provides dynamic control over effective interactions without changing fundamental molecular properties - field-dressed states have tunable characteristics."
  },
  {
    "paper_id": 1061,
    "arxiv_id": "2602.01406v1",
    "domain": "physics",
    "title": "Phase Dynamics of Self-Accelerating Bose-Einstein Condensates",
    "mechanism_description": "Self-accelerating matter waves exhibit cubic phase evolution. Weak mean-field nonlinearities cause linear response in cubic coefficient - interaction strength directly modulates phase curvature. Phase extraction from interference patterns reveals nonlinearity effects through systematic windowed polynomial fitting accounting for window correlations."
  },
  {
    "paper_id": 1083,
    "arxiv_id": "2602.00075v1",
    "domain": "cs",
    "title": "Dimensional Peeking for Low-Variance Gradients in Zeroth-Order Discrete Optimization via Simulation",
    "mechanism_description": "Lift sampling granularity from scalar perturbations to equivalence classes (control-flow paths). Multiple parameter values following same code path share gradient information, reducing variance without introducing bias. Information-per-simulation increases by reusing structural similarities in discrete optimization landscape."
  },
  {
    "paper_id": 1107,
    "arxiv_id": "2602.03288v1",
    "domain": "cs",
    "title": "An Algorithm for Monitoring Edge-geodetic Sets in Chordal Graphs",
    "mechanism_description": "Minimal monitoring sets (vertices detecting edge failures through distance changes) have structural uniqueness in certain graph classes. Chordal graphs admit unique minimal meg-set due to structural constraints on shortest paths. Graph geometry determines single optimal monitoring configuration without algorithmic search."
  },
  {
    "paper_id": 356,
    "arxiv_id": "2602.03654v1",
    "domain": "physics",
    "title": "Noisy nonlocal aggregation model with gradient flow structures",
    "mechanism_description": "Stochastic perturbations in nonlocal aggregation systems create gradient-flow structure in Wasserstein space. Noise regulates density and prevents singular concentration through equilibrium states from constrained energy minimization. Stable energy minimizers emerge from interplay between potential-driven interactions and environmental variability."
  },
  {
    "paper_id": 403,
    "arxiv_id": "2602.03455v1",
    "domain": "cs",
    "title": "Game-Theoretic and Algorithmic Analyses of Multi-Agent Routing under Crossing Costs",
    "mechanism_description": "Crossing cost (product of opposing-direction agent counts) quantifies conflict risk in asynchronous multi-agent routing. Pure Nash equilibria exist when agents minimize individual crossing exposure. Equilibrium emergence dynamics depend on network structure - general case is PLS-complete, but polynomial-time solvable under mild structural conditions."
  },
  {
    "paper_id": 450,
    "arxiv_id": "2602.05118v1",
    "domain": "q-bio",
    "title": "Combination therapy for colorectal cancer with anti-PD-L1 and cancer vaccine: A multiscale mathematical model of tumor-immune interactions",
    "mechanism_description": "Multiple low-dose anti-PD-L1 reduces advanced tumor burden better than single high dose, while cancer vaccines show opposite pattern (maximum dose superior). Cytotoxic T-cell to regulatory T-cell ratio serves as robust pre-treatment biomarker. Different dose-response curves across therapies reflect distinct mechanisms of immune modulation."
  },
  {
    "paper_id": 454,
    "arxiv_id": "2602.04150v1",
    "domain": "q-bio",
    "title": "A brief review of evolutionary game dynamics in the reinforcement learning paradigm",
    "mechanism_description": "Reinforcement learning paradigm differs from imitation learning by enabling introspective strategy refinement through trial-and-error rather than copying successful neighbors. Individuals learn from environmental feedback and adapt based on personal experience. This resolves discrepancies between theoretical predictions and behavioral experiments in cooperation, trust, and fairness."
  },
  {
    "paper_id": 460,
    "arxiv_id": "2601.22918v1",
    "domain": "q-bio",
    "title": "Microbiome association diversity reflects proximity to the edge of instability",
    "mechanism_description": "Microbial communities operate near edge of instability - transition from stable fixed-point to chaos controlled by network sparsity and interaction heterogeneity. Effective stability parameter inferred from pairwise covariance distribution width. Healthy gut microbiomes cluster near instability edge with broader associations; dysbiosis shifts toward stable regimes with narrower association distributions."
  },
  {
    "paper_id": 635,
    "arxiv_id": "2602.05087v1",
    "domain": "cs",
    "title": "Autodiscover: A reinforcement learning recommendation system for the cold-start imbalance challenge in active learning",
    "mechanism_description": "Discounted Thompson Sampling dynamically manages portfolio of query strategies in active learning. Agent balances exploration-exploitation under non-stationary review dynamics where strategy utility changes over time. Graph-aware attention learns relational structure while agent adapts strategy selection, mitigating cold-start failures through bootstrapping discovery from minimal labels."
  },
  {
    "paper_id": 672,
    "arxiv_id": "2602.03955v1",
    "domain": "cs",
    "title": "AgentArk: Distilling Multi-Agent Intelligence into a Single LLM Agent",
    "mechanism_description": "Multi-agent iterative debate dynamics distilled into single model weights transforms explicit test-time interactions into implicit capabilities. Hierarchical distillation strategies shift computational burden from inference to training. Distilled models preserve multi-agent reasoning and self-correction while maintaining single-agent efficiency and demonstrating enhanced robustness across tasks."
  },
  {
    "paper_id": 823,
    "arxiv_id": "2602.00775v1",
    "domain": "econ",
    "title": "Stable Time Series Prediction of Enterprise Carbon Emissions Based on Causal Inference",
    "mechanism_description": "Causal stable features (robust to external perturbations, stable long-term effects) extracted from multi-environment samples across policies and regions. Risk consistency constraints identify invariant causal relationships unaffected by distribution shifts. Adaptive normalization and sample reweighting dynamically correct temporal non-stationarity from economic fluctuations and policy transitions."
  },
  {
    "paper_id": 922,
    "arxiv_id": "2602.01234v1",
    "domain": "nlin",
    "title": "Controlling extreme events in neuronal networks: A single driving signal approach",
    "mechanism_description": "Single driving signal targeting one network node suppresses extreme events network-wide through dominance mechanism. Suppression occurs via frequency decoupling - driven neuron breaks from collective proto-event frequency dynamics, disrupting synchronized extreme event generation. Larger driven subpopulation enables earlier control onset, showing scaling advantage."
  },
  {
    "paper_id": 1096,
    "arxiv_id": "2602.05463v1",
    "domain": "cs",
    "title": "Thermodynamic Limits of Physical Intelligence",
    "mechanism_description": "Local monomer depletion creates negative feedback between network density and growth. Epiplexity (structural information encoding) and empowerment (control capacity) provide recognition vs. control axes for physical intelligence. Landauer-scale closed-cycle benchmarks require explicit boundary-closure and reset assumptions - without charging for external low-entropy resources, information gain and dissipation decouple."
  },
  {
    "paper_id": 10,
    "arxiv_id": "2602.00039v1",
    "domain": "physics",
    "title": "Compressing Complexity: Dimensionality Reduction in Dynamical Networks",
    "mechanism_description": "Three reduction paradigms form Pareto frontier between computational tractability and physical fidelity: structural coarse-graining (spectral/topological contraction), analytical reduction (moment closures preserving mechanisms), and data-driven reduction (manifold learning prioritizing prediction). Selection governed by no-free-lunch theorem - epistemological trade-off between causal mechanism preservation versus predictive power."
  },
  {
    "paper_id": 24,
    "arxiv_id": "2602.06008v1",
    "domain": "cs",
    "title": "AgenticPay: Multi-Agent LLM Negotiation for Transactions",
    "mechanism_description": "Language-mediated economic negotiation among agents with private valuations and constraints. Multi-round linguistic negotiation replaces numeric bidding. Agreement emergence depends on strategic reasoning capability and constraint satisfaction through natural language. Performance gaps reveal challenges in long-horizon strategic planning distinct from immediate utility maximization."
  },
  {
    "paper_id": 30,
    "arxiv_id": "2602.05970v1",
    "domain": "cs",
    "title": "Inverse Depth Scaling From Most Layers Being Similar",
    "mechanism_description": "Loss scales inversely with depth due to functionally similar layers reducing error through ensemble averaging rather than compositional learning. Residual architecture bias combined with incompatible target functions produces inefficient yet robust regime. Improving efficiency requires architectural innovations encouraging compositional depth usage instead of redundant layer averaging."
  },
  {
    "paper_id": 42,
    "arxiv_id": "2602.03490v1",
    "domain": "biology",
    "title": "Path Integration and Object-Location Binding in Predictive Sequence Model",
    "mechanism_description": "Action-conditioned sequential prediction enables path integration and dynamic object-location binding for world modeling. Prediction accuracy improves across sequence through in-context learning. Structured representations with flexible binding emerge to support prediction - new bindings learnable late in sequence, out-of-distribution bindings acquirable through sequential exposure."
  },
  {
    "paper_id": 45,
    "arxiv_id": "2602.03240v1",
    "domain": "biology",
    "title": "Information Processing Measures During Cognitive Tasks Using fMRI",
    "mechanism_description": "Active information storage (within-region retention), transfer entropy (directed flow), and net synergy (redundancy vs. synergy) quantify information processing. Cross mutual information combines resting-state and task data to address limited samples. AIS increases with cognitive load in fronto-parietal regions; TE reveals enhanced directed flows; net synergy shows global redundancy shift."
  },
  {
    "paper_id": 83,
    "arxiv_id": "2602.03129v1",
    "domain": "econ",
    "title": "Mathematical Modeling of Common-Pool Resources",
    "mechanism_description": "Paradigm shift from static optimization to dynamic resilience in commons management. Early deterministic bioeconomic models established individual-collective efficiency tension. Ostrom turn integrated institutional monitoring and sanctions into game theory. Evolutionary dynamics and behavioral economics relaxed rationality. Stochastic models capture spatial heterogeneity and noise-induced regime shifts with early warning signals."
  },
  {
    "paper_id": 87,
    "arxiv_id": "2602.02403v1",
    "domain": "econ",
    "title": "Strategic Interactions in Science and Technology Networks",
    "mechanism_description": "Productivity in scientific and technological activities increases with Katz-Bonacich centrality capturing within-activity and cross-activity complementarities. Scientific productivity significantly enhances technological output (asymmetric linkage), but technology does not reciprocally boost science. Science-driven innovation model where collaboration structure influences knowledge creation through network position and cross-domain spillovers."
  },
  {
    "paper_id": 107,
    "arxiv_id": "2601.22866v1",
    "domain": "q-bio",
    "title": "Classification of SARS-CoV-2 Variants through Epistatical Circos Plots",
    "mechanism_description": "Epistatic interactions visualized as Circos plots enable variant classification through CNN recognition of higher-order genetic dependencies. Direct coupling analysis generates plot patterns representing inter-residue correlations. CNN captures complex epistatic features with 99.26% accuracy, demonstrating visual pattern recognition can reveal evolutionary dynamics and adaptive mechanisms through learned dependency structures."
  },
  {
    "paper_id": 1425,
    "arxiv_id": "2602.01540v1",
    "domain": "cs",
    "title": "Feature-Separated Cross-Attention Network for Multi-Dataset Training",
    "mechanism_description": "Feature disentanglement into domain-invariant and domain-specific components mitigates negative transfer in multi-dataset training. Cross-attention fusion adaptively models component interactions. Mutual information optimization maximizes domain-invariant consistency while minimizing domain-specific redundancy. Complementary shared-private representations enable knowledge transfer while preserving dataset-specific discriminability."
  },
  {
    "paper_id": 1500,
    "arxiv_id": "2602.06949v1",
    "domain": "cs",
    "title": "DreamDojo: Robot World Model from Large-Scale Human Videos",
    "mechanism_description": "Continuous latent actions serve as unified proxy actions, enabling interaction knowledge transfer from unlabeled human videos to robot control. World model learns diverse interactions from 44k hours of egocentric video. Post-training on small-scale robot data yields physics understanding and precise action controllability. Generative modeling enables teleoperation, policy evaluation, and planning."
  },
  {
    "paper_id": 1533,
    "arxiv_id": "2602.06880v1",
    "domain": "cs",
    "title": "Decoupling Variance and Scale-Invariant Updates in Adaptive Gradient Descent",
    "mechanism_description": "Decomposing AdaGrad into variance adaptation and scale-invariant terms creates unified framework bridging vector-based and matrix spectral optimization. Variance adaptation improves blockwise smoothness for faster convergence. Decoupling enables seamless transition from coordinate-wise adaptation (Adam) to spectral descent (Muon) by separating second-order correction from coordinate scaling."
  },
  {
    "paper_id": 1563,
    "arxiv_id": "2602.06838v1",
    "domain": "cs",
    "title": "Adaptive Differentially Private Federated Learning with Bi-level Optimization",
    "mechanism_description": "Local compressed module regularizes representations to constrain gradient variability, mitigating noise amplification in heterogeneous federated learning. Adaptive gradient clipping dynamically adjusts thresholds based on historical statistics to avoid over-clipping. Constraint-aware aggregation suppresses unreliable noise-dominated updates, stabilizing global optimization under differential privacy."
  },
  {
    "paper_id": 1620,
    "arxiv_id": "2602.06567v1",
    "domain": "math",
    "title": "Markov Decision Processes: Learning Distributions by Policy Gradient",
    "mechanism_description": "Distributional MDPs steer cumulative reward distribution toward target law rather than optimizing expected value. Randomized Markov policies on augmented state space with characteristic-function loss enable distribution matching. Policy gradient converges to stationary points. Non-uniqueness phenomena emerge - multiple distinct policies can achieve same target distribution."
  },
  {
    "paper_id": 1635,
    "arxiv_id": "2602.06871v1",
    "domain": "cs",
    "title": "Residual Flow Diffusion Model for Efficient Causal Video Editing",
    "mechanism_description": "Residual-focused diffusion forward process encourages prediction of frame-to-frame differences, exploiting temporal redundancy. Causal conditioning on previous prediction enables variable-length video editing frame-by-frame. Focusing denoising on inter-frame changes rather than absolute content achieves efficiency of image models while handling video temporal structure autoregressively."
  },
  {
    "paper_id": 1781,
    "arxiv_id": "2602.06737v1",
    "domain": "cs",
    "title": "Optimal Abstractions for Verifying Kolmogorov-Arnold Networks",
    "mechanism_description": "Piecewise affine abstractions of nonlinear KAN activations enable property verification via MILP encoding. Optimal abstraction balances approximation pieces - too many cause intractability, too few yield uninformative bounds. Dynamic programming at unit level combined with knapsack optimization network-wide minimizes total pieces while guaranteeing error bounds."
  },
  {
    "paper_id": 1782,
    "arxiv_id": "2602.06733v1",
    "domain": "cs",
    "title": "Hypergraph Neural Networks for Multi-Agent Pathfinding",
    "mechanism_description": "Hypergraph attention captures group (beyond pairwise) coordination dynamics in multi-agent pathfinding. Standard GNNs limited to pairwise message passing suffer attention dilution in dense environments where group coordination is critical. Attentional mechanisms over directed hypergraphs explicitly model higher-order interactions, mitigating representational bottleneck and enabling complex coordination where pairwise methods fail."
  },
  {
    "paper_id": 1837,
    "arxiv_id": "2602.01147v1",
    "domain": "cs",
    "title": "Individual-Level Strategy Diversity in Differential Evolution",
    "mechanism_description": "Assigning mutation and crossover strategies independently to each individual at initialization and keeping them fixed creates persistent behavioral heterogeneity. Static individual-level diversity (no adaptation) cultivates search effectiveness especially with large populations. Communication-free construction enables intrinsic concurrency and efficient parallel execution."
  },
  {
    "paper_id": 1850,
    "arxiv_id": "2601.15689v1",
    "domain": "q-bio",
    "title": "Resting-State Connectivity Correlates of Emotional Memory Control",
    "mechanism_description": "Dissociable resting-state functional connectivity profiles support memory control efficiency across emotional valences. Efficient suppression of positive memories linked to reduced anterior cingulate-posterior perceptual coupling and diminished hippocampal-frontal connectivity. Suppression of negative memories associated with increased posterior parietal-lateral occipital connectivity. Anxiety moderates prefrontal connectivity relationships."
  },
  {
    "paper_id": 1970,
    "arxiv_id": "2602.06640v1",
    "domain": "q-bio",
    "title": "Habitat heterogeneity and dispersal network structure as drivers of metacommunity dynamics",
    "mechanism_description": "Effective dispersal kernel encodes both microscopic dynamical parameters and network topology in coarse-grained metacommunity model. Metapopulation capacity generalizes to non-uniform local extinction rates. Stochasticity from finite carrying capacities yields reduced one-dimensional description with universal finite-size scaling laws for extinction times. Homogeneous environments require fine-tuned marginally stable coexistence to avoid monodominance."
  },
  {
    "paper_id": 1978,
    "arxiv_id": "2602.03090v1",
    "domain": "q-bio",
    "title": "Temporal niche differentiation through plasticity enables coexistence",
    "mechanism_description": "Temporal niche differentiation through phenotypic plasticity in circadian rhythms enables species coexistence. Phase-locking of coupled oscillators creates temporal resource partitioning. Plasticity allows dynamic adjustment of activity timing based on competitor presence. Coexistence emerges when plastic responses generate sufficient temporal separation in resource use patterns."
  },
  {
    "paper_id": 2003,
    "arxiv_id": "2602.05889v1",
    "domain": "physics",
    "title": "Nonlinear wave mixing via collective oscillations",
    "mechanism_description": "Collective oscillations in many-body systems mediate nonlinear wave mixing without requiring strong single-particle nonlinearity. Coherent many-body response creates effective nonlinearity through collective mode coupling. Weak individual interactions amplified by collective dynamics generate strong wave mixing. Effective interaction strength scales with system size or coupling density."
  },
  {
    "paper_id": 2044,
    "arxiv_id": "2602.00890v1",
    "domain": "physics",
    "title": "Structure-aware imitation dynamics on higher-order networks",
    "mechanism_description": "Higher-order network structure (beyond pairwise) shapes imitation dynamics through group-dependent adoption rates. Information diversity achieved through structured sampling from local neighborhoods. Adoption probability depends on group composition and size, not just neighbor count. Network hypergraph structure determines equilibrium strategy distributions through sampling bias."
  },
  {
    "paper_id": 2056,
    "arxiv_id": "2602.01095v1",
    "domain": "q-bio",
    "title": "Bet-hedging through seed dormancy in fluctuating environments",
    "mechanism_description": "Seed dormancy as bet-hedging strategy in temporally fluctuating environments. Germination fraction trades off current reproduction against future survival through dormant seed bank. Optimal dormancy level depends on environmental variability - higher variance favors increased dormancy. Multi-year averaging through seed bank buffers against temporal unpredictability."
  },
  {
    "paper_id": 2061,
    "arxiv_id": "2602.01049v1",
    "domain": "q-bio",
    "title": "Division of labor emerges from heterogeneous thresholds",
    "mechanism_description": "Division of labor emerges from heterogeneous response thresholds combined with task-dependent positive feedback. Individuals with low thresholds specialize in corresponding tasks as they activate more frequently and self-reinforce. Threshold distribution determines whether population exhibits generalism or specialized subpopulations. Decentralized coordination through threshold heterogeneity without central control."
  },
  {
    "paper_id": 2064,
    "arxiv_id": "2602.00997v1",
    "domain": "q-bio",
    "title": "Adaptive immunity and infection dynamics under resource constraints",
    "mechanism_description": "Resource allocation trade-off between immune repertoire diversity and clone expansion. Broad repertoire enables better pathogen recognition but limits per-clone resources. Focused expansion provides strong response to known pathogens but reduces diversity. Optimal strategy depends on pathogen encounter rate and diversity - high diversity environments favor broad repertoires despite weaker per-clone responses."
  },
  {
    "paper_id": 316,
    "arxiv_id": "2602.05885v1",
    "domain": "cs",
    "title": "Dr. Kernel: RL for Kernel Generation",
    "mechanism_description": "Turn-level Reinforce-Leave-One-Out provides unbiased advantage estimation for multi-turn RL by excluding self from baseline. Prevents biased policy gradient from self-inclusion in GRPO. Profiling-based rewards and rejection sampling overcome lazy optimization where models hack training rewards prioritizing trivial correctness over meaningful optimization. Multi-turn mismatch correction ensures training stability."
  }
]
