{
  "metadata": {
    "session": 37,
    "date": "2026-02-10",
    "total_mechanisms": 54,
    "threshold": 0.35,
    "total_candidates": 165,
    "ready_for_review": true
  },
  "statistics": {
    "similarity_max": 0.7363924980163574,
    "similarity_mean": 0.4317522039919188,
    "similarity_median": 0.4108720123767853,
    "similarity_min": 0.3503267467021942,
    "domain_pairs": {
      "biology-physics": 47,
      "biology-unknown": 36,
      "biology-economics": 25,
      "physics-unknown": 21,
      "economics-physics": 13,
      "economics-unknown": 8,
      "computer_science-economics": 5,
      "biology-computer_science": 4,
      "computer_science-physics": 3,
      "computer_science-unknown": 3
    }
  },
  "candidates": [
    {
      "candidate_id": 41,
      "similarity": 0.7363924980163574,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 55,
      "similarity": 0.7285140752792358,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 36,
      "similarity": 0.7064264416694641,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 27,
      "similarity": 0.6691850423812866,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 38,
      "similarity": 0.6278334856033325,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 528,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Cell proliferation maintains cell area polydispersity in the growing fruit fly wing epithelium",
        "mechanism": "Cell proliferation generates area variability while mechanical forces regulate packing. Cell division creates size asymmetry between daughter cells. Mechanical constraints from neighbors limit expansion. Area polydispersity emerges from balance between proliferation-driven variability and mechanical relaxation. Cell-cell adhesion and cortical tension determine equilibrium distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 59,
      "similarity": 0.5998806953430176,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 916,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Chaotic Dynamics in Black Holes",
        "mechanism": "Particle motion in extremal configurations exhibits positive Lyapunov exponents indicating sensitivity to initial conditions. Chaos persists even at zero temperature. System parameters (spin, charge) modulate chaos strength - increasing one parameter strengthens chaotic behavior while the other weakens it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 81,
      "similarity": 0.5997282862663269,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 60,
      "similarity": 0.5702585577964783,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 917,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Critical Slowing Down at Bifurcations",
        "mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 20,
      "similarity": 0.5692121982574463,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 29,
      "similarity": 0.5687321424484253,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 953,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "R&D Spillovers and Regional Innovation",
        "mechanism": "R&D spillovers from one entity enhance innovation in neighboring entities. Strategic interactions follow Stackelberg dynamics where leaders and followers reach Nash equilibrium. Highly-qualified employment amplifies spillover effects, creating synergies between different types of R&D investment and regional innovation output."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 80,
      "similarity": 0.5607025027275085,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 126,
      "similarity": 0.548354983329773,
      "paper_1": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 90,
      "similarity": 0.5442763566970825,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 112,
      "similarity": 0.5400546193122864,
      "paper_1": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 88,
      "similarity": 0.5368675589561462,
      "paper_1": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 15,
      "similarity": 0.5344234704971313,
      "paper_1": {
        "paper_id": 451,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Optimal Harvesting in Stream Networks: Maximizing Biomass and Yield",
        "mechanism": "Resource stock accumulates from production flow. Exploitation (flow out) versus conservation (stock maintenance) tradeoff. Maximum sustainable yield occurs at intermediate stock level. Over-exploitation depletes stock below replenishment threshold causing collapse."
      },
      "paper_2": {
        "paper_id": 194,
        "arxiv_id": "2506.06165v1",
        "domain": "econ",
        "title": "Who sets the range? Funding mechanics and context in crypto markets",
        "mechanism": "Funding rates in perpetual futures impose economic costs on leveraged positions. High funding creates pressure to reduce directional exposure. Capital rebalancing occurs when funding costs exceed expected returns. Funding mechanisms act as negative feedback regulating trader behavior - extreme positions become economically unsustainable, creating mean-reverting pressure that defines trading ranges."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 69,
      "similarity": 0.5339190363883972,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 3,
      "similarity": 0.5338948965072632,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 74,
      "similarity": 0.5299366116523743,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 147,
      "similarity": 0.5260351896286011,
      "paper_1": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 75,
      "similarity": 0.5077577829360962,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 31,
      "similarity": 0.5039563179016113,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 2,
      "similarity": 0.5025008320808411,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 1969,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Growth Models Under Catastrophes",
        "mechanism": "Catastrophic events trigger population dispersal strategies. Dispersion affects survival probability and extinction time. Spatial constraints modulate the effectiveness of dispersal - unconstrained dispersion improves survival while spatial limits reduce the benefit, creating a trade-off between mobility and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 135,
      "similarity": 0.5011242032051086,
      "paper_1": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 73,
      "similarity": 0.5004019141197205,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 18,
      "similarity": 0.4955140948295593,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 58,
      "similarity": 0.4933968782424927,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 139,
      "similarity": 0.4904218316078186,
      "paper_1": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 118,
      "similarity": 0.4859185218811035,
      "paper_1": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "paper_2": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 32,
      "similarity": 0.4858662784099579,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 134,
      "similarity": 0.484524130821228,
      "paper_1": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 70,
      "similarity": 0.4831656515598297,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 16,
      "similarity": 0.4826944172382355,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 1969,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Growth Models Under Catastrophes",
        "mechanism": "Catastrophic events trigger population dispersal strategies. Dispersion affects survival probability and extinction time. Spatial constraints modulate the effectiveness of dispersal - unconstrained dispersion improves survival while spatial limits reduce the benefit, creating a trade-off between mobility and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 121,
      "similarity": 0.4821402132511139,
      "paper_1": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 82,
      "similarity": 0.4780120551586151,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 116,
      "similarity": 0.47761815786361694,
      "paper_1": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 157,
      "similarity": 0.47564268112182617,
      "paper_1": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 28,
      "similarity": 0.4743817448616028,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 66,
      "similarity": 0.4727591574192047,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 68,
      "similarity": 0.47053200006484985,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 120,
      "similarity": 0.4681107997894287,
      "paper_1": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 150,
      "similarity": 0.4678281247615814,
      "paper_1": {
        "paper_id": 152,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Metastability and ripening of multi-component liquid mixtures",
        "mechanism": "Multi-component mixtures undergo phase separation through unstable coexistence. Droplets grow via Ostwald ripening with characteristic scaling (radius ~ t^1/3, number ~ n^-2/3). Glass-like relaxation emerges from disordered interactions among components, creating long-lived metastable states. Different wetting angles characterize metastable configurations. Relaxation delay arises from kinetic barriers between metastable states."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 84,
      "similarity": 0.46412673592567444,
      "paper_1": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "paper_2": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 89,
      "similarity": 0.46404770016670227,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 922,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Controlling Extreme Events in Networks",
        "mechanism": "A single driving signal applied to one network component suppresses extreme events throughout the system. In coupled components, drive breaks phase-locking between elements. In networked systems, drive disrupts protoevent frequency dynamics causing frequency decoupling that prevents extreme event cascades."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 7,
      "similarity": 0.46329185366630554,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 78,
      "similarity": 0.46291446685791016,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 148,
      "similarity": 0.4626443088054657,
      "paper_1": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 51,
      "similarity": 0.4619598090648651,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 1969,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Growth Models Under Catastrophes",
        "mechanism": "Catastrophic events trigger population dispersal strategies. Dispersion affects survival probability and extinction time. Spatial constraints modulate the effectiveness of dispersal - unconstrained dispersion improves survival while spatial limits reduce the benefit, creating a trade-off between mobility and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 129,
      "similarity": 0.4618174731731415,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 94,
      "similarity": 0.4590227007865906,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 67,
      "similarity": 0.45603519678115845,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 79,
      "similarity": 0.45332223176956177,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 39,
      "similarity": 0.4494427442550659,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 529,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Stability and robustness of a generalized pump-leak model for epithelial cell and lumen volume regulation",
        "mechanism": "Epithelial cells regulate volume through coordinated ion pumps, channels, and paracellular pathways. Pumps actively transport ions creating concentration gradients. Osmotic pressure drives water flow following ion movement. Cell-lumen interaction creates coupled volume dynamics. Pump rates, leak permeabilities, and osmotic coupling determine stability. Feedback between cell volume and pump activity maintains homeostasis."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 123,
      "similarity": 0.4482216536998749,
      "paper_1": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 158,
      "similarity": 0.4470788538455963,
      "paper_1": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "paper_2": {
        "paper_id": 529,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Stability and robustness of a generalized pump-leak model for epithelial cell and lumen volume regulation",
        "mechanism": "Epithelial cells regulate volume through coordinated ion pumps, channels, and paracellular pathways. Pumps actively transport ions creating concentration gradients. Osmotic pressure drives water flow following ion movement. Cell-lumen interaction creates coupled volume dynamics. Pump rates, leak permeabilities, and osmotic coupling determine stability. Feedback between cell volume and pump activity maintains homeostasis."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 11,
      "similarity": 0.44693705439567566,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 136,
      "similarity": 0.44465914368629456,
      "paper_1": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 71,
      "similarity": 0.443512499332428,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 152,
      "similarity": 0.4400167763233185,
      "paper_1": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 138,
      "similarity": 0.43921250104904175,
      "paper_1": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 83,
      "similarity": 0.43657779693603516,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 122,
      "similarity": 0.435808002948761,
      "paper_1": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 33,
      "similarity": 0.43449899554252625,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 61,
      "similarity": 0.4272429347038269,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 918,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Thermalization in Discrete Systems",
        "mechanism": "Local ergodicity in subsystems, rather than global ergodicity, enables thermalization. Subsystem dynamics appear pseudorandom due to local interactions. Statistical properties of observables emerge from this effective local randomization without requiring the entire system to be ergodic."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 46,
      "similarity": 0.4264339208602905,
      "paper_1": {
        "paper_id": 542,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Compartmental-reaction diffusion framework for microscale dynamics of extracellular serotonin",
        "mechanism": "Serotonin released from varicosities diffuses through extracellular space. Diffusion couples neighboring varicosities into microdomains. Uptake kinetics (reuptake) removes serotonin creating concentration gradients. Firing frequency, geometry, and uptake shape spatial serotonin reservoirs. Local versus volume transmission determined by diffusive coupling strength."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 117,
      "similarity": 0.4261544346809387,
      "paper_1": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 153,
      "similarity": 0.4256889820098877,
      "paper_1": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 92,
      "similarity": 0.4244193732738495,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 48,
      "similarity": 0.4241386950016022,
      "paper_1": {
        "paper_id": 542,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Compartmental-reaction diffusion framework for microscale dynamics of extracellular serotonin",
        "mechanism": "Serotonin released from varicosities diffuses through extracellular space. Diffusion couples neighboring varicosities into microdomains. Uptake kinetics (reuptake) removes serotonin creating concentration gradients. Firing frequency, geometry, and uptake shape spatial serotonin reservoirs. Local versus volume transmission determined by diffusive coupling strength."
      },
      "paper_2": {
        "paper_id": 529,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Stability and robustness of a generalized pump-leak model for epithelial cell and lumen volume regulation",
        "mechanism": "Epithelial cells regulate volume through coordinated ion pumps, channels, and paracellular pathways. Pumps actively transport ions creating concentration gradients. Osmotic pressure drives water flow following ion movement. Cell-lumen interaction creates coupled volume dynamics. Pump rates, leak permeabilities, and osmotic coupling determine stability. Feedback between cell volume and pump activity maintains homeostasis."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 63,
      "similarity": 0.4213249683380127,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 5,
      "similarity": 0.42117974162101746,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 101,
      "similarity": 0.421172171831131,
      "paper_1": {
        "paper_id": 921,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Parametrically Excited Oscillator",
        "mechanism": "Time-periodic stiffness variation induces parametric excitation in coupled components. Nonlinear restoring forces and friction interact to produce a spectrum of dynamic responses including periodic, quasi-periodic, and chaotic behaviors. System parameters (stiffness degree, mass symmetry, friction) determine stability boundaries and response amplitude."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 54,
      "similarity": 0.4195048213005066,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 149,
      "similarity": 0.4185062646865845,
      "paper_1": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 19,
      "similarity": 0.4177713096141815,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 141,
      "similarity": 0.416710764169693,
      "paper_1": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 105,
      "similarity": 0.41598448157310486,
      "paper_1": {
        "paper_id": 950,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Group Selection and AI Substitution",
        "mechanism": "AI use reduces cultural variance in populations. Under individual selection, agents relying heavily on AI (substitutes) outcompete those using AI as complement, despite reducing variance more. Group selection can favor agents that maintain variance through complementary AI use when group boundaries are strong, creating selection-level competition."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 104,
      "similarity": 0.41395437717437744,
      "paper_1": {
        "paper_id": 950,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Group Selection and AI Substitution",
        "mechanism": "AI use reduces cultural variance in populations. Under individual selection, agents relying heavily on AI (substitutes) outcompete those using AI as complement, despite reducing variance more. Group selection can favor agents that maintain variance through complementary AI use when group boundaries are strong, creating selection-level competition."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 132,
      "similarity": 0.4135516881942749,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 43,
      "similarity": 0.41137468814849854,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 797,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Imperfect molecular detection renormalizes apparent kinetic rates",
        "mechanism": "Imperfect molecular detection in single-cell measurements introduces technical noise obscuring true dynamics. Binomial capture models describe detection inefficiency. Under high transcription factor abundance or timescale separation, capture effects renormalize kinetic rates. Apparent mean burst size appears reduced while binding reactions appear faster. Technical noise reshapes observed statistics without changing underlying mechanism - creates measurement-induced effective parameters."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 144,
      "similarity": 0.4112178683280945,
      "paper_1": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 64,
      "similarity": 0.4110393822193146,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 162,
      "similarity": 0.4108720123767853,
      "paper_1": {
        "paper_id": 544,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Photonic neuromorphic processing with coupled spiking silicon microrings",
        "mechanism": "Coupled microring resonators exhibit nonlinear optical dynamics with internal feedback. Injection power and wavelength control dynamical regimes: analogue, spiking, or bistable responses. Nonlinearities create sharp transitions in dynamical complexity at regime boundaries. Spiking dynamics generate sparse activity patterns. Thermal bistabilities emerge at low power enhancing computational capacity. Power-wavelength phase space determines accessible dynamical states."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 140,
      "similarity": 0.4086957275867462,
      "paper_1": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 45,
      "similarity": 0.40642789006233215,
      "paper_1": {
        "paper_id": 542,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Compartmental-reaction diffusion framework for microscale dynamics of extracellular serotonin",
        "mechanism": "Serotonin released from varicosities diffuses through extracellular space. Diffusion couples neighboring varicosities into microdomains. Uptake kinetics (reuptake) removes serotonin creating concentration gradients. Firing frequency, geometry, and uptake shape spatial serotonin reservoirs. Local versus volume transmission determined by diffusive coupling strength."
      },
      "paper_2": {
        "paper_id": 152,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Metastability and ripening of multi-component liquid mixtures",
        "mechanism": "Multi-component mixtures undergo phase separation through unstable coexistence. Droplets grow via Ostwald ripening with characteristic scaling (radius ~ t^1/3, number ~ n^-2/3). Glass-like relaxation emerges from disordered interactions among components, creating long-lived metastable states. Different wetting angles characterize metastable configurations. Relaxation delay arises from kinetic barriers between metastable states."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 62,
      "similarity": 0.40640759468078613,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 921,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Parametrically Excited Oscillator",
        "mechanism": "Time-periodic stiffness variation induces parametric excitation in coupled components. Nonlinear restoring forces and friction interact to produce a spectrum of dynamic responses including periodic, quasi-periodic, and chaotic behaviors. System parameters (stiffness degree, mass symmetry, friction) determine stability boundaries and response amplitude."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 56,
      "similarity": 0.4052417278289795,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 165,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "How adaptation to food resources and death rates shape oscillatory dynamics",
        "mechanism": "Microbes adapt to food supply while experiencing death. Oscillations emerge when adaptation timescale exceeds death timescale. Consumer-resource dynamics couple population growth to substrate replenishment. Multiple timescale interactions determine stability - slow adaptation relative to death enables oscillatory behavior. Necromass recycling and complementary food sources dampen oscillations by facilitating growth."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 97,
      "similarity": 0.40429651737213135,
      "paper_1": {
        "paper_id": 917,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Critical Slowing Down at Bifurcations",
        "mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 114,
      "similarity": 0.4031620919704437,
      "paper_1": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 161,
      "similarity": 0.40179243683815,
      "paper_1": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 154,
      "similarity": 0.4011448919773102,
      "paper_1": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "paper_2": {
        "paper_id": 528,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Cell proliferation maintains cell area polydispersity in the growing fruit fly wing epithelium",
        "mechanism": "Cell proliferation generates area variability while mechanical forces regulate packing. Cell division creates size asymmetry between daughter cells. Mechanical constraints from neighbors limit expansion. Area polydispersity emerges from balance between proliferation-driven variability and mechanical relaxation. Cell-cell adhesion and cortical tension determine equilibrium distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 137,
      "similarity": 0.4007781445980072,
      "paper_1": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "paper_2": {
        "paper_id": 165,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "How adaptation to food resources and death rates shape oscillatory dynamics",
        "mechanism": "Microbes adapt to food supply while experiencing death. Oscillations emerge when adaptation timescale exceeds death timescale. Consumer-resource dynamics couple population growth to substrate replenishment. Multiple timescale interactions determine stability - slow adaptation relative to death enables oscillatory behavior. Necromass recycling and complementary food sources dampen oscillations by facilitating growth."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 53,
      "similarity": 0.3995992839336395,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 106,
      "similarity": 0.39918646216392517,
      "paper_1": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "paper_2": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 108,
      "similarity": 0.3989531695842743,
      "paper_1": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 72,
      "similarity": 0.3988940119743347,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 4,
      "similarity": 0.39860957860946655,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 130,
      "similarity": 0.3980470597743988,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 76,
      "similarity": 0.39724332094192505,
      "paper_1": {
        "paper_id": 87,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Strategic Interactions in Science and Technology Networks",
        "mechanism": "An agent's position in a collaboration network determines their productivity. Higher network centrality increases output through strategic complementarities with connected agents. Activity in one domain (scientific) enhances productivity in another domain (technological), but this effect is asymmetric - the reverse direction shows no detectable influence."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 37,
      "similarity": 0.3971535265445709,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 10,
      "similarity": 0.3964305520057678,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 146,
      "similarity": 0.394602507352829,
      "paper_1": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 65,
      "similarity": 0.3945636749267578,
      "paper_1": {
        "paper_id": 2,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Discrete dynamical systems with scaling and inversion symmetries",
        "mechanism": "System state evolves discretely through iterated function. Scaling symmetry preserves dynamics under magnification/contraction. Near fixed points, small perturbations grow exponentially (positive Lyapunov exponent) causing sensitive dependence. Trajectories confined to fractal attractor with non-integer dimension. Chaotic regime characterized by scaling laws and self-similarity across scales."
      },
      "paper_2": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 87,
      "similarity": 0.3936414420604706,
      "paper_1": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 96,
      "similarity": 0.39310944080352783,
      "paper_1": {
        "paper_id": 916,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Chaotic Dynamics in Black Holes",
        "mechanism": "Particle motion in extremal configurations exhibits positive Lyapunov exponents indicating sensitivity to initial conditions. Chaos persists even at zero temperature. System parameters (spin, charge) modulate chaos strength - increasing one parameter strengthens chaotic behavior while the other weakens it."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 34,
      "similarity": 0.39285823702812195,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 100,
      "similarity": 0.39148929715156555,
      "paper_1": {
        "paper_id": 917,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Critical Slowing Down at Bifurcations",
        "mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 119,
      "similarity": 0.3905911147594452,
      "paper_1": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 102,
      "similarity": 0.3901035487651825,
      "paper_1": {
        "paper_id": 922,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Controlling Extreme Events in Networks",
        "mechanism": "A single driving signal applied to one network component suppresses extreme events throughout the system. In coupled components, drive breaks phase-locking between elements. In networked systems, drive disrupts protoevent frequency dynamics causing frequency decoupling that prevents extreme event cascades."
      },
      "paper_2": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 86,
      "similarity": 0.39008790254592896,
      "paper_1": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 145,
      "similarity": 0.38831964135169983,
      "paper_1": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 50,
      "similarity": 0.38793042302131653,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 125,
      "similarity": 0.3876412510871887,
      "paper_1": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 24,
      "similarity": 0.38749152421951294,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 95,
      "similarity": 0.38589462637901306,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 164,
      "similarity": 0.38548800349235535,
      "paper_1": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 12,
      "similarity": 0.3854581415653229,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 115,
      "similarity": 0.38435477018356323,
      "paper_1": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 1,
      "similarity": 0.3838654160499573,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 128,
      "similarity": 0.38289257884025574,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 862,
        "arxiv_id": "2503.06041v1",
        "domain": "econ",
        "title": "Manipulation in Prediction Markets",
        "mechanism": "Manipulators with high budgets attempt to distort prediction market prices. Informed traders with correct beliefs observe price distortions and increase their opposing bets. Market depth and information heterogeneity determine manipulation effectiveness. When information is dispersed, manipulation can temporarily move prices, but informed arbitrage eventually corrects mispricing. Manipulator budget and trader information quality create a competitive dynamic."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 131,
      "similarity": 0.3801216781139374,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 354,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Emergent structures in coupled opinion and network dynamics",
        "mechanism": "Individuals' opinions and network edge weights coevolve through coupled dynamics. Interaction strength depends on opinion distance. Similar opinions strengthen network connections. Connection strength amplifies opinion influence. This creates feedback between opinion convergence and network structure formation. Interaction function form determines emergent structures and stability."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 9,
      "similarity": 0.37937119603157043,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 52,
      "similarity": 0.37782204151153564,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 151,
      "similarity": 0.37638652324676514,
      "paper_1": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 49,
      "similarity": 0.37563827633857727,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 160,
      "similarity": 0.3753773868083954,
      "paper_1": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 47,
      "similarity": 0.37508463859558105,
      "paper_1": {
        "paper_id": 542,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Compartmental-reaction diffusion framework for microscale dynamics of extracellular serotonin",
        "mechanism": "Serotonin released from varicosities diffuses through extracellular space. Diffusion couples neighboring varicosities into microdomains. Uptake kinetics (reuptake) removes serotonin creating concentration gradients. Firing frequency, geometry, and uptake shape spatial serotonin reservoirs. Local versus volume transmission determined by diffusive coupling strength."
      },
      "paper_2": {
        "paper_id": 528,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Cell proliferation maintains cell area polydispersity in the growing fruit fly wing epithelium",
        "mechanism": "Cell proliferation generates area variability while mechanical forces regulate packing. Cell division creates size asymmetry between daughter cells. Mechanical constraints from neighbors limit expansion. Area polydispersity emerges from balance between proliferation-driven variability and mechanical relaxation. Cell-cell adhesion and cortical tension determine equilibrium distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 99,
      "similarity": 0.37464016675949097,
      "paper_1": {
        "paper_id": 917,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Critical Slowing Down at Bifurcations",
        "mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes."
      },
      "paper_2": {
        "paper_id": 540,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Coarse-graining and stochastic oscillations in cell-size homeostasis",
        "mechanism": "Cell size feedback operates through size deviations (difference between absolute size and cell-cycle progression). Feedback from size to growth rate and cycle timing creates coupled dynamics. In linear regime, dynamics reduce to stochastically forced harmonic oscillator. Cell-cycle timing and intrinsic fluctuations jointly shape size control strategy. Mechanistic feedback structure may differ from apparent coarse-grained correlations due to noise integration."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 111,
      "similarity": 0.3741067945957184,
      "paper_1": {
        "paper_id": 1969,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Growth Models Under Catastrophes",
        "mechanism": "Catastrophic events trigger population dispersal strategies. Dispersion affects survival probability and extinction time. Spatial constraints modulate the effectiveness of dispersal - unconstrained dispersion improves survival while spatial limits reduce the benefit, creating a trade-off between mobility and stability."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 165,
      "similarity": 0.3706170916557312,
      "paper_1": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 98,
      "similarity": 0.3704916536808014,
      "paper_1": {
        "paper_id": 917,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Critical Slowing Down at Bifurcations",
        "mechanism": "As a system approaches a bifurcation point, convergence to steady state slows dramatically. Near criticality, relaxation time diverges according to universal scaling laws. The system exhibits characteristic critical exponents that govern short-time behavior, asymptotic decay, and crossover between regimes."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 124,
      "similarity": 0.37012314796447754,
      "paper_1": {
        "paper_id": 1973,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Free-Rider Problem in Shared Resources",
        "mechanism": "Shared resource use creates a cooperation dilemma with cleaning costs, contamination risk, and social incentives forming competing pressures. Cleaning cost primarily determines stability of altruistic behavior. The system exhibits multi-stability and hysteresis - small parameter changes can cause abrupt shifts between cooperation and free-riding equilibria."
      },
      "paper_2": {
        "paper_id": 864,
        "arxiv_id": "2503.05613v1",
        "domain": "econ",
        "title": "Who Restores the Peg? Stablecoin Market Dynamics",
        "mechanism": "Stablecoin prices de-peg during stress events. Arbitrageurs restore the peg by trading against deviations. Arbitrage profitability depends on deviation magnitude and transaction costs. Insufficient arbitrage activity allows persistent de-pegging. Mean-field dynamics aggregate individual arbitrage decisions into collective peg restoration. Market participant heterogeneity and risk aversion determine collective restoration speed."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 113,
      "similarity": 0.3689558804035187,
      "paper_1": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "paper_2": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 143,
      "similarity": 0.3679509162902832,
      "paper_1": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 25,
      "similarity": 0.36690956354141235,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 352,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "The impact of heterogeneity on the co-evolution of cooperation and epidemics",
        "mechanism": "Cooperation and disease transmission coevolve through network structure. Structural heterogeneity creates leverage points - highly connected hubs adopt protection due to amplified risk, catalyzing cooperation. Cost heterogeneity creates weakest links - low-risk individuals free-ride and act as disease reservoirs, undermining cooperation. Heterogeneity is double-edged: influence asymmetry facilitates cooperation, motivation asymmetry degrades it."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 35,
      "similarity": 0.36650869250297546,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 133,
      "similarity": 0.36588412523269653,
      "paper_1": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 14,
      "similarity": 0.365403413772583,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 6,
      "similarity": 0.3648543655872345,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 110,
      "similarity": 0.36405929923057556,
      "paper_1": {
        "paper_id": 1969,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Growth Models Under Catastrophes",
        "mechanism": "Catastrophic events trigger population dispersal strategies. Dispersion affects survival probability and extinction time. Spatial constraints modulate the effectiveness of dispersal - unconstrained dispersion improves survival while spatial limits reduce the benefit, creating a trade-off between mobility and stability."
      },
      "paper_2": {
        "paper_id": 168,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Cross-feeding yields high-dimensional chaos and coexistence of species",
        "mechanism": "Species cross-feed through metabolite leakage and uptake. Competitive uptake of leaked chemicals creates coupled population-chemical dynamics. Network structure determines attractor types: fixed points, limit cycles, low-dimensional chaos, or high-dimensional chaos. High-dimensional chaos enables coexistence beyond competitive exclusion limits through intermittent switching among quasi-stationary states. Chemical dynamics explore high-dimensional space while populations switch intermittently."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 57,
      "similarity": 0.3635222017765045,
      "paper_1": {
        "paper_id": 370,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Learning virulence-transmission relationships using causal inference",
        "mechanism": "Pathogen virulence (harm to host) causally influences transmission rate (spread to new hosts). Increased virulence may increase transmission initially but reduces host mobility decreasing spread. Trade-off creates optimal virulence level maximizing transmission. Evolutionary dynamics drive virulence toward this optimum. Past virulence predicts future transmission but not vice versa (directional causality)."
      },
      "paper_2": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 21,
      "similarity": 0.3627742826938629,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 127,
      "similarity": 0.3598293364048004,
      "paper_1": {
        "paper_id": 457,
        "arxiv_id": "2602.01492v1",
        "domain": "q-bio",
        "title": "From Discrete to Continuous Mixed Populations of Conformists, Nonconformists, and Imitators",
        "mechanism": "Three behavioral types interact: conformists benefit from choosing common strategies, nonconformists profit from rare strategies, and imitators copy highest earners. Population proportions fluctuate in finite populations but equilibrate as population size increases. Strategy proportions undergo perpetual oscillations in small populations, but fluctuation amplitudes approach zero in large populations through stochastic averaging."
      },
      "paper_2": {
        "paper_id": 199,
        "arxiv_id": "2506.03914v1",
        "domain": "econ",
        "title": "Mean-Field Price Formation with Network of Relative Performance Concerns",
        "mechanism": "Agents care about their performance relative to connected peers. Relative performance concerns create strategic interdependencies through network links. Risk-taking behavior adjusts based on peer comparisons. Network topology determines how competitive pressures propagate. This peer comparison mechanism affects equilibrium asset prices through aggregated strategic adjustments."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 77,
      "similarity": 0.3597835302352905,
      "paper_1": {
        "paper_id": 100,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Human-AI Cooperation in Public Goods Game",
        "mechanism": "Reciprocal group dynamics and behavioral inertia drive cooperation levels in groups. Cooperation depends on observed group behavior patterns rather than the identity of participants. These normative mechanisms operate identically regardless of agent type, creating stable cooperation patterns through behavioral feedback."
      },
      "paper_2": {
        "paper_id": 1971,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Fish Migration and Feller Condition",
        "mechanism": "The ratio between diffusion and drift (Feller condition) determines qualitative migration properties. High diffusion relative to drift creates randomized, intermittent movement patterns. Low ratio produces more deterministic, continuous movement. This ratio acts as a control parameter governing timescale-dependent behavioral transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 142,
      "similarity": 0.35962650179862976,
      "paper_1": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "paper_2": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 159,
      "similarity": 0.35923078656196594,
      "paper_1": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "paper_2": {
        "paper_id": 532,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Thermodynamic Constraints Drive Hierarchical Preemption in Cellular Decision-Making",
        "mechanism": "Under stress, cells face rapid pathway selection with ATP scarcity. Continuous ATP regeneration rescues sporulation despite 99.7% ATP depletion. GTP accumulates as energy buffer while ATP regenerates preventing complete depletion. Stochastic regulatory transitions couple to continuous metabolic flux. Energy efficiency emerges from interplay between discrete regulatory logic and continuous thermodynamic constraints. System robustness through dynamic energy management enables 16-fold efficiency gain under stress."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 103,
      "similarity": 0.3584204912185669,
      "paper_1": {
        "paper_id": 922,
        "arxiv_id": "N/A",
        "domain": "nlin",
        "title": "Controlling Extreme Events in Networks",
        "mechanism": "A single driving signal applied to one network component suppresses extreme events throughout the system. In coupled components, drive breaks phase-locking between elements. In networked systems, drive disrupts protoevent frequency dynamics causing frequency decoupling that prevents extreme event cascades."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 40,
      "similarity": 0.35746297240257263,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 992,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Allostery Beyond Amplification: Temporal Regulation of Signaling Information",
        "mechanism": "Allosteric regulation modulates enzyme activity temporally rather than just amplifying output. Regulatory state switches affect timing of downstream signaling. Information content in signaling depends on temporal patterns not just abundance. Regulatory switching creates temporal encoding of information. Fast switching increases information transmission while slow switching filters noise."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 8,
      "similarity": 0.35734066367149353,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 530,
        "arxiv_id": "2602.00044v1",
        "domain": "q-bio",
        "title": "Cell size control in bacteria",
        "mechanism": "Cell size fluctuates due to noisy growth rates and size-dependent division noise. Size homeostasis mechanisms compensate for fluctuations through size control strategies. Population dynamics alter size distributions compared to single lineages - exponential population growth changes the effective size control measured in constant-volume experiments. Extrinsic growth noise and population structure jointly determine observed size distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 42,
      "similarity": 0.35679325461387634,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 85,
      "similarity": 0.3558385968208313,
      "paper_1": {
        "paper_id": 644,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Semantic Memory to Collective Creativity",
        "mechanism": "Individual semantic network topology determines ideational breadth. When agents exchange ideation traces, lower initial overlap predicts larger stimulation gains. Shared inspiration sources create network-level redundancy, forming feedback between individual cognitive structure and collective outcomes."
      },
      "paper_2": {
        "paper_id": 950,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "Group Selection and AI Substitution",
        "mechanism": "AI use reduces cultural variance in populations. Under individual selection, agents relying heavily on AI (substitutes) outcompete those using AI as complement, despite reducing variance more. Group selection can favor agents that maintain variance through complementary AI use when group boundaries are strong, creating selection-level competition."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 17,
      "similarity": 0.35580891370773315,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 1970,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Habitat Heterogeneity and Metacommunity Dynamics",
        "mechanism": "Spatial structure and dispersal networks jointly determine species persistence. Heterogeneous habitats support stable coexistence only above a critical heterogeneity threshold. Homogeneous environments allow coexistence only in a fine-tuned marginal state, creating instability. Network topology encodes dispersal effectiveness through an effective kernel."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 13,
      "similarity": 0.3557724356651306,
      "paper_1": {
        "paper_id": 448,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Intermittent precipitation and spatial Allee effects drive irregular vegetation patterns",
        "mechanism": "Plants facilitate neighboring growth through local resource modification. Facilitation competes with resource competition. When precipitation is intermittent, facilitation-competition balance creates spatial vegetation patterns. Below threshold density, vegetation collapses due to weakened facilitation (spatial Allee effect)."
      },
      "paper_2": {
        "paper_id": 528,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Cell proliferation maintains cell area polydispersity in the growing fruit fly wing epithelium",
        "mechanism": "Cell proliferation generates area variability while mechanical forces regulate packing. Cell division creates size asymmetry between daughter cells. Mechanical constraints from neighbors limit expansion. Area polydispersity emerges from balance between proliferation-driven variability and mechanical relaxation. Cell-cell adhesion and cortical tension determine equilibrium distributions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 91,
      "similarity": 0.35517409443855286,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 462,
        "arxiv_id": "2602.06036v1",
        "domain": "q-bio",
        "title": "Multi-strain SIS dynamics with coinfection under host population structure",
        "mechanism": "Multiple pathogen strains circulate and co-infect hosts with different susceptibilities and clearance rates. Host population structure creates differential transmission pathways across classes. Strain interactions through coinfection alter individual transmission dynamics. Class-specific epidemiological traits modulate strain competition and coexistence patterns."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 156,
      "similarity": 0.3548029661178589,
      "paper_1": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 26,
      "similarity": 0.3544002175331116,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 30,
      "similarity": 0.35436391830444336,
      "paper_1": {
        "paper_id": 77,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Collaboration for the Bioeconomy -- Evidence from Innovation Output in Sweden",
        "mechanism": "Firms collaborate forming innovation network. Central firms access diverse knowledge from multiple partners enhancing innovation output. Peripheral firms limited by fewer connections. Network structure (centrality) determines innovation capacity. Successful innovators attract more partners (preferential attachment) reinforcing centrality advantage."
      },
      "paper_2": {
        "paper_id": 461,
        "arxiv_id": "2602.03835v1",
        "domain": "q-bio",
        "title": "Indirect Reciprocity with Environmental Feedback",
        "mechanism": "Individual behaviors shape reputation through social norms while simultaneously affecting collective resource levels. Environmental changes alter payoff structures, creating feedback between strategic behavior and resource dynamics. Reputation-based cooperation interacts with ecological constraints - cooperative behaviors deplete or enhance shared resources, which then reshape the incentives for future cooperation."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 163,
      "similarity": 0.35316693782806396,
      "paper_1": {
        "paper_id": 153,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Heterogeneity dominates irreversibility in random Markov models",
        "mechanism": "Markov dynamics combine heterogeneity and asymmetry (broken detailed balance). Heterogeneity parameter controls transition rate variability. Asymmetry parameter controls forward-backward correlation. Critical locus emerges where relaxation times diverge. Entropy production and predictive information depend strongly on heterogeneity but weakly on asymmetry. Near criticality, small heterogeneity changes cause large dynamical shifts."
      },
      "paper_2": {
        "paper_id": 532,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Thermodynamic Constraints Drive Hierarchical Preemption in Cellular Decision-Making",
        "mechanism": "Under stress, cells face rapid pathway selection with ATP scarcity. Continuous ATP regeneration rescues sporulation despite 99.7% ATP depletion. GTP accumulates as energy buffer while ATP regenerates preventing complete depletion. Stochastic regulatory transitions couple to continuous metabolic flux. Energy efficiency emerges from interplay between discrete regulatory logic and continuous thermodynamic constraints. System robustness through dynamic energy management enables 16-fold efficiency gain under stress."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 109,
      "similarity": 0.3526499271392822,
      "paper_1": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 23,
      "similarity": 0.35215136408805847,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 165,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "How adaptation to food resources and death rates shape oscillatory dynamics",
        "mechanism": "Microbes adapt to food supply while experiencing death. Oscillations emerge when adaptation timescale exceeds death timescale. Consumer-resource dynamics couple population growth to substrate replenishment. Multiple timescale interactions determine stability - slow adaptation relative to death enables oscillatory behavior. Necromass recycling and complementary food sources dampen oscillations by facilitating growth."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 22,
      "similarity": 0.3516022264957428,
      "paper_1": {
        "paper_id": 452,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Uncertainty in Island-based Ecosystem Services and Climate Change",
        "mechanism": "Transmission rate increases with infected density. Recovery rate decreases infection duration. When transmission exceeds recovery (R0>1), epidemic spreads exponentially. Vaccination reduces susceptible population shifting R0 below 1. Spatial heterogeneity creates local pockets where R0 varies."
      },
      "paper_2": {
        "paper_id": 191,
        "arxiv_id": "2506.07896v1",
        "domain": "econ",
        "title": "Technology Adoption and Network Externalities in Financial Systems",
        "mechanism": "Technology adoption spreads through spatial and network channels. Spatial spillovers and network externalities interact multiplicatively - nearby adoption and connected peer adoption amplify each other. Cumulative adoption pressure accumulates along stochastic paths through spatial-network space. Network position amplifies or dampens spatial effects, creating non-linear adoption dynamics."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 155,
      "similarity": 0.3514249622821808,
      "paper_1": {
        "paper_id": 169,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Distinguishable spreading dynamics in microbial communities",
        "mechanism": "Proliferation limitations determine spreading dynamics. Growth arrest causes superlinear spreading at reduced rate. Pressure-limited growth produces linear constant-speed spreading. Nutrient-limited growth exhibits phase transition: superlinear when nutrient supply is high, sublinear when depleted. Nutrient supply and conversion efficiency determine phase boundary. Spreading rate distinguishes dominant limitation type."
      },
      "paper_2": {
        "paper_id": 791,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Distributed delay stabilizes bistable genetic networks",
        "mechanism": "Protein production involves delayed multi-step process (transcription, translation, folding, oligomerization). Delay is distributed (noisy) due to stochastic process durations. Increasing delay noise dramatically stabilizes metastable states in bistable circuits. Mean residence times in metastable states increase with delay distribution width. Distributed delay prevents unwanted switching caused by small fluctuations while allowing controlled transitions."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 107,
      "similarity": 0.35107186436653137,
      "paper_1": {
        "paper_id": 1943,
        "arxiv_id": "N/A",
        "domain": "cs",
        "title": "Seed Node Position and Network Damage",
        "mechanism": "Localized damage initiates at a seed node and propagates to neighbors. The structural position of the seed node (local connectivity and topology) amplifies or dampens damage progression. Cumulative link severing during attack progression depends critically on seed node characteristics rather than average network properties."
      },
      "paper_2": {
        "paper_id": 1972,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "Threshold Resource Redistribution in Kinship Networks",
        "mechanism": "When agents fall below a resource threshold, they solicit resources from connected neighbors based on relatedness. Redistribution creates feedback between kinship network structure and reproduction ability. This enables population survival at lower resource densities but increases network heterogeneity and local centralization."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 44,
      "similarity": 0.3507322669029236,
      "paper_1": {
        "paper_id": 525,
        "arxiv_id": "N/A",
        "domain": "unknown",
        "title": "Effects of multi-phase control mechanism on fibroblast dynamics",
        "mechanism": "Cell size determined by control mechanisms across cell cycle phases (sizer, timer, adder strategies). Division kernel and phase-specific control govern size distribution. Population-density-dependent regulation limits total cell numbers (extrinsic feedback). Cell-size-dependent regulation suppresses size variability (intrinsic feedback). Trade-off between extrinsic and intrinsic control."
      },
      "paper_2": {
        "paper_id": 799,
        "arxiv_id": "N/A",
        "domain": "q-bio",
        "title": "A theory for coexistence and selection of branched actin networks",
        "mechanism": "Multiple branched actin networks compete for shared monomer pool. Network growth locally depletes monomers creating negative feedback between network density and growth rate. Local depletion couples network growth rates through shared resource. Under weak competition, networks coexist at steady state. Under strong competition, selection replaces coexistence - fastest-growing network excludes others. Competition strength determined by monomer availability and consumption rates."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    },
    {
      "candidate_id": 93,
      "similarity": 0.3503267467021942,
      "paper_1": {
        "paper_id": 814,
        "arxiv_id": "N/A",
        "domain": "econ",
        "title": "DeFi Credit Exposures and Contagion",
        "mechanism": "Token-mediated dependencies create dense inter-component connections. A shock to one component propagates through dependency links causing contagion effects. Network topology and link weights determine the extent and path of cascading failures across the system."
      },
      "paper_2": {
        "paper_id": 166,
        "arxiv_id": "N/A",
        "domain": "physics",
        "title": "Intelligent Control of Transportation Flow in Physarum Networks",
        "mechanism": "Physarum network morphology responds to environmental stimuli by expanding or retracting tubes. Cytoplasmic flow bidirectionally transports nutrients through the network. Flow patterns optimize based on nutrient source locations. Network adapts topology through tube reinforcement when flow is high and tube degradation when flow is low. This creates an intelligent search for optimal transport paths through flow-structure feedback."
      },
      "review_status": "pending",
      "rating": null,
      "notes": null
    }
  ]
}